{
  "anumber": "A10712436",
  "id": "A10712436_0040",
  "page_index": 40,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10712436_0040/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REPUBLICa DE EL SALVADOR EN LA AMERICA CENTRAL, CORTÉ DE CUENTAS"
    },
    "years": {
      "ms_years_nlp_v1": [
        1955
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "No 019578 1955 SALVADO, DOR ENLA DE EL SECURITY SIGNATURE AMERICAN I CORTE DE CUENTIS HOMELAND CINCO COLONES CINCUENTA CENTAVOS T.R. 019487 I Número noventidos. -En la ciudad de San Salvador, a las diez horas del 2 día ocho de octubre de mil novecientos cincuentiseis. -Ante mi,Nicolás 3 Rogerio Melara,Abogado y Notario, de este domicilio, y testigos hábi- 4 les y de mi conocimiento que adelante diré, comparece don Rafael Ren- deros Menéndez, quien firma \"Raf. Renderos M. If de cincuentinueve años 5 de edad, Tenedor de Libros, de este domicilio,con cédula de vecindad- 6 7 número setecientos sesenticuatro mil trescientos cuatro Serie \"A\" y- 8 dice:que para asegurar la realización del viaje que la señora Rosa A- 9 minta Renderos desea hacer a Estados Unidos de America y la posibili- 10 dad de que permanezca en ese país durante el tiempo que fuere necesa- ric o sea por el tiempo que se le permita residir en aquel país por- 11 las Autoridades correspondientes, el compareciente se compromete a - 12 13 pagar los gastos necesarios para su regreso a este país, cuando desee regresar Q cuando expire o sea cancelado el permiso de permanencia - 14 que las Autoridades americanas lo concedan;que formalizan este com- 15 promiso de pago de los gastos indicados porque quiere facilitar la - 16 entrada y permanencia de su sobrina legítima Rosa Aminta Renderos, , pa- 17 ra que pueda permanecer en los Estados Unidos de America el tiempo - 18 que le sea permitido y quiere asegurar que en ningún caso será una - 19 carga para dicho Estado;que se considera ser persona suficientemente 20 abonada para contraer este compromiso porque es propietario de varias 21 fincas de café en la jurisdicción de Nahuizalco del Departamento de- 22 Sonsonate, habiendo vendido a la Casa Goldtree Lieves y Compañía de 23 la cosecha del año próximo pasado la suma de nneve mil seiscientos - 24 colones, según constancia que tuve a la vista y que se agregará al tes 25"
}