{
  "anumber": "A10775863",
  "id": "A10775863_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10775863_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EXAMINER'S REPORT, GPO 945159"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1917,
        1916,
        1898,
        1918,
        1902,
        1922,
        1940,
        1936
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "EXAMINER'S REPORT I have investigated this application and I am satisfied that the applicant is the person to whom the original record relates and that the applicant, if naturalized or repatriated, has not become expatriated subsequent acquiring United States citizenship, and that the naturalization or citizenship paper described in the application has been changley (Lost, mutilated, destroyed, surrendered) many The naturalization or declaration has been verified. Supplemental report is Areattaches attached hereto. I recommend that the application be granted. September 11 19 64 Approved, Ji District Joshua Gnatt (Signature Funlong Not of reporting officer) Director. (Title of reporting officer) New No. 3445010 issued on August (Date) received by me on (Date) marganet small (Applicant's signature) INSTRUCTIONS TO THE APPLICANT (This form must be completely filled out in ink or on a typewriter. This application is for use by a person who hasfiled a declaration of intention or has been naturalized or repatriated and whose declaration of intention or certificate of naturalization, citizenship, or repatriation has been lost, mutilated, or destroyed. It may also be used by a naturalized person whose name has been changed by marriage or by order of a court and who desires a new paper in the changed name.) Photographs.-You are required to send with this application two photographs of yourself taken within 30 days of the date ofthis application. They may be in natural color or in black and white, but black and white photographs which have been tinted or otherwise colored are not acceptable. These photographs must be 2 by 2 inches in size, and the distance from top of head to point of chin should be approximately 1 1/4 inches. They must not be pasted on cards or mounted in any other way, must be on thin paper, have a light background, and clearly show a front view of your face without hat. Snapshots, group, or full-length portraits will not be accepted. Your photographs should NOT be signed until after the new natural- ization or citizenship paper has been made out, but on the back of each photograph your name MUST NOW be printed lightly and carefully, using a soft pencil to avoid mutilation of the face of the photograph. Proof of changed name.- If your name has been changed by marriage subsequent to your naturalization and you are applying for a now paper in the changed name, you must attach to this application a certified copy of the public record of your marriage. If your name has been changed by a decree of court of competent jurisdiction subsequent to your naturalization, you must attach to the application a certified copy of the decree of court changing your name; and If you live in a State where, under the decree of court changing your name, further acts are required of you before the decree become final, in such case you must also attach to this application a certificate from the court that you have complied with all con- ditions of the decree changing your name. Certificate of Naturalisation or Citizenship. You must submit with this application the certificate of naturalization or of citizenship which was issued to you prior to your change of name, or which has been mutilated for retention by the Immigration and Naturalization Service if the application is granted. If you are unable to submit such certificate because It is lost or destroyed, state the circumstances fully on a separate sheet of paper the same size as this application. Fee- A fee of five dollars ($5) must accompany this application, unless you are applying for a copy of proceedings under the act of June 25, 1936, as amended, that is, unless you are a woman born in the United States who lost citizenship by marriage to an alien before Septem- ber 22, 1922, and are applying for a copy of the proceedings through which you were repatriated by taking an oath of allegiance to the United States. The fee for a copy of such proceedings Is $1.50. The fee is required for filing the application and is not returnable, regardless of action taken thereon. Remittances should be mode payable to the \"Immigration and Naturalization Service, Department of Justice.\" If residing In the Virgin Islands, remittances should be drawn In favor of the \"Commissioner of Finance of the Virgin Islands,\" If residing In Guam, remittances should be drawn in favor of the \"Treasurer, Guam,\" If you mail this application, attach money order or check. DO NOT SEND CASH. An applicant for a new declaration of Intention or certificate of naturalization in lieu of one lost, mutilated, or destroyed, who was c member of the military or nevel forces of the United States at any time after April 20, 1898, and before July 5, 1902; or at any time after April 5, 1917, and before November 12, 1918; or who served on the Mexican border GS a member of the Regular Army or National Guard between June 1916 and April 1917; or who has served or hereafter serves In the military, air, or naval forces of the United States after September 16, 1940, or who is presently serving and who was not at any time during such period or thereafter separated from such forces under other than honorable conditions, who was not a conscientious objector who performed no military duty whatever or refused to wear the uniform, or who as not at any time during such period or thereafter discharged from such military, air, or naval forces on account of alienage, is not required to pay any fee. In such case your honorable discharge must be presented with this application. GPO 945159"
}