{
  "anumber": "A10775863",
  "id": "A10775863_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10775863_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Operations Memorandum, FORM 05-682"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1955,
        1933,
        1940,
        1957,
        1932
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PTFRCK FORM DS-682 8-1-50 Unclassified OPERATIONS MEMORANDUM TO: Department of State Date: July 30, 878-13-5 girl FROM: AMCONSULATE, Cork, Ireland (EWAH) SUBJECT: CITIZENSHIP ND PASSPOR\" : Expatriation of Margaret O'Neill nee HORGAN, REF: There is enclosed a CERTIFICATE OF THE LOSS OF THE NATIONAL- ITY OF the UNITED STATES based on the provisions 'of Section 404 (b) of Chapter IV of the Nation lity Act of 1940, relating to Mrs. Margaret O'Neill, nee HORGA 9 together with her NATURALIZATION CERTIFICATE No. 3645015, Petition No.34022, issued by the Supreme Court of the State of New York, Long Island City, New York, on November 30th, 1932, in her maiden name Margaret HORGAN. Mrs. O'Neill presented her expired passport No.30184 issued in her maiden name Margare Horgan by the Department of State, ashington, on June 8, 1933 indicating her arrival in Ireland on August 7, 1933. Mrs. O'Neill intends to return to the United States to join her daughter, Hilda, who obtained an immigrant visa in 1955, and to reside in the United States permanently, as soon as she is financially able to do so. Her son, John Patrick O'Neill, born in Ireland or May 17, 1940, executed an application for a passport at this office on July 31, 1957, and his applica- tion is being submitted tc the Department for consideration. Her base has been considered in the light of Section 340(d) of the Immigration and Nationality Act and an affidavit regarding permanent residence abroad has not been prepared as it is not deemed warranted. Enclosures: I. Certificate of Loss of Nationality, in triplicate. 2. Naturalization Certificate No. 3645015 EWAHoffmann 221 Unclassified 8-12-7"
}