{
  "anumber": "A10775863",
  "id": "A10775863_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10775863_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "OPinion of Officer Taking Affidavit, N-14023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1940,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPINION OF OFFICER TAKING AFFIDAVIT The officer before whom the affidavit Is made should see that the pertinent facts and circumstances regarding the applicant's residence abroad are fully and correctly set forth in the affidavit and application If, for any reason, they are not 80 stated the officer should complete them in the space below, adding such comment OZ opinion as is appropriate. He should state whether the facts recited constitute the true reason for such residence, and whether they are sufficient under the established rules to entitle him to protection as an American citizen. He should also definitely state his opinion, in the case of a native citizen, whether the applicant has SATISFACTORILY EXPLAINED HIS PROTRACTED FOREIGN RESIDENCE, and in the case of a naturalized citizen whether HE IS IN A POSITION TO OVERCOME THE PRESUMPTION THAT HE HAS CEASED TO BE AN AMERICAN CITIZEN. (Sec. 144B and notes 3 to 6; sec. 155, note 15.) He should sign his name and add his title below the statement of his opinion. This affidavit which was executed on July 3, 1939, was held pending the receipt of a marriage certificate and birth certificate for the children. The facts recited constitute applicant's true reason for foreign residence but are not sufficient under the established rules to entitle her to protection as an American citiz It is my opinion that she is not in a position to overcome the presumption that she has ceased to be an American citizen. Applicant states emph ically, however, that she will return to the United States for I menent residence about April 1, 1940, end will be accompanied by er family. Under the circumstances the base has not been considered in th light of fraudulent naturalization and it is suggested that she be given a limited period to return under the provisions of rule (g). Should she then not return er case will be reconsidered in view of her recent naturalizatio Robert R. Patterson ce Consul of the United States of Ameri RRP.jc"
}