{
  "anumber": "A10775863",
  "id": "A10775863_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10775863_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "DUPLIC TE UNITED STATES OF AMERICA No. 34022 PETITION FOR CITIZENSHIP To a - with for STREET Cost of DO at TAMARGA The online K MAR a ARET HORGAN benty Use here (1) Mary = is Socpital, My compativo is nurse n (way - in Cock iraland = the 17.1909 3tr fun in Irish - Londo - my Intention to - . direct or the United States - 00.26.2027 in the Court of See York at New Yoak City (5) I'm Deserted The name of my with = Instruct to - seen and co. at in been at = returned the Dated - all for permanent residence there's and 297 mide at There and sa DATE date set place of total had of residicare of each of sid are as follows: (6) My be foreign residence - Coric Ireland I emigrated to the United Postan it America this queenstown Ireland My lawrut entry for residence to the United State - at HY NY under the sace of Margaret Ho rgan on May 2,1927 on the reseal Laconia = shown 50 the certifiest of my Annual attached benetity 7 Iam - c Stellerer la or opposed to organized government or a member of or dilisted with any organization or body of persons teaching disbelief = or appear to orgeniae recomment 1 am - a polypomist - a bollower to the practice of polymary I ACO attached to the principles of the Cosscitation of the United tal and will d and to the good order and happiness of the United States It is my initiation to tennisse . office of the United States and to resources - forever all a and 2dully to any foreign prince, potentiale, state or and particularly to SADAGE . ** THE CHACE ** CRO 06 GREAT editace (RELASS Ame THE anitian NOMEN inz HEAR his. OF Ini Fada, LAPEHOM OF india. whee to no at sale tice sm . subject (or estimate and la my intention to reside permanently in the United States. (9) Ism able to spee.k the English - (a) 1 have - led methooosity to the United State of America for the term of fire yeso at least immediately preceifing the date of this petitive, to sive May 2, 1927 and in the County of Queens this State net preceding the date of this petition, since July 20 3931 belog a residence within mid county of at less six maths - preceding the date of this petition (10) I am so Directoloro made petition for citizenship: Number ca at sad ruch petition was deaded by that Court for the following resident and - to: sad the can dental first since been ested oz removed Attach reto and made . part of this my petition for childenship, are my Organization of Intention to become a dillion of the United States, certifiests from the Department of abe of my said arrival. and the of the two verifying withouts required by law Wherefi your pray that : may be admitted . citizen of the United States of America, and that my name be changed to - 1. your know petitioner being duty sworn. depose and my that 1 have read this petition and know the contenta thereof that the - to logo my can Issic except - to matters harets stated to be alleged upon Information and that at to those matters : believe # to be trus: and that this - is eizened by all with my full. true name Maryant (Complete Maizon signature (politioner) AFFIDAVITS OF WITNESSES Ramona Burns occupation Dietitcian ml Hoeper Jameica Gertigude Lawrench occupation nursa tailing AT messaboro Hoa... Jama ion each herey only and respectively wirn definites and mys that ha is . citizen of the United States of Amering that be has personally known - butted Stated with HORGAR the pesitioner above mentioned store Juna 20.1927 the permission bur resided in the United States continuously precading the date of filled this polition, of whis this difficult data but and 11 Jamaion in the (Sounty of quaens June 10.1931 this be has a"
}