{
  "anumber": "A10712436",
  "id": "A10712436_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10712436_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "CERTIFICADO, T.R. 165846"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "5236 SECURITY DE EL SECURITY I CORTE DE CUENTIS NEW CUARENTA CENTAVOS 25 25 T.R. 165846 de C SECURITY 25 1 El infrascrito Alcalde Municipal 2 CERTIFICA: que a fojas tres fronte y vuelto de las diligencias seguidas or esta Oficina, solicitud de la señora Rosa Aminta Renderos mayor de edad, de O- 3 ficios domesticos y de este domicilio,a efecto de comprobar su buena conducta, 4 se encuentra el auto y resolución que dice : Alcaldia Municipal de 12 Ciudad de 5 B Nahuizalco, a las quince horas del dia primero de Octubre de mil novecientos oin 7 cuenta y seis. -Vistas las declaraciones unanimes V contestes de los testigos ha 8 bilez señores Pablo Albetto Magafia y don Francisco Ramirez Alvarado, ambos mayo 9 res de edad, oficinistas y de este Origen y domioilio, quienes en lo sustancial 10 de sus declaraciones que corren agregadas a las mismas diligencias, dicen conocer desde su tierna infancia a la señorita Rosa Aminta Renderos quien es de treinti- 11 mueve años de edad, de Oficios domésticos, de este Origen y domicilio, hija de Cel- 12 sa Renderos, constándoles que la expresada señora Renderos todo el tiempo que tie 13 nen de conocerla ha observado y observa muy buena conducta, siendo dedicada OX- 14 clusivamente al trabajo honesto y muy respetuosa con las autoridades y particu- 15 16 lares, el infrascrito Alcalde en vista de 10 dicho por los testigos y constándo- 17 les de vista y oídas por ser de este mismo Origen,tienese comprobada la buena conducta de la señora Rosa Aminta Renderos, désele certificación de este auto 18- 18 19 ra que le sirva de legal constancia Larin.-Ante mi-Alejandro Madrid Cierra.- Srio. 20 Rubricadas.- 21 ES CONFORME con su Original con el oual se confrontó,y para que sirva de legal 22 comprobante, extiendo la presente,en la Alcaldia Municipal Nahuizalco,a las diez 23 y seis horas del dia once de Octubre de mil novecientos cincuenta y seis.-Emen- dado-Alberto-para- Alejandro.Vale - 24 25 Jose Gilberto Larin, MAHURZAICO Statement AI Lajandro Madrid Cierra, Alcalde Minicipal.- Secretario Murioipal- Li"
}