{
  "anumber": "A10775863",
  "id": "A10775863_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A10775863_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR A NEW NATURALIZATION OR CITIZENSHIP PAPER, 3645015"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1904,
        1933,
        1932,
        1924,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved, Budget Bureau No. 43-R099.7 No. 3645015 APPLICATION FOR A NEW NATURALIZATION OR CITIZENSHIP PAPER (See instructions on Reverse) Fee Stamp Take or mail to IMMIGRATION AND NATURALIZATION SERVICE, I hereby apply for a new naturalization or citizenship paper. (1) (b) (a) My The full, name true under name which is I margaret was is 6'neill mangenet Horgan V (c) Other names I have used are next 1 (2) I was born at bonk Eine One on 3 th 1904 (City or town) (Country) (Month) (Day) (Year) (3) I arrived in the United States at Boston mass U.S.A. (City or town) on 1/1 (Month) 8 54917 (State) (Day) (Year) (4) I now reside at 829 Hyde and Pankart mass (City town) Hyde Part, (County) 14 CAR 3 (Apt. No.) (Number street) or (State) (5) My personal description is: Sex Memory ; complexion Dow color of eyes young ST; color of hair height 5 your me (i) feet 7 inches; weight 170 pounds; visible distinctive marks Birth make on J'onehead (6) The naturalization or citizenship paper was issued to me by the Shafaeme of Lary Quality Court marital status married ; country of which Iwas a citizen, subject, or national Gini > at of (City the town) State (County) of new york (State) V (Name of court) on november 30- 1932 or (Month) (Day) (Year) (7) Since my naturalization or repatriation, I have have not lost my citizenship in any manner. (8) Since the date the naturalization or citizenship paper was issued to me I have not been absent from the United States for more than six months, except as follows: (If none, state \" 'none. ) (8) DEPARTED FROM THE UNITED STATES RETURNED TO THE UNITED STATES Date Vessel, or other Means Date Vessel, or Other Means Port Port (Month, day, Year) of Conveyance (Month, day, Year) of Conveyance Logan anway Rogen 11-8-1959 anways (y Blecifor 1933 Bot Bester 1959 Plan north lost (9) Such paper became mutilated on or about at destroyed (Month) (Day) (Year) (City or town) , under the following circumstances: (State or country) 1 Answer (10) Only if You Are Applying For a New Paper in a Changed Name. (10) My name was changed by-- (a) Marriage; from the name of Horgen to snall at bonk Inclonel (Name naturalized under) (Present married name) 12 on nov 29-1924 (City or town) (County) (State) (Date) (b) Decree of Court, at (City or town) on (County) (State) (Month) (Day) (Year) I certify that the above statements are true and correct to the best of my knowledge and belief. convertion made me 1-12 Meongovet N-565 oneell (Complete signature frael of applicant) Form UNITED STATES DEPARTMENT OF JUSTICE 829 Hycb Parkave H.P Immigration and Naturalization Service (Address at which applicant receives mail) (Rev. 11-26-62)"
}