{
  "anumber": "A12284895",
  "id": "A12284895_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Block II—Information Pertaining to Alien Beneficiary, 2"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1914
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Block II. -Information Pertaining to Alien Beneficiary 7. Name of alien CHiN TAK HAN (First name) KS72-9-21 10/22/80001 initial) (Last name) 8. Date, city, and country of birth of alien WIFE LONG TOY Hoi PiNG , CH YNA 9. Relationship of alien to petitioner 10. If this petition is for your spouse, give the following: Date and place of marriage 1914 AT WONG QUE How HOLPING, CHINA Number of your prior marriages NONE Number of prior marriages of spouse NONE 11. If this petition is for a child, is the child married? / 12. If this petition is for a brother or sister, are your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of pre- vious marriages of each parent. 13. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner: 14. If this petition is for a married brother, sister, son or daughter of a United States citizen, or for a highly skilled person or a minister, give the following: Name of alien's spouse Names and birthdates of children Full address of spouse and children 15. If this petition is for a highly skilled person or a minister, give the following: Alien's occupation ; full address in the United States where services will be performed I 16. Have you ever filed a petition for this alien before? YES- BUT UNDER Mi PAPER NAME If so, give place and date of filing and result: 17. Has this alien ever been deported from the United States? No If so, give alien registration number, reason for deportation, and place where deportation hearing was held: 18. Address in the United States where alien will reside 147 TYLER ST, BOSTON, MASS 19. Present address of alien 23 A KA SHiN ST, 1FFLOOR, KOWLOON HONGRONG 20. Location of American consulate where application for visa will be made HONGKONG (City in foreign country) (Foreign country) I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Syets (Signature of petitioner) Getman (See Instruction No. 5) Subscribed and sworn to (affirmed) before me this 18th day of april A. D. 1961 at Barton, Mass. [SEAL] My commission expires December 1961 Comelius E.Mc Laughlin (Title) (Signature of officer administering oath) (If you need more space to answer fully any questions on this form, use a separate sheet and identify each natary Public answer with the number of the corresponding question.) 2 o"
}