{
  "anumber": "A12284895",
  "id": "A12284895_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Immigration Eligibility Questionnaire for Naturalization,, Form N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "O (English) (8-17-59) Page 3 of nited being States within immigration of the laws require that all prospective immigrants answer the following questions. This requirement does not imply that in mind that whatever answer any the these questions please explain your inability fully on a separate sheet of paper which you should attach to this a visa, If you are unable to any of classes described in these questions. Your answers will assist the consular officer to establish your eligibility to receive you are suspected and/or convicted for minor nature of your answers to these questions, you are not necessarily ineligible to receive a visa, For example, if form. Please bear not necessarily make you ineligible for a visa. a offense, and the consular officer is able to establish that such offense was in fact a misdemeanor, your arrest and/or you conviction were arrested would Give the correct answer to the following questions by circling \"Yes\" or \"No\" (1) (a) Have you ever been arrested for, charged with, indicted for, or convicted of, a crime or other offense? Yes No (b) Have you ever been confined in a civilian prison or jail? Yes No (c) Have you ever been confined in a military prison or jail? Yes No (d) Have you ever been engaged in illicit buying, selling or handling of narcotic drugs? Yes No (e) Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If so, explain) Yes No (2) (a) Have you ever been placed in an almshouse (poorhouse or charitable institution)? Yes No (b) Are you a pauper, professional beggar or vagrant? Yes No (c) Are you now afflicted with a physical defect, disease or disability which may affect your ability to earn a living? Yes No (d) Will you be able to support yourself financially in the United States? Yes No (3) (a) Have you ever had one or more attacks of insanity? Yes No (b) Are you now or have you ever been afflicted with psychopathic personality, epilepsy, mental defect, fits, fainting spells, convulsions or a nervous breakdown? Yes No (c) Are you now or have you ever been a narcotic or drug addict or chronic alcoholic? Yes No (d) Have you ever been treated in a hospital, institution or elsewhere for insanity or other mental disorder or for drug or narcotic addiction or alcholism? Yes No (e) Have you ever had any of the following: (A) Tuberculosis in any form? Yes No (B) Leprosy? Yes No (C) Any other dangerous contagious disease? Yes No (4) (a) Are you a polygamist, do you practice polygamy, or do you advocate the practice of polygamy? Yes No (b) Are you or have you ever been a prostitute, procurer, or supported wholly or in part from the proceeds of prostitution? Yes No (c) Are you going to the United States to engage in an immoral sexual act, in prostitution, or other unlawful commercialized vice? Yes No (5) (a) Have you previously applied for a visa to enter the United States either as an immigrant or as a nonimmigrant? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued) Yes No (b) Have the you been refused admission to the United States during the last twelve months? (If the answer is Yes submit evidence that Attorney General has consented to your reapplying for admission into the United States) Yes No (c) Have you ever been (A) arrested and deported from the United States? Yes No (B) voluntarily removed from the United States at United States Government expense as a person who fell into distress? Yes No (C) removed from the United States as an alien enemy? Yes No (D) removed from the United States at Government expense in lieu of deportation? Yes No for into the United States.) (If the admission answer to any of the above questions is Yes, submit evidence that the Attorney General has consented to your reapplying (6) (a) Have you ever attempted to obtain by fraud or willful misrepresentation a visa or other documentation to enter the United States? Yes No (b) Have you ever obtained by fraud or willful misrepresentation a visa or other documentation to enter the United States? Yes No (7) (a) Are you now or have you ever been ineligible for United States citizenship? Yes No (b) Have gency? you ever departed from or remained outside of the United States to avoid or evade military service in time of war or national emer- Yes No (c) Have you ever registered with a draft board under the selective service laws of the United States? Yes No (8) Can you, if you are over sixteen, read and understand some language or dialect? Yes No (9) Have States? you for gain ever assisted another alien to enter the United States or try to enter the United States in violation of the laws of the United Yes No (10) Are you a former exchange visitor who has not resided abroad for two years following your departure from the United States? Yes No (11) Are you now or have you ever been (a) an anarchist? Yes No (b) an advocate of opposition to all organized government? Yes No (c) an advocate of Communism? Yes No (d) munist-dominated a member of, or affiliated controlled with, the Communist Party or affiliated organization, an organization advocating Communism or a Com- other similar organization? or organization or an organization advocating the overthrow by force of all organized government or any Yes No (If the answer to any of the above questions is Yes, explain, giving dates and nature of activities or membership.)"
}