{
  "anumber": "A12284895",
  "id": "A12284895_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, FS-511"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1962,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "A12-284 895 RM FS-511 (7-15-58) UNITED STATES OF AMERICA IMMIGRANT VISA AND ALIEN REGISTRATION OF: (Family name) (First name) F 576063 (Middle name) CHAN (CHIN) Tak Haun (Han) PORT OF 32-0 ANCHORAGE ALASKA ACTION OF SPECIAL INQUIRY OFFICER I certify that the immigrant named herein arrived in The immigrant herein was (admitted) (excluded) the United States at this port on the no appeal taken and/appeal taken under NWA # to Symbol (Name of vessel or flight No. of aircraft) on 25 10 61 Section of the Immigration and (Day) (Month) (Year) admitted Nationality Act. and was inspected by me and detained for further inquiry by special inquiry officer under Symbol M- Special Inquiry Officer. Section of the Immigration and ACTION ON APPEAL ADMITTED Nationality Act DATE EXCLUDED Immigrant Inspector. This visa is issued under Section 221 of the Immigra- tion and Nationality Act, and upon the basis of the AMERICAN Consulate General, facts stated in the application. IMMIGRANT CLASSIFICATION AT Hong Kong: NONQUOTA (Symbol) QUOTA (Symbol) M-1; Kenneth N. Rogers VISA PETITION NO., IF ANYVP approved on May 16, 1961 Vice Consul at Boston, expires on May 15, 1964; of the United States of America. IMMIGRANT VISA NO. QUOTA 425: pg ISSUED ON (Day) (Month) (Year) 18th October, 1961, INDEXED THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 17th February, 1962; NATIONALITY (If stateless, so state, and give previous nationality) Chinese: PASSPORT NO. states OR OTHER TRAVEL DOCUMENTS (Describe) 11 Certificate of Identity no. 18040\", Service No. 9048 ISSUED 2I TO CHAN Tak Haun; Tariff Item No. Fee Paid $20 BY Local Cy equiv. Hongkong Immigration Officer, Hongkong; STATISTICS ON 12th October, 1961: EXPIRES 11th October, 1962. 16-74687-1 U. S. GOVERNMENT PRINTING OFFICE"
}