{
  "anumber": "A12284895",
  "id": "A12284895_0029",
  "page_index": 29,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0029/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AMERICAN CONSULATE GENERAL HONG KONG, B.C.C., Statement to be Executed by Visa Applicants at the American Consulate General, Hong Kong"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "AMERICAN CONSULATE GENERAL Hong Kong, B.C.C. Statement to be Executed by Visa Applicants at the American Consulate General, Hong Kong This is to certify that I have been informed by the American Consulate General at Hong Kong, in connection with my visa application, that there are a number of persons who are known by the American authorities to be engaged in fraudulent visa activities. These persons charge fees for their services to visa applicants to complete forms, supply evidence and other documents which are fraudulent. I have been warned against enlisting the aid of such persons in connection with my application. I fully understand that in applying for a visa, if I engage in any fraudulent activities in conne- ction with my case such as by offering bribes, \"tea money,\" or by employing, having others employ or accepting the services of persons or organizations engaged in fraudulent practices to assist in my visa case I will render myself permanently ineligible to receive a visa of any type under the laws of the United States. I further understand that even if I should be granted a visa under such circum- stances and be admitted into the United States and, subsequently be granted American citizenship that such citizenship may be revoked by reason of the fraudulent action, on my part and I may be deported from the United States regardless of the number of years which may elapse between the time of my obtaining the visa and American citizenship. Neither I nor anyone acting in my behalf have engaged the services of any person or firm to assist me in connection with my visa application except: LEE Wah 45 Haiphong Road, 3rd floor, of (name of person (s) and/or of firm (s)) Kowloon, Hong Kong; (address (es)) who has been paid $ and/or is to be paid $ (have) (are) upon or (date (s) ) (on other condition (s), such as, completion of services, etc.) I request the American Consular Officer to make this affidavit a part of my visa application in accordance with Title 22, Code of Federal Regulations, Section 42.30. I fully understand that any false statement made herein will subject me to all of the penalties of the laws of the United States relating to perjury and false swearing. CHAN (CHIN) Tak Haun (Han) (her mark) Subscribed and sworn to before me this 18th day of October \" 1961 Kenneth X VicBogensul SEE OVER FOR CHINESE TRANSLATION"
}