{
  "anumber": "A12284895",
  "id": "A12284895_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0022/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, FS-510 ( (English)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1896
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FS-510 (English) (8-17-59) Form Approved. DEPARTMENT OF STATE Budget Bureau No. 47-R150.2. FOREIGN SERVICE OF THE UNITED STATES OF AMERICA APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION INSTRUCTIONS: This form must be filled out in DUPLICATE by typewriter, or if by hand in legible block letters. ALL questions must be answered, if applicable. Questions which are not applicable should be so marked. If there is insufficient room DO on the form, answer on separate sheets, in duplicate using the same numbers as appear on the form. Attach the sheets to the forms. NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application for an immigrant visa if $5.00. The fee should be paid in United States dollars or local currency equivalent or by bank draft, when you appear before the consular officer. WARNING: Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be ground for your prosecution and/or deportation. I hereby apply for an immigrant visa and alien registration at the United States Consulate General, at Hong Kong; and state the following facts: 1. My family name is My first name is My middle name is CHAN (CHIN) Tak Haun (Han) 2. My full name in native alphabet (If other than Roman letters are used) is 7115 1795 8300; 3. Other names I have used or by which I have been known are (If married woman, give maiden name) Not applicable; 4. The date of my birth is 5. My place of birth is (Day) (Month) (Year) (City or town) (Province) (Country) 27th October, 1896; Hoiping, Kwangtung, China; 6. My age is 7. My present calling or occupation is 64; Housewife; 8. My present address is 23A Ka Shin St., 1st fl. Rear Portion, Kowloon, Hong Kong; 9. My sex is 10. My marital status is Single (never married) Married Widowed Divorced Separated Male Female Including my present marriage, I have been married one times. 11. My nationality is 12. My race is 13. My ethnic classification is Chinese; 14. My personal description is 15. I have the following visible marks of identification (a) Color of hair (c) Height Black; (Greying); 4 feet 111 inches Scar on forehead; (b) Color of eyes Brown; (d) Complexion Yellow; 16. My purpose in going to the United States is To live with husband; 17. I intend to remain in the United States permanently or (Give length of time) 18. I intend to enter the United States at the port of Permanently; Boston; 19. I (Do) (Po Not) have a ticket to my final destination 20. (a) I am going to the United States to join the following person (Give name and address and relationship, if any) 20. (b) I am sponsored by the following person and/or organization (Give address if different from (a)) SZETO Getman -husband- 309 Shawmut Ave., Boston, Mass ; 21. My final address in the United States is 309 Shawmut Ave., Boston, Mass. 22. My personal financial resources are (a) Cash Supported by husband; (c) Real estate (value) (b) Bank deposits (d) Other THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA"
}