{
  "anumber": "A12284895",
  "id": "A12284895_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR INFORMATION FROM OR COPIES OF IMMIGRATION AND NATURALIZATION RECORDS,, A-12 284 895"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1896,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved. IMMIGRATION AND NATURALIZATION SERVICE Budget Bureau No. 43-R104.5. APPLICATION FOR INFORMATION File No. A-12 284 895 FROM OR COPIES OF IMMIGRATION FEE STAMP AND NATURALIZATION RECORDS. RECEIVED (See instructions on reverse) MAR 141963 Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE, U. 8. Immigration & Naturalization 150 Trement Street Boston Mass. (Fill in with typewriter or print in block letters in ink) It is requested that information from or copies of your records (File No., if known ) regarding the person named below be furnished solely for the purpose hereafter specified: 1. Data for identification (answer as completely as possible): 1. Family Name Given Name Middle Name 2. Allen Registration Number A 12° 284 895 Szeto Tak Hanu 3. Other names used if any lak Chin 4. Name used at time of entry Tak Hanu Szeto 5. Place of birth 6. Date of birth or age at entry: Long Chai Village, Hai Ping, China Oct. 27, 1896 7. Port of entry 8. Port abroad from which left for United States 9. Date of Entry Boston, Mass. Hong Kong, B.C.C. Oct. 1961 10. Name of vessel or other means of entry plane 11. Names of accompanying passengers husband GET MAN SZETO 12. Name and address of person to whom destined Getman Szeto- 147 Tyler St., Boston, Mass. 13. The Information or copy of record requested is: Verification of age as shown in record of entry into (proof of a ge) the U. S. 14. The particular purpose for which needed is: to prove age for social security 15. Send information to Mrs. SZETO TAK HANU, 309 Shawmut Ave., Boston, Mass XXXXXX XIX XXXXX 16. The Information should be in the form of (letter, exact copy. or certified copy) letter If the Subject is or was a naturalized citizen of the United States, give the following information: 17. Name on Naturalization Certificate 18. Certificate Number 19. Naturalization Date not nat. 20. Address at time of naturalization 21. Name and location of Naturalization Court I consent to the furnishing of the above information getman Set (husband) (see Instruction 3). (Name of person requesting information) 309 Shawmut Ave., Boston, Mass. (Address) (Address) Form N-585 (Rev. 10-10-61)"
}