{
  "anumber": "A12284895",
  "id": "A12284895_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Classify Status of Alien for Issuance of Immigrant Visa, A12 0004421"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1897
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES +12000421 DEPARTMENT OF JUSTICE Form approved. Sigration and Naturalization Service Budget Bureau No. 43-R401. RECEIVED PETITION TO Date Filed 1. ERVIN Fee Stamp CLASSIFY STATUS OF ALIEN FOR ISSUANCE OF IMMIGRANT VISA 1961 APR 28 (Read this form and the attached instructions carefully before filling in petition) To THE SECRETARY OF STATE: The petition is approved: Status is granted under section 101(a)(27)(A) The petition is revalidated: Revalidation (Sec. 203(a)(1) cases Approval (Section 203(a)(1) cases only) expires only) expires Remarks: Boston Immigration file A 12 284 895 relates (District Director) MSD Jr (District Director) to beneficiary HAN CHIN TAK Boston WIFE (District) (District) May 16 1961 (Date) (Date) (PETITIONER IS NOT TO WRITE ABOVE THIS LINE) 1. Petition is hereby made to classify the status of the alien beneficiary for issuance of an immigrant visa as: (Check one) The spouse, child (regardless of age), parent, brother, or sister of a United States citizen. The spouse or unmarried child (regardless of age) of an alien lawfully admitted to the United States for permanent residence. A highly skilled person, or as a minister. Block -Information Pertaining to Petitioner 2. Name SZETO GETMAN (Give full name of person or organization; married woman must also give maiden name) 3. Address in United States 309 SHAWMUT AVE BOSTON MASS (Number and street) (City) (State) Address abroad (if any) NONE (Number and street) (City) (The rest of this block is to be filled in only by an individual person filing a petition for a relative) (Country) 4. I was born OCT 24 1897 WANG QUE How Hoi PING CHINA (Date) (City) (Country) 5. If you are a citizen of the United States, give the following: Was your citizenship acquired through birth in the United States, through naturalization, through parentage, or through marriage? NATZ If acquired through naturalization, give number of naturalization certificate and date and place of naturalization: C/N 8205 147 - 3/11/61 USDC- BOSTON, MASS If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name based on acquisition? such If so, give number of certificate: If not, submit evidence of citizenship in accordance with instruction Have you or any person through whom you claim citizenship ever lost United SEABULATE States CitizenshipAL GENERAL ONO THE If so, attach detailed explanation on separate sheet. CONSULAR SECTION OF AMERICA 6. If you are a lawful permanent resident alien of the United States, give the following: HONG KONG Alien Registration Number: A- Date, place, and means of admission for lawful permanent residence MAY 23 1961 AM Have you ever lost status as a lawful permanent resident alien? , If so, explain: Form I-130 (Rev. 9-25-59) 1"
}