{
  "anumber": "A12284895",
  "id": "A12284895_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12284895_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (English) ( (8-17-59)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States",
        "Mexico"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form FS-510 (English) (8-17-59) Page 4 34. (Continued) (12) in Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within such country or island) such country or island? (If answer is Yes, give the name of transportation company by which you entered two or years intend after to arrival enter Yes No 35. Were attorney, you assisted travel agent, in completing or other) this application? (If so, give name and address of person or persons assisting you indicating whether relative, friend, Name Address Anna POON Visa typist of the American Consulate General, Hong Kong; DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering the following parts 36 and 37 36. I claim to be exempt from ineligibility to receive a visa and exclusion under item 34(8) in part 34 for the following reason: I claim exemption from the above because I am the wife of a United States citizen. 37. I claim to be a preference quota immigrant under the quota. Nonquota immigrant. My claim is based on the following facts: I am the wife of SZETO Getman, a United States citizen, and the beneficiary of an approved visa petition. I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession of a visa does not entitle me to enter the United States if at that time I am found to be inadmissible under the immigration laws. I understand that any willfully false or misleading statement or willful concealment of a material fact made by me herein may subject me to permanent exclusion froin the United States and, if I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I, the undersigned applicant for a United States immigrant visa, do solemnly swear (or affirm) that all state- ments which appear in this application have been made by me, including the encircling of items in part 34, and true and complete to the best of my knowledge and belief. I do further swear (or affirm) that, if admitted into the are United States, I will not engage in activities which would be prejudicial to the public interest, or endanger the welfare, safety, or security of the United States; in activities which would be prohibited by the laws of the United States relating to espionage, sabotage, public disorder, or in other activities subversive to the national security; in any activity a purpose of which is the opposition to, or the control, or overthrow of, the Government of the United States, by force, violence, or other unconstitutional means; or join, affiliate with, or participate in the activities of any organization which is registered or required to be registered under Section 7 of the Subversive Activities Control Act of 1950. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. + CHAN (CHIN) Tak Haun (Han) (her mark) (Signature of Applicant) Subscribed and sworn to before me this 18th day of October 1961 SERVICE NO. 9047 TARIFF ITEM NO. 20 Kenneth N. Roger PAID U.S. $5.00 American Vice Consul CY EQUIV. (Consular Officer) U.S. GOVERNMENT PRINTING OFFICE: 1959-O-523967"
}