{
  "anumber": "A12315057",
  "id": "A12315057_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12315057_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Certificate Application,, N-4-120."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1910,
        1886,
        1933,
        1961,
        1920,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CONTINUE HERE: (7) t claim United States citizenship through my (check whichever applicable) father; mother; both parents; hus- band; as a British Columbia Indian having resided in Alaska continuously since (8) My father's name is Samuel Zigman ; he was born on Dec 11 1886 (Month) (Day) (Year) at Royna Russia ; and resides at 9 Garrahrant Road, (City) (State or Country) (Street address, City, and State or Country. If dead, show \"dead Clifton, N.J. He became a citizen of the United States by naturalization on Nov. 17 1915 and date of death (Month) (Day) (Year) 6 in the PatersonCourt House, Paterson, , NoJ Certificate No. 583128 (Name of Court, City, and State) (If he derived or acquired citizenship in any other way, give full details) He has not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he lost (has) (has not) and attach it, showing question number.) Presents , w He resided in the United States from 1907 to 1961. ; from to ; from to I am (Year) (Year) (Year) (Year) (Year) (Year) c the child of his 1st marriage. (1st, 2d, 3d, etc.) (9) My mother's maiden name was Rosa Sandler ; she was born on at ; and resides at Deceased (Month) 19332(5) (Day) (Year) (City) (State or Country) (Street address, City, and State or Country. She became a citizen of the United States by naturalization on Nov 17 1915 If dead, show \"dead' and date of death.) (Month) (Day) (Year) in the Certificate No. 583128 (Name of Court, City, and State) She received them through my father (If she derived or acquired citizenship in any other way, give full details) ru She has not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when she lost (has) (has not) be and attach it, showing question number.) She resided in the United States from 1910 to 1933, from to ; from to I am the (Year) (Year) (Year) (Year) (Year) (Year) child of her 1st marriage. (1st, 2d, 3d, etc.) (10) My mother and my father were married to each other on Sent. 1905a+ Royna, Russia (Month) (Day) (Year) (City) (State or Country) My mother has been married 1 time(s), and my father has been married 3 time(s). (1, 2, 3, etc.) (1, 2, 3, etc.) (11) My served in the Armed Forces of the United States from (father, mother) (Date) to and honorably discharged. (Date) (was) (was not) (12) THAVE No.T. my United States citizenship. (If citizenship lost, on a separate sheet this size state how and when (have) (have not) you lost and attach it, showing question number.) (+3) Issue my certificate in the name of: Eva Miller (14) 1 submit the following documents with this application: (Eas Census Report(1920) @ showing family - Nature of Document Names of Persons Concerned Ex3, School Record Appliant enter in School G-4 M/C applicant 2 VII 02 (2)"
}