{
  "anumber": "A12315057",
  "id": "A12315057_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12315057_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit, 1023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1961,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPLICANT: DO NOT FILL IN OR SIGN ANYTHING ON THIS PAGE AFFIDAVIT I am the (applicant, or appliant parent, guardian) and do swear that I have read the contents of the foregoing (heard) application comprising pages 1 to 3, and supplementary pages numbered ( Hot ), inclusive; that I understand their con- tents; that the statements therein are true to the best of my knowledge and belief; that corrections numbered ( / ) to 1/0 were made by me or at my request; and that this application has been signed by me with my full, true, and correct name. live Miles (Complete and true signature of applicant, parent, or guardian) newarly Subscribed and sworn to before me at this 1st day of Cenny 1961 (Officer's signature and title) REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents and records examined, my examination of the applicant, and the examination(s) of the person(s) named below, I find that the facts and conclusions set forth under oath in this application are true and correct; that the applicant did derive or acquire United States citizenship on Nov 17 1915 through oNwhich date s he WAS ALAWFUL PERMANENT nes DemtofThe (Day) (Year) U.S AND ONDER The age OF 21 YEARS, her FAThER WAS NATURALIZEDA hmember 171915 and that he has not been expatriated since that time. I recommend that this application be (has) (has not) granted (granted, denied) and that an A Certificate of Citizenship be issued in the name E.V.A Miller (A or AA) applicant's legal name acquired by manage (At birth (1); through marriage (2); by court order (3); under State law (4). Fill in applicable number(s) and explain if by court order or State law.) The application does present a prima facie case of citizenship. I404A (Ex-1). Verif.of FATheR'S MAT2 Item SAMUEL ZIGMAN C. 583128 (Documents examined in addition to those listed in 14) Address Relationship Person Examined Date testimony to applicant heard applicant 8/1/61 SAMUEL ZIGMAN FAThER \" Clifton N.J. 8/1 1961 Compens Ho Date of recommendation Officer's signature and title) I do concur in the decision. 8 19 61 Date STATENCS WR Bound (Signature of Dirict Director or Officer in Charge)"
}