{
  "anumber": "A12315057",
  "id": "A12315057_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12315057_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application for Citizenship ( Form N-4, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(15) Fill in this block only if you claim citizenship through your mother's marriage to your stepfather. The full name of my stepfather is ; he was born on (Month) (Day) (Year) at ; and resides at (City) (State or Country) (Street address, City and State or Country. If dead, He became a citizen of the United States by naturalization on show ''dead' and date of death.) (Month) (Day) (Year) in the Certificate No (Name of Court, City, and State) (If he derived or acquired citizenship in any other way, give full details.) He since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he lost (has) (has not) and attach it, showing question number.) He and my mother were married to each other on at (Month) (Day) (Year) (City and State or Country) My mother is of the race. Before marrying my mother, my stepfather was married time(s), as follows: (1, 2, 3, etc.) Date married Date marriage How marriage ended ended Name of wife (Death or divorce) (16) Fill in this block only if you are or were a married woman. I have been married time(s), as follows: (1, 2, 3, etc.) Date marriage How marriage ended Date married ended Name of husband Citizenship of husband (Death or divorce) 6/12/31 Hann Meller USC Co (17) Fill in this block only if you claim citizenship through a husband. Name of citizen husband ; he was born on (Give full and complete name) (Month (Day) (Year) at ; and resides at (City) (State or Country) (Street address, City and State or Country. If dead, He became a citizen of the United States by naturalization on show \"dead\" and date of death.) (Month) (Day) (Year) in the Certificate No (Name of Court, City, and State) (If he derived or acquired citizenship in any other way, give full details.) He since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he lost (has) (has not) and attach it, showing question number.) I am of the race. Before my marriage to him, he was married time(s), as follows: (1, 2, 3, etc.) Date married Date marriage Name of wife How marriage ended ended (Death or divorce) (18) Fill in this block if any member of your immediate family has submitted or is submitting a similar appli- cation to an office of the Immigration and Naturalization Service. Name of relative Relationship When application Certificate No. and File No., if known, submitted and location of office (19) I baug NOT heretofore filed an application for a certificate of citizenship (have) (have not) on 19 at (SIGN HERE) Av miller (Sign of applicant or parent or guardian) (3)"
}