{
  "anumber": "A12468555",
  "id": "A12468555_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12468555_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STANDARD CERTIFICATE OF DEATH, 5421"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1950,
        1960,
        1868
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "STANDARD CERTIFICATE OF DEATH LOCAL REGISTRAR'S STATE OF OREGON STATE FILE NO. NUMBER 5421 BOARD OF HEALTH - PORTLAND Da-rq PUBLIC HEALTH SERVICE DATE RECEIVED DEC 27180 1. NAME OF DECEASED First Middle Last (Type or print all entries in black ink) John B Colistro 2. PLACE OF DEATH 3. USUAL RESIDENCE (If Institution, give residence before admission) A. COUNTY Multnomah A. STATE Oregon MultinomaANTY CERTIFIED COPY B. CITY, TOWN, (If outside corporate C. LENGTH OF C. CITY, TOWN (If outside corporate limits, so specify) limits, so specify) OR LOCATION Portland STAY IN 2B 47 yrs. OR LOCATION Portland 18 D. NAME OF HOSPITAL (If not in hospital, give street address) D. STREET ADDRESS, RURAL ROUTE, ETC. OR INSTITUTION Holladay p ark Hospital 6134 E Burnside Street STATE OF OREGON 4. DATE OF Month Day Year 5. SEX 6. COLOR OR RACE 7. MARITAL STATUS SS DEATH Married December 11, 1960 Male White Widowed County of Multnomah ) Divorced Never Married 8. SOCIAL SECURITY NO. 9. USUAL OCCUPATION 10. KIND OF BUSINESS 11. NAME OF SPOUSE (Kind of work doge during most of life) retired railroad OR/INDUSTRY Filomena 12. DATE OF Month Day Year IF UNDER 1 YEAR IF UNDER 24 HOURS ISSUED DEC 29 1960 13. AGE LAST BIRTHDAY BIRTH Months Days Hours Yrs. Minutes February 11, 1868 92 14. BIRTHPLACE (State or Foreign Country) 15. WAS DECEASED A CITIZEN OF 16. IF DECEASED WAS A VETERAN, U.S. Italy WHAT WAR? THIS IS TO CERTIFY THAT Foreign Country Name of Country ------ 17. NAME OF FATHER 18. MAIDEN NAME OF MOTHER 19. INFORMANT'S NAME AND THIS IS A REPRODUCTION Rosario Calistro Gloria Catalan-daughter RELATIONSHIP TO DECEASED Mary - unknown Mrs. OF THE ORIGINAL RECORD 20. CAUSE OF DEATH (ENTER ONLY ONE CAUSE PER LINE IN (A), (), AND (c). Interval Between Onset and Death ON FILE IN THE VITAL (Years, days, hours, etc.) PART 1: DEATH IMMEDIATE WAS CAUSE CAUSED (A) : BY: Coronary outuman 2 days STATISTICS SECTION OF THE OREGON STATE Conditions. if any, DUE TO (B) : which gave rise to acture selenous above cause (a), 30yean BOARD OF HEALTH. stating the under- lying cause last ) DUE TO (c) PART II: Other Significant Conditions 21. If deceased was Female, was there a 22. Was an Autopay contributing to Death but not related to pregnancy in the past 12 months? performed? the terminal disease or condition given Mexicon Mr. Mortin a Yes No Unknown Yes in Part I (a): XX No 23. WAS DEATH RESULT OF 24. IF ACCIDENT. DID INJURY 25A. PLACE OF INJURY 25B. City County State OCCUR (Such as Farm. Home. Forest. etc.) Not Accident Suicide Homieldo At Work At Work 26. TIME OF Hour Month Day Year 27. DESCRIBE HOW INJURY OCCURRED. INJURY .m. ARTHUR LANDCERT Caroner Eart She the death of) the deceased from 1950 11 Jey 1960 and that the death occurred at 10:25 A.M. to (date) Causes and on the date stated above. STATE REGISTRAR 29 YAAA Kawan MD (Signature) (date) Portland Medical (TITIC) Center, Portland (Address) 12/12/62 Date Signed) 29. RESERVED FOR REGISTRAR'S USE By Direction of RICHARD H. WILCOX, M.D. 30A. DECEASED WILL BE 30B. DATE 30C. NAME OF CREMATORY OR CEMETERY 30D. LOCATION (City or Town) State State Health Officer mans Burled Cremated Removed Other 14DAC60 The Portland Memorial Portland, 31. DATE RECEIVED BY 32.R GISTRAR'S SIGNATURE LOCAL REGISTRAR DEC 1960 Washing Finley 33. FUNERAL 's-Portland, DIRECTOR'S SIGNATURE AND Ore. ADDRESS Oregon"
}