{
  "anumber": "A12468555",
  "id": "A12468555_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A12468555_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, N-600 ( (Rev. 10–20–59)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1919,
        1960,
        1901,
        1904,
        1961
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "att Form approved FEE STAMP Budget Bureau No. 43-R105.8 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE $500 APPLICATION FOR CERTIFICATE OF CITIZENSHIP Immigration and Naturalization Service 149-2007 UNDER SEC. 341 OF THE IMMIGRATION AND NATIONALITY ACT Date 3/14/6, Pc and Oregon Take or mail this application to: LEa IMMIGRATION AND NATURALIZATION SERVICE: (Print or type) PIACENTINE MARGARET DATE March 14-1961 nee COYISTRO nR (Name) (Maiden name, if any) AVE. ALIEN REGISTRATION (Apartment number, Street address, and, if appropriate, 'in care of' PORTLAND AREGON NO. (City) (State) SEE INSTRUCTIONS ON PAGES 5 AND 6 I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) I was born in Rasalana on March 5-1904 B.C.CANAD, (City) (State or Country) (Month) (Day) (Year) (2) My personal description is: Sex F complexion MEQ color of eyes Broux, color of hair Black height 5 feet 2/2 inches; weight 118 pounds; visible distinctive marks name SRAY Marital (3) status: I arrived Single; in the United States Married; at PORTLANA Divorced; Widow(er) on 1-1919 (City/ and State) (Month) (Day) (Year) under the name MARJARY Colisty by means of TRAIN (Name of ship or other means of arrival) on U.S. Passport No issued to me at on (FAThER WAS A CITIPEN (Month) (Day) (Year) (4) Fill in this block only if you arrived in the United States before July 1, 1924. (a) My last permanent foreign residence was VANCOUVED, B.C. CAYARA (City) (b) I took the ship or other conveyance to (c) I was coming to John CulisTRo the United States at JAXCOUVED (City) B.C (Country) CANADA (Country) at (Name of person in the United States) (City and State where this person was living) (d) I traveled to the United States with MOTHER (Names of ILLOMEM relatives with Colisino SISTERS passengers or whom you traveled, and their relationship to if, any) MARY Josephile t ELUERA- you, JOHN CULISTRO (5) I have been absent from the United States as follows (if no absence, state \"None\"): Date departed Date returned Name of ship, or of airline, railroad company, bus company, or Place or port of entry through which you returned to other means used to return to the United States the United States 1960 Canada Jun tay Via Boat Munz N-O MAT STATISTICS: 24 1901 (6) I. HAVE N Ofile filed a declaration of intention to become a citizen of the United States or a petition for naturalization. give full details Chouse of it, A showing question number.) FAILED his (have) (have not) WAS CILIZEN of x1 (If 'have' on a separate sheet paper this size and attach TO BETWEEN THE THE APPLICANT: DO NOT WRITE DOUBLE LINES BELOW. CONTINUE ON NEXT PAGE MOTHER ARRIVAL RECORDS EXAMINED ARRIVAL RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status Age (Signature of person making search) Form N-600 (Rev. 10-20-59) (1)"
}