{
  "anumber": "A13490102",
  "id": "A13490102_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13490102_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CITIZENSHIP BY DERIVATION OF CITIZENSHIP; Form I-130A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1964,
        1922
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(15) Fill in this block only if you claim citizenship through your mother's marriage to your stepfather. The full name of my stepfather is ; he was born on (Month) (Day) (Year) at ; and resides at (City) (State or country) (Street address, city and State or country. If dead, write He became a citizen of the United States by birth; naturalization on \"dead\" and date of death.) (Month) (Day) (Year) in the Certificate No. ; through his (Name of court, city, and State) parent(s), and issued Certificate No. A or AA (was) (was not) He since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and (has) (has not) when he lost and attach it, showing question number.) He and my mother were married to each other on at (Month) (Day) (Year) (City and State or country) My mother is of the race. She (was, was not) issued Certificate No. A Before marrying my mother, my stepfather was married time (s), as follows: (1, 2, 3, etc.) DATE MARRIAGE DATE MARRIED NAME OF WIFE How MARRIAGE ENDED ENDED (Death or divorce) (16) Fill in this block only if you are or were a married woman. I have been married time(s), as follows: (1, 2, 3, etc.) DATE MARRIAGE DATE MARRIED NAME OF HUSBAND CITIZENSHIP OF HUSBAND How MARRIAGE ENDED ENDED (Death or divorce) (17) Fill in this block only if you claim you became a citizen before September 22, 1922 through a husband. Name of citizen husband ; he was born on (Give full and complete name) (Month) (Day) (Year) at ; and resides at (City) (State or country) (Street address, city and State or country. If dead, write He became a citizen of the United States by birth naturalization on \"dead\" and date of death.) (Month) (Day) (Year) in the Certificate No. through his (Name of court, city, and State) parent(s), and issued Certificate No. A or AA (was) (was not) He since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and (has) (has not) when he lost and attach it, showing question number.) I am of the race. Before my marriage to him, he was married time (s), as follows: (1, 2, 3, etc.) DATE MARRIED DATE MARRIAGE How MARRIAGE ENDED ENDED NAME OF WIFE (Death or divorce) (18) Fill in this block if any member of your immediate family has submitted or is submitting a similar application to an office of the Immigration and Naturalization Service. NAME OF RELATIVE RELATIONSHIP WHEN APPLICATION CERTIFICATE No. AND FILE No., IF KNOWN, SUBMITTED AND LOCATION OF OFFICE Anne Newman APR I 0 1964 Sister now A13490 103/A 378004 (19) Signature of person preparing form, if other than applicant. I declare (20) I have not heretofore filed an application for that this document was prepared by me at the request of the applicant (have) (have not) and is based on all information of which I have any knowledge. SIGNATURE a certificate of citizenship on , ADDRESS: DATE: 19 at (SIGN HERE) Jack Miller natu. = (Signature of applicant or parent or guardian) (3)"
}