{
  "anumber": "A13490102",
  "id": "A13490102_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13490102_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit, N-4-10-64"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1913,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "APPLI tNT.-Do not fill in or sign anything on this age AFFIDAVIT I am the applicant, parent, guardian) applicant and do swear that I have I- read the contents of the foregoing or (heard) application comprising pages 1 to 3, and supplementary pages numbered € ) to ( ) inclusive; that I understand their con- tents; that the statements therein are true to the best of my knowledge and belief; that corrections numbered ( () to (32) were made by me or at my request; and that this application has been signed by me with my full, true, and correct name. Jack malehu of (Complete and true signature applicant, parent, or guardian) Subscribed and sworn to before me at Omaha, Nebraska this APR 10 1964 day of 19 Lindahl Johnson LINDAHL 0. JOHNSON signature and title) U. s Naturalization Examiner REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents and records examined, my examination of the applicant, and the examination (s) of the per- son (s) named below, I find that the facts and conclusions set forth under oath in this application are - true and correct; that the applicant did - derive or acquire United States citizenship on Dec. 11, 1913 (Month) (Day) (Year) on which date he was a lawful permanent resident of the United States and under twenty-one years of age, his father having been naturalized on the above date. and that he has not been expatriated since that time. I recommend that this application be granted (has) (has not) (granted, denied) and that an \"A\" Certificate of Citizenship be - issued in the name Hack Melcher (A or AA) applicant's legal name acquired (1) at birth (At birth (1) ; through marriage (2); by court order (3) under State law (4).) (Fill in applicable number(s) and explain if by court order or State law.) The application does - present a prima facie case of citizenship. File A13 490 103 of Ann Newman, sister containing the following Exhibits: as Ex. #3: Form G347 showing gather's naturalizat= (Documents examined in addition to those listed in Item 14) ion; as Ex.#6: death certificate of father. Person Examined Address Relationship Date Testimony to Applicant Heard Ann Newman Omaha, Nebraaka sister APR 10 1964 APR 10 1964 Date of recommendation 19 Officer's signature and title) Linded LINDAHL 0. JOHNSON U. S. Naturalization Examiner I do concur in the decision. 4-10-64 Date 19 Roberthow (Signature of District Director or Officer in Charge) (4)"
}