{
  "anumber": "A13490102",
  "id": "A13490102_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13490102_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, Form N-600 ( (Rev. 8-1-63)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "Germany",
        "United States",
        "Israel"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1924,
        1909,
        1964
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved. FEE STAMP Budget Bureau No. 43-R105.8. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE APPLICATION FOR CERTIFICATE OMAHA, NEBR. N SERVICE $5.00 1 FEE PAID No. OMA-173-6 Immigratio ad Naturalization Service Take or mail this application to: OF CITIZENSHIP MAR 27 AM 9.01 Omaha, Nebraska M&F IMMIGRATION AND NATURALIZATION SERVICE Date 3/13/64 Verified by B Date March 9. 1964 (Print or type) Jack Melcher 2 nee same (Name) (Maiden name, if any) 826 So. 52 St. ALIEN REGISTRATION (Apartment number, Street address, and, if appropriate, \"in care of\") Omaha, Douglas Nebraska No. 1349010 (City) (County) (State) See Instructions on Pages 5 and 6 I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) I was born in Welosin Russia on April 21, 19FND ce) (City) (State or country) (Month) (Day) ar) (2) My personal description is: Sex M ; complexion fair ; color of eyes blue ; color of hair gray ; height 5 feet 10 inches; weight 175 pounds; visible distinctive marks none Marital status: Single; Married; of Divorced; (3) I arrived in the United States at Baltimore, Maryland on June 1909 Open (City and State) 8 under the name Melcher ship (Month) (Year) by means of (Name of ship or other means of arrival) on U.S. Passport No. issued to me at Russia on May 1909 (Month) (Day) (Year) (4) Fill in this block only if you arrived in the United States before July 1, 1924. (a) My last permanent foreign residence was Russia (City) (Country) (b) I took the ship or other conveyance to the United States at Bremen, Germany (City) (Country) (c) I was coming to Father Sam Melcher at Omaha. Nebraska (Name of person in the United States) (City and State where this person was living) (d) I traveled to the United States withMother , Cecelia Melcher, Sister, Annie Melcher, (Names of passengers or relatives with whom you traveled, and their relationship to you, if any) brother Israel, (5) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following information for every absence. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS PLACE OR PORT OF ENTRY THROUTH WHICH You DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE RETURNED TO THE UNITED STATES UNITED STATES Rhend 12 43 9 (6) I have not filed a declaration of intention to become a citizen of the United States or a petition for naturalization. (have) (have not) (If \"have\" give full details on a separate sheet of paper this size and attach it, showing question number.) g TO THE APPLICANT.-Do not write between the double lines below. Continue on next page. ARRIVAL RECORDS EXAMINED ARRIVAL RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status Age (Signature of person making search) Form N-600 (Rev. 8-1-63) (1) (SIGN"
}