{
  "anumber": "A13490102",
  "id": "A13490102_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A13490102_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Certificate of Naturalization, I-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Russia",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1867,
        1907,
        1910,
        1931,
        1866,
        1913,
        2023,
        1909,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(CONTINUE HERE) (5) (7) I claim United States citizenship through my (check whichever applicable) father mother; both parents; husband; as a British Columbia Indian having resided in Alaska continuously since (8) My father's name is Sam Melcher ; he was born on April 15, 1866 at Wolosin, Russia deceased ; and resides at (Month) Sept. (Day) 13, (Year) 1931 (City) (State or country) (Street address, city, and State or country. If dead, write He became a citizen of the United States by birth; naturalization on Dec. 11, 1913 \"dead\" and date of death.) in the Douglas County, Omaha, Nebr. Certificate No. (Month) 423923 (Day) (to Year) (Name of court, city, and State) through his parent (s), and issued Certificate No. A or AA 136083 12 (was) (was not) He had not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he lost (has) (has not) and attach it, showing question number.) He resided in the United States from 1907 to 1931 ; from to ; from to (Year) (Year) (Year) (Year) (Year) (Year) I am the child of his first marriage. (1st, 2d, 3d, etc.) 68 (9) My mother's maiden name was Cecelia Kunin ; her present name we Cecilia Melchir deceased 1867 she was born on ; at Wilna, Russia ; she resides (Month) (Day) (Year) (City) (State or country) at deceased Sept. 17, 1939 She became a citizen of the United States (Street address, city, and State or country. If dead, write \"dead\" and date of death.) by birth; X naturalization under the name of (Sarah) Cecelia Melcher on Dec 11 1913 in the Douglas, Omaha, Nebraska Certificate (Month) 11/20/2023 (Day) (Year) 13608300 (Name of court, city, and State) through her parent(s), and issued Certificate No. A or (was) (was not) AA She had not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when she (has) (has not) lost and attach it, showing question number.) She resided in the United States from 1909 to 1939 ; from Jacs to ; from to I am the (Year) (Year) (Year) (Year) (Year) (Year) child of her first marriage. 21 (1st, 2d, 3d, etc.) (10) My mother and my father were married to each other on unknown Wilno Reuesca (Month) (Day) (Year) (City) (State or country) My mother has been married 1 time (s), and my father has been married 1 time (s). (1, 2, 3, etc.) (1, 2, 3, etc.) (11) My served in the Armed Forces of the United States from (father, mother) (Date) to and honorably discharged. (Date) (was) (was not) (12) I have not lost my United States citizenship. (If citizenship lost, on a separate sheet this size state how and when (have) (have not) you lost and attach it, showing question number.) (13) Issue my certificate in the name of : Jack Mulcher 1 (14) I submit the following documents with this application: Nature of Document Names of Persons Concerned Certificateef-naturelization 1360837 25 U.S. dept of Commerce Census 1910 be Omaha Public School Record 1910 Exz: Ext: FormI404 1910 U.S youring lawful entry of application U.S recebence report GE showing patietage Ex3: Achoox letter app licent showing (30) birth date"
}