{
  "anumber": "A17896323",
  "id": "A17896323_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0017/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Texas State Board of Health Bureau of Vital Statistics Standard Certificate of Death, Form 51b-T130.821--M"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        1967,
        1922,
        1944,
        1859
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "PLACE OF DEATH TEXAS STATE BOARD OF HEALTH B.O.V.S. County Barris BUREAU OF VITAL STATISTICS Reg. Dis. No. F O city Cousten STANDARD CERTIFICATE OF DEATH Registered No 1944 R M D 2FULL NAME. Joseph Tiras (No. gole Chartris St.. 3rd (a) RESIDENCE. No206 St. Blastrie Ward) Length of residence in city or town where death occurred 25 .yrs (If non-resident give city or town and State) mos ds. How long in U. S., if of foreign birth? yrs mos ds. PERSONAL AND STATISTICAL PARTICULARS MEDICAL PARTICULARS 3 SEX 4 COLOR OR 5 SINGLE. MARRIED, WIDOWED 16 DATE OF DEATH Male White RACE. OR DIVORCED (write the word) Married Nov. 15th 1922 6 DATE OF BIRTH (Month) (Day) (Year) Life 20th 1859 17 I HEREBY CERTIFY, That I attended deceased from about 1905 -192 to wor- 15 192.7 (Monroh) (Day) (Year) to that I last saw him alive on nov 13- 192.7 7 AGE If less than 2 years state if breast fed toy yrs 3 mos 15 ds. If less than 1 day and that death occurred, on the date stated above, m. Yes No. hrs. mins. The CAUSE OF DEATH was as follows: 8 OCCUPATION (a) Trade, profession or particular kind of work Meschant belyonic Endo carlitis (b) General nature of industry. business or establishment in which employed (or employer) 9 BIRTHPLACE (State or country) Austria Jailning Probably 4D to uration) yrs. mos. ds. Contributory 10 NAME OF (Secondary) FATHER Asloman Firal (duration) yrs. mos. ds. 11 BIRTHPLACE OF FATHER 18 Where was disease contracted (State or country) Austria if not at place of death? Dowthnow 12 MAIDEN NAME Did an operation precede death MO Date of OF MOTHER LengABerger Was there an autopsy MO 13 BIRTHPLACE OF MOTHER Austra What test confirmed dia mosis (State or country) (Signed) M. D. 14 THE ABOVE IS TRUE (Informant) J. Piras 11-15 192. (Address) Begg *State the Disease Causing Death. or in deaths from Violent Causes. state (1) Means and Nature of Injury, and (2) whether Accidental, Sui- (Address) Houston Telas cidal or Homicidal. (See reverse side for State Statutes.) 19 PLACE OF BURIAL OR REMOVAL DATE OF BURIAL 15 11/15 192.2 Filed 11-15 192 V 20 UNDERTAKER ADDRESS 79 Sid Westheimer Registrar Couston Form 51b-T130-821-100M STATE OF TEXAS COUNTY OF HARRIS I HEREBY CERTIFY THAT THE ABOVE IS A PHOTOSTATIC COPY OF A CERTIFICATE AS FILED IN THE BUREAU OF VITAL STATISTICS, CITY HEALTH DEPARTMENT, HOUSTON, TEXAS. ISSUED Mar. 13, 1967 DATE LOCAL REGISTRAR"
}