{
  "anumber": "A17896323",
  "id": "A17896323_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application,, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1880,
        1891,
        1939,
        1881,
        1886,
        1890,
        1922,
        1892,
        1859
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(CONTINUE HERE) (7) I claim United States citizenship through my (check whichever applicable) father; mother; both parents; husband; as a British Columbia Indian having resided in Alaska continuously since (8) My father's name is Joseph Tiras ; he was born on July 20 1859 (Month) (Day) (Year) at ? Austria ; and resides at Dead - Died Nov. 15, 1922 (City) (State or country) (Street address, city, and State or country. If dead, write He became a citizen of the United States by birth; naturalization on March 5, 1892 \"dead\" and date of death.) (Month) (Day) (Year) in the District Court, Bonham(Fanning County) Texas Certificate of Naturalization No. No number ; (Name of court, city, and State) through his parent(s) and issued Certificate of Citizenship No. A or AA (was) (was not) (If known) His former Alien Registration No. was Unknown He has not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when he (has) (has not) lost and attach it, showing question number.) He resided in the United States from 1886 about 1890 a bout 1891 to from to 1922 ; from to (Year) (Year) (Year) (Year) (Year) (Year) I am the child of his 1st (1st, 2d, 3d, etc.) JITTAL marriage. (alan Jetty) 4 (9) My mother's maiden name was Jetty Rosenbaum ; her present name is Jetty Tiras ; she was born on March 12 1859 ; at Unknown Germany ; she resides (Month) (Day) (Year) (City) (State or country) at Dead - died January 3. 1939 She became a citizen of the United States (Street address, city, and State or country. If dead, write \"dead\" and date of death.) by birth; naturalization under the name of Jetty Tiras 5 the District Court Bonham (Fanning County) Texas 6 March 5 1892 on in (Month) (Day) (Year) 2 (Name of court, city, and State) Certificate of Naturalization No. No number X husband through her parent(s), and was nut ; issued Certificate (was) (was not) Unknown of Citizenship No. A or AA (If known) Her former Alien Registration No. was She has not since lost United States citizenship. (If citizenship lost, on a separate sheet this size state how and when she (has) (has not) lost and attach it, showing question number.) She resided in the United States from 1886 a to bout 1890 about 1891 to 1939 ; from ; from to I am the (Year) (Year) (Year) (Year) (Year) (Year) child of her 1st marriage. (1st, 2d, 3d, etc.) 1881 (10) My mother and my father were married to each other on about 1880 or at ? Austria or Germany (Month) (Day) (Year) (City) (State or country) My mother has been married 1 time(s), and my father has been married 1 time(s). (1, 2, 3, etc.) (1, 2, 3, etc.) (11) My served in the Armed Forces of the United States from (father, mother) (Date) to and honorably discharged. (Date) (was) (was not) (12) I have not lost my United States citizenship. (If citizenship lost, on a separate sheet this size state how and when you (have) (have not) lost and attach it, showing question number.) Isador Tiras (13) Issue my certificate in the name of : (14) I submit the following documents with this application: Nature of Document Names of Persons Concerned Census Report Isador Tiras Photographs (3) Isador Tiras 10 Death Certificate Joseph Tiras Death Certificate Jetty Tiras Persona check $5.00 Isador Tiras (2)"
}