{
  "anumber": "A17896323",
  "id": "A17896323_0032",
  "page_index": 32,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0032/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form N-25 (Rev. 8-1-61"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1892,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved Budget Bureau No. 43-R 073.5 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE P O Box 61630 Houston, Texas 77061 DATE March 29, 1967 Clerk of the District Court of Fannin County FILE NO. Bonham, Texas A17 896 323 NAME OF APPLICANT Isador Tiras NAME OF ALLEGEDLY NATURALIZED PERSON APPROXIMATE DATE OF NATIVE OF NATURALIZATION Joseph TIRAS March 5, 1892 Austria The person named above is alleged to have been\\naturalized in your court. If your records show that this person was naturalized, please fill out the blocks as completely as your records permit. If no naturalization record is found write \"No Record\" above your signature. However, if a Declaration of Intention was filed please fill in the lower block. If the subject's signature is available, please make one tracing on thin paper and return it with this report. The information is requested for the official use of this Service. Sincerely, Officer in Charge Est NAME OF NATURALIZ) PERSON AS SHOWN IN COURT RECORDS DATE OF NATURALIZATION PETITION NO. CERTIFICATE NO. COURT (Title and Location) DATE AND PLACE OF BIRTH (or age) FORMER ALLEGIANCE PLACE OF RESIDENCE OCCUPATION DATE, PLACE AND MANNER OF ARRIVAL IN THE UNITED STATES NAMES OF WITNESSES MARITAL STATUS NAME OF SPOUSE NAMES OF CHILDREN, DATES AND PLACES OF BIRTH OTHER INFORMATION APPEARING ON RECORD After a search through the records, we failed to find any Tiras papers, DECLARATION OF INTENTION FILED (Date) Roht E. Signature Dorough and Title of person by verifying Freda Report Singan AGE OR DATE OF BIRTH Departy March 30, 1967 DATE UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Form N-25 (Rev. 8-1-61)"
}