{
  "anumber": "A17896323",
  "id": "A17896323_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0018/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "STATE OF TEXAS COUNTY OF HARRIS, TEXAS DEPARTMENT OF HEALTH BUREAU OF VITAL STATISTICS STANDARD CERTIFICATE OF DEATH"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1859,
        1934,
        1938,
        1967,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "1. PLACE OF DEATH TEXAS DEPARTMENT OF HEALTH STATE OF TEXAS BUREAU OF VITAL STATISTICS 99 16 COUNTY Harris OF STANDARD CERTIFICATE OF DEATH REGISTRAR'S NO CITY OR PRECINCT NO Houston NO 206 Chartres STREET IF IN AN INSTITUTION, GIVE NAME OF INSTITUTION INSTEAD OF STREET AND NO. LENGTH OF RESIDENCE IN CITY WHERE DEATH OCCURRED YEARS 42 How LONG IN U. S. IF MONTHS DAYS. FOREIGN BORN? YEARS MONTHS DAYS 2. FULL NAME OF DECEASED Mrs Jetty Tiras RESIDENCE OF THE DECEASED NO 906 STREET Chartres Houston CITY STATE Texas PERSONAL AND STATISTICAL PARTICULARS MEDICAL PARTICULARS 3. SEX 4. COLOR OR RACE 5. SINGLE MARRIED 21. DATE OF DEATH Female White WIDOWED DIVORCED 1dowed Jan. 3 9 (WRITE THE WORD) (MONTH, DAY AND YEAR) 193 . IF MARRIED, WIDOWED, OR DIVORCED 22. I HEREBY CERTIFY. THAT I ATTENDED DECEASED FROM HUSBAND OF (OR) WIFE OF Joseph H Tiras 6. DATE OF BIRTH ( MONTH. DAY, AND YEAR) March 12 1859 I LAST SAW H or ALIVE ON. 1938 Journey3 TO January 1934 193 3 DEATH 193R IS SAID 7. AGE N95 22 IF LESS THAN 9 1 DAY HRS TO ON THE DATE STATED ABOVE, YEARS MONTHS DAYS OR MIN DATE OF AT M. THE PRINCIPAL CAUSE OF DEATH AND RE- 8. TRADE, PROFESSION, OR PARTICULAR ONSET LATED CAUSES OF IMPORTANCE WERE AS FOLLOWS: KIND OF WORK DONE. AS SPINNER, SAWYER, BOOKKEEPER. ETC. Housewife Whiteaus 9. INDUSTRY OR BUSINESS IN WHICH WORK WAS DONE, AS SILK MILL, SAW MILL, BANK, ETC. Youghur Feat OTHER CONTRIBUTORY CAUSES OF IMPORTANCE: January 1,939 10. DATE DECEASED LAST 11. TOTAL TIME WORKED AT THIS OCCUPA- (YEARS) SPENT IN TION (MONTH AND YEAR) THIS OCCUPATION Surar years 12. BIRTHPLACE CITY OR TOWN) Veoletis STATE OR COUNTRY) Germany NAME OF OPERATION. DATE OF 13. NAME Rosonbaum WHAT TEST CONFIRMED DIAGNOSIS? THERE AN AUTOPSY 40 23. IF DEATH WAS DUE TO EXTERNAL CAUSES (VIOLENCE) FILL IN ALSO 14. BIRTHPLACE THE FOLLOWING: (CITY OR TOWN) (STATE OR COUNTRY) Germany ACCIDENT, SUICIDE, OR HOMICIDE 15. MAIDEN NAME No record DATE OF INJURY 193 16. BIRTHPLACE (CITY OR TOWN) WHERE DID INJURY OCCUR? (STATE OR COUNTRY) No record (SPECIFY CITY OR TOWN, COUNTY, AND STATE) 17. INFORMANT SPECIFY WHETHER INJURY OCCURRED IN INDUSTRY, IN HOME, OR IN PUB LIC PLACE. Mr I Tiras (ADDRESS) Houston Texes MANNER OF INJURY 18. BURIAL REMOV Math Yeshurum Com Jan. 4 9 NATURE OF INJURY PLACE DATE 193 19. UNDERTAKER 24. WAS DISEASE OR INJURY IN ANY WAY Lto GREER-LEVY (ED J LEVY #551) RELATED TO OCCUPATION OF DECEASED? (ADDRESS) Houston Texas IF so, SPECIFY 20. SIGNATURE AND FILE DATE OF LOCAL REGISTRAR JAN 5- 1939 a 12 Wale (SIGNED) M. D 193 (ADDRESS) 2815maul-st- (FILE DATE) SIGNATURE) STATE OF TEXAS COUNTY OF HARRIS I HEREBY CERTIFY THAT THE ABOVE IS A PHOTOSTATIC COPY OF A CERTIFICATE AS FILED IN THE BUREAU OF VITAL STATISTICS, CITY HEALTH DEPARTMENT, HOUSTON, TEXAS. ISSUED Mar. 13, 1967 DATE LOCAL REGISTRAR"
}