{
  "anumber": "A17896323",
  "id": "A17896323_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit, A178963223"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1892,
        1967,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Copied at the National Archives at Kansas City A17896323 APPLICANT.-Do not fill in or sign anything on this page AFFIDAVIT I, the applicant , do swear Subscribed and sworn to before me upon examination of the (Applicant, parent, guardian) that I know and understand the contents of this application, applicant (paratic) guardian) at Houston, Texas signed by me, attached supplementary pages num- , this 9 day of June , 196.7, bered inclusive; that the same are true to the and continued solely for: best of my knowledge and belief; and that corrections num- none bered ) to 10 were made by me or at my request. Isadov Tirav Billy Kebiparan Gen. Attorney (Nationality) (Signature of applicant, parent, guardian) (Officer's signature and title) REPORT AND RECOMMENDATION ON APPLICATION On the basis of the documents, records, and persons examined, and the identification upon personal appearance of the underage beneficiary, I find that all the facts and conclusions set forth under oath in this application are - true and correct; that the - applicant did derive or acquire United States citizenship on March 5, 1892 (Month) (Day) (Year) on which date he was a lawful permanent resident of the United States and under 21 years of age, his father having been naturalized on that date. and that (s)he has not been expatriated since that time. I recommend that this application be granted and that A Certificate of Citizenship be - issued in the name of Isador Tiras (A) (AA) In addition to the documents listed in Item 14, the following documents and records have been examined: Exhibit 1; 1900 census record in lieu of parents MC and applicant's BC Exhibit 2: Form I-181--re lawful permanent residence of applicant Exhibit 3: Form N-25 re natz of applicant's father Exhibit 4: Natz certificate of applicant's father Exhibit 5: DC of applicant's father Exhibit 6: DC of applicant's mother Relationship Date Testimony Person Examined Address to Applicant Heard Stanley Tiras Henig 507 Majestic, Houston, Texas adoptive brother 6-9-67 Gen. Attorney (Nationality) (Officer's signature and title) June 9 , 196 7 - I do concur in the recommendation. Date June 9 , 1967 (Signature of District Director Blue (4)"
}