{
  "anumber": "A17896323",
  "id": "A17896323_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CI, A17 896 323"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Austria"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1967,
        1882,
        1886
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "MEMORANDUM OF CI TION OF RECORD OF LAWFUL PEL NENT RESIDENCE Place Houston, Texas Status as a lawful permanent resident of the United States is accorded: File No. A17 896 323 NAME Sex Isador Tiras male ADDRESS 3410 Norris Street, Houston, Texas NATIONALITY DATE OF BIRTH PLACE OF BIRTH native of Austria Jan. 23, 1882 Wadowice, Austria COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE: (If any) PRIORITY DATE REMARKS NONPREFERENCE: Individual section 212(a)(14) certification issued; Blanket section 212(a)(14) certification issued; Section 212(a)(14) certification not required because As of 1886 at New York, N.Y. (Month) (Day) (Year) (Place) Class of admission (insert coding symbol) the requirements of the following provision of law having been fulfilled. Sec 203 (h) of the I & N Act Sec. 2 of the Act of 11/2/66 Sec 244 () ( ) of the I & N Act Sec 13 of the Act of 9/11/57 Private Law no. of the Sec 245 of the I & N Act Sec 249 of the I & N Act Congress session Sec. 1 of the Act of 11/2/66 8 CFR 101. 1 (a) (Other law - Specify) (Applicable in all cases) Date May 12, 1967 Recommended by Billy Immigration Officer Date Approved OIC FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office, Dept. of State) Date Form I-357 delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D. C. 20520 for allocation of Immigrant visa number. State Director, Selective Service Form I-181 (Rev. 11-2-66) UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION ANDNATURALIZATION SERVICE EXHIBIT 2"
}