{
  "anumber": "A17896323",
  "id": "A17896323_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A17896323_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR CERTIFICATE OF CITIZENSHIP, Form No. N-600 ( (Rev. 11-1-65)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1882,
        1891,
        1886,
        1890,
        1967,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "P. O. Ex 61630 Texas 77061 FEE STAMP Form approved. UNITED STATES DEPARTMENT OF JUSTICE Budget Bureau No. 43-R105.8. IMMIGRATION AND NATURALIZATION SERVICE $ 5.00 FEE PAID APPLICATION FOR CERTIFICATE 67-162-1 OF CITIZENSHIP Immigration and Naturalization Service Take or mail this application to: Date 3/28/67 Houston, Texas M & F IMMIGRATION AND NATURALIZATION SERVICE Verified by the Date March 27, 1967 (Print or type) Isador Tiras nee (Name) (Maiden name, if any) 3410 Norris Street (Apartment number, Street address, and, if appropriate, \"in care of\") ALIEN REGISTRATION Houston Harris Texas 77025 No. A17 896323 (City) (County) (State) See Instructions on Pages 5 and 6 I hereby apply to the Commissioner of Immigration and Naturalization for a certificate showing that I am a citizen of the United States of America. (1) I was born in Wadowice Austria on January 23, 1882 (City) (State or country) (Month) (Day) (Year) (2) My personal description is: Sex Male ; complexion Light ; color of eyes Brown ; color of hair Gray height 5 feet 11/2 inches; weight 110 pounds; visible distinctive marks Heighth , Marital status: Single; Married; Divorced; Widow (er). (3) I arrived in the United States at New York, N.Y. on ? about 1886 2 City and State) (Month) (Day) (Year) under the name Isador or Itzik TIRAS 3 by means of ship-Probably Salle' or 'Zalle' (Name of ship or other means of arrival) on U.S. Passport No. issued to me at Later destroyed by fire on ; on an Immigrant Visa. (Month) (Day) (Year) (4) FILL IN THIS BLOCK ONLY IF YOU ARRIVED IN THE UNITED STATES BEFORE JULY 1, 1924. (a) My last permanent foreign residence was Either Wadowice or Andrychow Austria (City) (Country) (b) I took the ship or other conveyance to the United States at Either Bremen or Hamburg, Germany (City) (Country) (c) I was coming to at (Name of person in the United States) (City and State where this person was living) (d) I traveled to the United States with Joseph Tiras-Father Jetty Tiras,-Mother (Names of passengers or relatives with whom you traveled, and their relationship to you, if any) Otto Tiras - Younger Brother (5) Have you been out of the United States since you first arrived? Yes No. If \"Yes\" fill in the following information for every absence. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY, BUS DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED To RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES RETURNED TO THE UNITED STATES About 1890 About 1891 Name of Ship unknown New York, N. Co (6) I have not filed a declaration of intention to become a citizen of the United States or a petition for naturalization. (have) (have not) (If \"have\" give full details on a separate sheet of paper this size and attach it, showing question number.) TO THE APPLICANT.-Do not write between the double lines below. Continue on next page. ARRIVAL RECORDS EXAMINED ARRIVAL RECORD FOUND Card index Place Date Index books Name Manifests Manner Marital status Age (Signature of person making search) Form N-600 (Rev. 11-1-65) (1)"
}