{
  "anumber": "A19055851",
  "id": "A19055851_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1952
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Form approved. OMB No. 43-R0433 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Alien Registration No. A19 055 85 Petition No. GeoRge Wolfson 10717 Wi IshiRe Blvd Date Los Angeles, Calif, 90024 Your application has been received and arrangements have been made to help you in the next step towards naturalization. Please come 300 No. Los Angeles Street to Los Angeles, California 90012 Room 8010 8th Floor on at .M. The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. If you are applying for citizenship for yourself, you will be tested on your knowledge of the government of the United States and its history. You will also be tested on your ability to read, write, and speak English, unless on December 24, 1952, you had been living in the United States for a total of at least 20 years and were then over 50 years old, or unless you are physically unable to read, write, or speak. YOU MUST BRING WITH YOU: A. $25 in (cash) (postal money order made payable to the Clerk of Court) for filing fee. B. Two witnesses who are citizens of the United States, and who have known you well and have seen you very often during the past 5 years. who have known you well and have very often seen you and your child (children). who have known you very well and have very often seen you, your spouse, and your adopted child (children). who can identify you as the person named in your discharge certificate(s). IN ADDITION, YOU MUST BRING WITH YOU THE NUMBERED ITEMS LISTED BELOW, AND ALSO THE ITEMS CHECKED ON THE OTHER SIDE OF THIS LETTER. PLEASE KEEP THIS APPOINTMENT EVEN THOUGH YOU DO NOT HAVE ALL THE NUMBERED OR CHECKED ITEMS. 1. This letter. 2. Alien registration receipt card(s). 3. Any draft card (s). 4. Any documents you have which you used in connection with any entries into the United States. 5. The Personal Description Form on the reverse hereof, completely filled in. READ THIS PARAGRAPH VERY CAREFULLY If the witnesses you bring with you have known you for less than the number of years shown in Item B above, they may be used only if they have known you during at least the last six months. In such case, you will still have to have additional witnesses, at a later date, to cover the rest of the years shown in Item B above. You should therefore bring with you witnesses who have known you for as long as possible. When you appear for your appointment, the examiner will explain how to obtain any additional witnesses that may be-needed. Form N-430 IMPORTANT--SEE ITEMS CHECKED ON OTHER SIDE (Rev. 8-1-74)N"
}