{
  "anumber": "A19055851",
  "id": "A19055851_0042",
  "page_index": 42,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0042/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Information About Alien Beneficiary, A19-055-851"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        1999,
        1909,
        1934
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "A19-055-851 Block -Information About Alien Beneficiary 7. Name of alien GEORGE WOLFSON (First name) (Middle initial) (Last name) If this petition is for a married woman, give her maiden name 8. Alien was born Dec. 11, 1909 Karachi Pakistan (Date) (City or town) (State or Province) (Country) 9. a. Relationship of alien to petitioner father b. Is the alien related to you by adoption? no 10. Alien's marital status (Check appropriate block) Married Widowed Divorced Single a. Name of alien's spouse, if married, and date and country of birth b. Names, birthdates and countries of birth of alien's children, if any Mery1 Wolfson, Alpert, Dec. 8, 1934, Toronto Canada C. Full address of alien's spouse and children, if any 11. If this petition is for your spouse or child, give the following: a. Date and place of your present marriage b. Number of your prior marriages C. Number of prior marriages of spouse d. Last address at which you and your spouse resided together (Apt. No.) (Number and street) From To (Town or city) (State or Province) (Country) (Month) (Year) (Month) (Year) 12. If this petition is for a child, a. Is the child married? b. Is the child your adopted child? If so, give the names, dates, and places of birth of all other children adopted by you. If none, so state 13. If this petition is for a brother or sister, are both your parents the same as the alien's parents? If not, submit a separate statement giving full details as to parentage, dates of marriage of parents, and the number of previous marriages of each parent. 14. If separate petitions are also being submitted for other relatives, give names of each and relationship to petitioner 15. Have you ever filed a petition for this alien before? No If so, give place and date of filing and result: 16. Has this alien ever been in the United States? Yes Has this alien ever been deported from the United States? No If so, give Alien Registration Number, and date and place where deportation hearing was held: 17. Address in the United States where alien will reside 711 Westmount, Apt. 5, West Hollywood, California 18. a. Address at which alien is presently residing same as no. 17 (Apt. No.) (Number and street) (Town or city) (State) (ZIP Code, if in U.S.) Since (Month) (Year) b. If alien is in the United States, give the following: Name and address of present employer Date alien began this employment (Month) (Day) (Year) 19. Check the appropriate box below and furnish the information required for the box checked: a. Alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) b. Alien is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the Office of the Immigration and Naturalization Service at Los Angeles California (City) (State) If the application for adjustment of status is denied the alien will apply for a visa abroad at the American Consulate in (City in foreign country) (Foreign country) Block III.-Oath or Affirmation of Petitioner I swear (affirm) that I know the contents of this petition signed by me and that the statements herein are true and correct. Signature of petitioner (See Instruction No. 5) MERYL WOLFSON ALPERT X Subscribed and sworn to (affirmed) before me this 24 day of MARCH for for they A.D. 1999 at Queens County Olpart LOUIS ALPERT [SEAL] My commission expires Notary-- Publis, State of New York No. 41-5058450 report - NOTARY (Signature of officer administering oath) (Title) Block Marclerson Psyparing Form, if Other Than Petitioner Qualified; in Queens County Commission Expires I declare that this document was prepared by me at the request of the petitioner and is based .on all information of which I have any knowledge. POS BITTH SHAMIR Ausures 5670 Wilshire Blvd., L.A., Calif. March 18, 1969 (Signature) (Address) (Date) 2"
}