{
  "anumber": "A19055851",
  "id": "A19055851_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RESULTS OF EXAMINATION"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1955,
        1961,
        1950,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(9) (If petition filed under Section 16(a).) I hav ded continuously in the United States for at least five and continuously in the State in which this petition is made for at least six months diately preceding the date of this petition, and I have physically present in the United States for at least one-half of such five-year period. (10) (If petition filed under Section 319(a).) I have resided continuously in the United States in marital union with my present spouse for at least three years immediately preceding the date of this petition. during all of which period my said spouse has been a United States citizen, and have been physically present in the United States at least one-half of such three-year period. I have resided continuously in the State in which this petition is made at least six months immediately preceding the date of this petition. (11) (If petition is filed under Section 319(b).) My present spouse is a citizen of the United States, in the employment of the Government of the United States, or of an American institution of research recognized as such by the Attorney General, or an American firm or corporation engaged in whole or in part in the development of foreign trade and commerce of the United States, or subsidiary thereof, or of a public international organiza- tion in which the United States participates by treaty or statute, or is authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States, or is engaged solely as a missionary by a religious denomination or by an interdenominational mission organization having a bona fide organization within the United States, and such spouse is regularly stationed abroad in such employment. I intend in good faith upon naturalization to live abroad with my spouse and to resume my residence within the United States immediately upon termination of such employment abroad. (12) (If petition is filed under Section 328.) I have served honorably in the Armed Forces of the United States for a period or periods aggregating three years. I have never been separated from the Armed Forces of the United States under other than honorable conditions. If not still in service, my service terminated within six months of the filing of my petition. (13) (If petition is filed under Section 329.) While an alien or noncitizen national of the United States, I served honorably in an active-duty status in the military, air, or naval forces of the United States during either World War I or during a period beginning September 1, 1939, and ending December 31, 1946, or during a period beginning June 25, 1950, and ending July 1, 1955, or during a period beginning February 28, 1961, and ending on a date desig- nated by the President by Executive Order as of the date of termination of the Vietnam hostilities, or during a period beginning 19 and ending 19 or I was discharged after five years of service under the Act of June 30, 1950 (P.L. 597, 81st Congress). If separated from such service, I was separated under honorable conditions. At the time of enlistment, reenlistment, or induction I was in the United States, the Canal Zone, American Samoa, or Swains Island. If not in any of these places, I was lawfully admitted to the United States for permanent residence subsequent to enlistment or induction. I was never separated from such service on account of alienage. I was not a conscientious objector who performed no military, air, or naval duty whatever or refused to wear the uniform. I have not previously been naturalized on the basis of the same period of service. (14) (15) I am not and have not been, within the meaning of the Immigration and Nationality Act, for a period of at least 10 years immediately preceding the date of this petition, a member of or affiliated with any organization proscribed by such Act, or any section, subsidiary, branch, affiliate or sub- division thereof, nor have I during such period believed in, advocated, engaged in, or performed any of the acts or activities prohibited by such Act. (16) I am, and have been during all the periods required by law, a person of good moral character, attached to the principles of the Constitution of the United States and well disposed to the good order and happiness of the United States. (17) It is my intention in good faith to become a citizen of the United States and to take without qualification the oath of renunciation and allegiance prescribed by the Immigration and Nationality Act, and to reside permanently in the United States. I am willing, when required by law, to bear arms on behalf of the United States, to perform noncombatant service in the Armed Forces of the United States, and to perform work of national im- portance under civilian direction (unless exempted therefrom). (18) I am able to read, write, and speak the English language (unless exempted therefrom), and I have a knowledge and understanding of the funda- mentals of the history, and of the principles and form of government of the United States. (19) Attached hereto and made part of this, my petition for naturalization, are the affidavits of at least two verifying witnesses required by law, and supplemental affidavit on Form N (20) Wherefore I pray that I may be admitted a citizen of the United States of America. I swear (affirm) that I know the contents of this petition for naturalization subscribed by me, and that the same are true to the best of my knowledge and belief, and that this petition is signed by me with my full, true name. SO HELP ME GOD. (Full Name, Without Abbreviation) Reduction 6961 SI NOC puv 6I 9261 ST NON the the 78 II 1780 pue mohe not 11!75 JO yo (I) IOI 32826 : now more : new : mm man : new new : were nuno sq : MBW s mow HMXL A (S)IL-1-9 UMOUX HMXS(S)IL-L9 MM S D (2) (I) D'N SW or WOIL u! Causo 07 WOIL u! or a un 07 WOIL un OL love parinber 18 R Bow ai 928-0 40 7405 IN 40 40 NOILOV NOILVNINAXE"
}