{
  "anumber": "A19055851",
  "id": "A19055851_0038",
  "page_index": 38,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0038/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, Form I-72 ( (Rev. 8-15-69)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 300 NORTH LOS ANGELES STREET LOS ANGELES, CALIFORNIA 90012 LOS TC/245-je File No. A19 055 851 Date March 18, 1970 7 Mr. George Wolfson c/o Ruth Shamir, Attorney 5670 Wilshire Boulevard Suite 1885 L Los Angeles, California 90036 J YOUR APPLICATION/PETITION AND ITS SUPPORTING DOCUMENTS HAVE BEEN REVIEWED AND FOUND TO BE INSUFFICIENT TO PERMIT ADJUDICATION BY THE SERVICE. PLEASE COMPLY WITH THE BELOW CHECKED \"X\" INSTRUCTIONS: 1. The above application/petition and its supporting documents are attached. After complying with the indicated instructions, please resubmit the fully documented application/petition to this office. 2. Furnish the required fee of $ 3. Furnish your record of birth (if not available, furnish other evidence of birth). 4. Furnish your marriage record including evidence of the termination of any prior marriage contracted by you or your spouse. 5. Furnish two photographs, 1 1/2\" X 1 1/2\" with distance from top of head to point of chin 11/4\". Machine-made photos not acceptable. 6. Furnish the date and port of each of your entries into the United States and the name of the ship, plane, or other vehicle on which you traveled. 7. All_foreign language documents must be accompanied by English translations thereof, including certification as to accuracy of translation and competency of translator. 8. Complete Form ES-575A. 9. Furnish evidence of your qualifications in accordance with attached instructions for completion of Form ES-575A. 10. Submit to your (prospective) employer, completed Form ES-575A and evidence of your qualifications. Request your (prospective) employer to complete Form ES-575B, and to submit the Forms ES-575A and B and evidence of your qualifications to the local state employment service office. If the Labor Department issues a certification, your employer should return to you the evidence of your qualifications and Forms ES-575A and B with the certification stamped on Form ES-575, for submission with your application. (Forms ES-575A and B with instructions are attached.) 11. Your petition to confer preference under section 203(a)(6) of the Immigration and Nationality Act cannot be accepted unless accompanied by a certification from the Secretary of Labor or his designated representative. To apply for the certification, attached Forms ES-575A and B, and the evidence of the alien's qualifications must be filed in the local state employment service office. The Forms ES-575A and B and the evidence will be returned to you, with the certification stamped on Form ES-575 if a certification is issued. You may then file the petition at this office, attaching all papers and documents returned to you by the Department of Labor. 12. You have indicated that you do not intend to seek employment. You must furnish evidence that you have sufficient funds or other means of maintaining yourself in this country. 13. Please furnish evidence to establish the petitioner's claim to United States citizenship together with your Form I-94 (Arrival-Departure Record) which may be found fastened to your Passport. Please also include a current letter of employment. cc: Mr. George Wolfson 312 N. Faring R.d. L. A., Calif. RETURN THIS LETTER AND ALL ATTACHMENTS WITH YOUR RESPONSE Form 1-72 (Rev. 8-15-69)"
}