{
  "anumber": "A19055851",
  "id": "A19055851_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, FORM I-4"
    },
    "years": {
      "ms_years_nlp_v1": [
        1970
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U ED STATES DEPARTMENT OF JUST IMMIGRATION AND NATURALIZATION SERVICE 300 North Los Angeles Street Los Angeles, California 9001.2 FILE NO.: A19 055 851 TC/245 DATE: April 24, 1970 Mr. George Wolfson Ruth Shamir, Attorney at Law 312 No. Faring Road 5670 Wilshire Blvd., Suite 1885 Los Angeles, California 90026 Los Angeles, California 90036 MEDICAL AND IMMIGRATION EXAMINATION APPOINTMENT INSTRUCTIONS FOR MEDICAL EXAMINATION A MEDICAL EXAMINATION IS NECESSARY AS PART OF YOUR APPLICATION FOR ADJUSTMENT OF STATUS TO THAT OF A PERMANENT RESIDENT. AN APPOINTMENT HAS BEEN MADE FOR YOU TO BE EXAMINED BY A DOCTOR OF THE U.S. PUBLIC HEALTH SERVICE AT: ADDRESS: U.S. Public Health Service DATE: Friday, May 22, 1970 825 So. Beacon Street San Pedro, California 90731 TIME: 2:30 PM IF YOU DO NOT SPEAK ENGLISH, YOU SHOULD BE ACCOMPANIED BY A PERSON OF YOUR OWN SEX WHO CAN ACT AS INTERPRETER. BRING WITH YOU THIS LETTER, THE TWO ATTACHED COPIES, AND THE FOLLOWING TO THE PUBLIC HEALTH SERVICE FACILITY MENTIONED ABOVE: 1. X-RAY FILM (14\" x 17\") OF YOUR CHEST. FILM MUST NOT BE MORE THAN 30 DAYS OLD AND INTERPRETED BY A LICENSED PHYSICIAN. 2. SEROLOGY REPORT. SEROLOGIC TEST FOR SYPHILIS MUST NOT BE MORE THAN 30 DAYS OLD. THIS X-RAY AND TEST MUST BE ACCOMPLISHED BY A LICENSED PHYSICIAN OR A STATE OR LOCAL HEALTH DEPARTMENT APPROVED-LAB ORATORY IF YOU DO NOT HAVE A PERSONAL PHYSICIAN YOU MAY WISH TO TELEPHONE YOUR STATE OR LOCAL HEALTH DEPARTMENT FOR THE NAME OF AN APPROVED LABORATORY THAT MAY BE ABLE TO PERFORM THE X-RAY AND TEST REQUIRED. PLEASE SHOW THIS LETTER TO YOUR DOCTOR (OR LABORATORY) PERFORMING THE EXAMINATION AND FUR- NISH HIM WITH YOUR SIGNATURE, WRITTEN IN HIS PRESENCE FOR INCLUSION WITH HIS REPORT. SEE ATTACHED LIST OF APPROVED HOSPITALS AND SPECIAL INSTRUCTIONS INSTRUCTIONS FOR IMMIGRATION INTERVIEW AN APPOINTMENT HAS ALSO BEEN MADE FOR AN INTERVIEW BEFORE AN IMMIGRATION OFFICER AT: ADDRESS: 300 North Los Angeles Street, Room 8024 DATE: Monday, May 25, 1970 LOS Angeles, California 90012 TIME: 9:00 AM THE BELOW CHECKED ITEMS ARE NECESSARY FOR PROPER COMPLETION OF YOUR APPLICATION. BRING THEM WITH YOU AT THE TIME OF INTERVIEW: (IF NONE CHECKED, JUST APPEAR AT THIS OFFICE AFTER MEDICAL EXAMINATION IS COMPLETED. BIRTH CERTIFICATE MARRIAGE CERTIFICATE FORM I-134, AFFIDAVIT OF SUPPORT. A FORM IS ENCLOSED FOR YOUR USE. TWO IDENTICAL PASSPORT SIZED PHOTOGRAPHS (2\"x2\") YOUR PASSPORT AND FORM I-94 OTHER: Ask for Mr. Charles FORM - 486 DISTRICT DIRECTOR (REV. 10-15-69)"
}