{
  "anumber": "A19055851",
  "id": "A19055851_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Before you can apply for natura ation, you must reside in the United St for years after the date you entered for permanent residence. Resubmit your application after Your application shows you do not have the required knowledge of English. Have someone read the attached Form M-132 to you. Resubmit your application when you have learned to read and write and speak English and are ready to be examined. Submit identical, unglazed photographs taken within the last thirty days, 2 by 2 inches, on thin paper, light background showing front view without hat, distance from top of head to point of chin approximately 1 1/4 inches. They may be in natural color or in black and white, but black and white photographs which have been tinted or otherwise colored are not acceptable. Machine-made photo- graphs are not acceptable. Sign full name in ink on front of all photographs in the margin and not across the face or clothing. Submit naturalization or citizenship certificate of Give your Alien Registration number Submit the mutilated certificate for which you requested replacement. Submit a list of all your absences from the United States, the ports where you reentered, and the ship, plane, or other vehicle on which you traveled. Include absences to contiguous territories. Submit evidence that you lived in the United States before (SEE FOOTNOTED BELOW) Submit evidence to show you resided in and were physically present in the United States for 10 years before the birth of your child(ren) at least 5 years of which were after your birthday. (SEE FOOTNOTES BELOW) Submit an English translation of the attached (SEE FOOTNOTES BELOW) Complete and return the enclosed Form No. Complete the attached Form N-14a, and return it to this office. Complete only the top portions and return the three attached Forms N-426. Print complete address of your local draft board and your draft classification. A record of your lawful admission for permanent residence cannot be located. To create such a record, fill out and return the enclosed Form I-485, together with the fee, photographs, and sup- porting evidence. (SEE FOOTNOTES BELOW, The depositions of your witness(es) to cover your residence in are not acceptable because Please ha new witness(es complete and return the enclosed Form N-462 to this office. FOOTNOTES EVIDENCE. Evidence consist of birth certificates, baptismal certificates, marriage certificates, bankbooks, school records, insurance licies, receipts, licenses, letters, postal cards, employment records, listings in city directories, membership in nizations, police records, census records, leases, deeds, and any other records showing your presence in the United States during the required period. DOCUMENTS. Documents in a foreign language must be accompanied by a notarized English translation certified by the translator as to the accuracy of the translation and as to his competency to translate. If you want any original document returned to you, and if the law does not prohibit the making of copies, a photostatic copy of the document must accompany the original document. GPO 952-236"
}