{
  "anumber": "A19055851",
  "id": "A19055851_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "Australia"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "4 (11) Do you intend to reside permanently in the United States? Yes No If \"No,\" explain: (12) My last place of foreign residence was (City) (Country) Sidney Australia (13) My father's full name is Tleselrazar Wolfson (14) My mother's maiden name was Svamuur, Sarah (15) I came to the United States from the port of (City) (Country) Sidney, Australiz (16) The person in the United States to whom I was coming was N/A (17) The place in United States to which I was going was Las Vegas, Nevada (18) The names of some of the passengers or other persons I traveled with, including members of my own family, and their relationship to me, if any, were N/A READ INSTRUCTION NO. 7 BEFORE ANSWERING QUESTION (19) (19) I do not want certificates of citizenship for only those of my children under age 16 years named below. (Enclose $10 for each (Do) (Do Not) child only if you want certificates, otherwise, send no money with this application.) 5 (Write names of children under age 16 years for whom you want certificates) If present spouse is not the parent of the children named above, give parent's name, date and place of naturalization, and number of marriages applicant. SIGNAT URE OF (APPLICANT ADDRESS: SIGNATURERT Signature declare and that of is this based person D. document preparing GREENBERG all information form, prepared of if which other by I than have DATE: the any I was me at request of ap- plicant on knowledge. ADDRESS AT W HICH APPLICANT RECEIVES MAIL 10717 Wilshire Blvd. Suite 1800 Los Angeles, CA 90024 5670 Wilshire Blvd #1800 5-23-75 APPLICANT'S TELEPHONE NUMBER Los Angeles, CA 90036 (213) 475-6050 TO APPLICANT DO NOT FILL IN BLANKS BELOW THIS LINE. NOTE CAREFULLY. - This application must be sworn to before an officer of the Immigration and Naturalization Service at the time you appear before such officer for examination on this application. AFFIDAVIT I do swear that I know the contents of this application comprising Subscribed and sworn to before me by applicant at the preliminary pages 1 to 4. inclusive, and the supplemental forms thereto, No(s). investigation ( ) at C.A Cr. #4. subscribed to by me; that the same are true to the best of my knowledge and belief; that this 15th corrections numbered ( I ) to ( 19 were made by me or at my June Ze day of 19 I certify that before verification the above applicant stated in my pres- request; and that this application was signed by me with my full, true, ence that be had (heard) read the foregoing application, corrections and correct name SO HELP ME GOD therein the contents thereof. Carles and supplemental form (s) and Mill understood (Complete and true signature of applicant) (Naturalization examiner) Bront to be (For demonstration of applicant's ability to write) (1st witness) makine SKODA Baker Banker. residing at 16728 Rayen. St Sepulueela Occupation (Street address. city or town, and State) (2d witness) Clara sterm residing at 262 N. Crescent (Street Dr. address, city. State) Occupation or town, and U.S. 6-1-71 State 6 mb. 31. Physical presence mos (Naturalization examiner) ARRIVAL RECORD FOUND ARRIVAL RECORDS EXAMINED Place Card index Name Index books Age Manifests Date Marital status Manner (Signature of person making search) Nonfiled (Dates, reasons. and examiner's initials)"
}