{
  "anumber": "A19055851",
  "id": "A19055851_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF APPROVAL OR REVALIDATION OF IMMIGRANT VISA PETITION, A19 055 851"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "ITED STATES DEPARTMENT OF JUNCICE IMMIGRATION AND NATURALIZATION SERVICE NOTICE OF APPROVAL OR REVALIDATION OF IMMIGRANT VISA PETITION NAME OF BENEFICIARY CLASSIFICATION FILE NO. 201 (b) A19 055 851 DATE PETITION FILED George Wolfson April 14, 1969 VALIDITY: Petition approved for relative is valid for duration of relationship to petitioner and status established in petition. If petition is for a person in the professions, arts or sciences, or an employee, the approval is valid to Please note the items below which are indicated by \"X\" marks concerning the visa petition filed by you in behalf of the above beneficiary: YOUR PETITION FOR PREFERENCE CLASSIFICATION, AS SHOWN ABOVE, HAS BEEN APPROVED BY THE SERVICE AND FORWARDED TOTHE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION. THIS SERVICE HAS NOTHING TO DO WITH THE ACTUAL ISSUANCE OF VISAS. VISAS ARE ISSUED ONLY BY A UNITED STATES CONSUL WHO IS UNDER THE JURISDICTION OF THE U.S. DEPARTMENT OF STATE. UNDER THE LAW ONLY A LIMITED NUMBER OF VISAS MAY BE ISSUED BY THAT DEPARTMENT DURING EACH YEAR AND THEY MUST BE ISSUEDSTRICTLY IN THE CHRONOLOGICAL ORDER IN WHICH PETITIONS WERE FILED FOR THE SAME CLASSIFICATION. WHEN THE BENEFICIARY'S TURN IS REACHED ON HEVISA WAITING LIST, THE UNITED STATES CONSUL WILL INFORM HIM AND CONSIDER ISSUANCE OF THE VISA. YOUR PETITION TO CLASSIFY THE BENEFICIARY AS AN IMMEDIATE RELATIVE OF A UNITED STATES CITIZEN HAS BEEN APPROVED AND FOR- WARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION. THE UNITED STATES CONSULATE, WHICH IS UNDER THE SUPERVISION OF THE DEPARTMENT OF STATE, WILL ADVISE THE BENEFICIARY CONCERNING VISA ISSUANCE. THE PETITION HAS BEEN APPROVED. THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TOBECOME A LAWFUL PERMANENT RESIDENT. THE ENCLOSED APPLICATION FOR THIS PURPOSE (FORM 1-485) SHOULD BE COMPLETED AND SUBMITTED BY THE BENEFICIARY IN ACCORDANCE WITH THE INSTRUCTIONS CONTAINED THEREIN. (IF THE BENEFICIARY HAD PREVIOUSLY SUBMITTED FORM I-485 WHICH WAS RETURNED TO HIM, HE SHOULD RESUBMIT THAT FORM.) THE PETITION HAS BEEN APPROVED. THE BENEFICIARY WILL BE INFORMED OF THE DECISION MADE ON HIS PENDING APPLICATION TO BE- COME A LAWFUL PERMANENT RESIDENT (FORM I-485). THE PETITION HAS BEEN APPROVED. THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAWFUL PERMANENT RESIDENT. HOWEVER, AN IMMIGRANT VISA NUMBER IS NOT PRESENTLY AVAILABLE, THEREFORE, THE BENEFICIARY MAY NOT APPLY TO BECOME A PERMANENT RESIDENT. THE PETITION HAS BEEN REVALIDATED AND FORWARDED TO THE UNITED STATES CONSULATE AT WHICH THE BENEFICIARY WILL APPLY FOR A VISA. ANY INQUIRY CONCERNING THE ISSUANCE OF A VISA SHOULD BE DIRECTED TO THE CONSULATE AT THE PETITION HAS BEEN REVALIDATED. NO NOTICE OF REVALIDATION OF THE PETITION HAS BEEN SENT TO A UNITED STATES CONSULATE AS IT HAS BEEN INDICATED THAT THE BENEFICIARY IS APPLYING TO BECOME A LAWFUL PERMANENT RESIDENT. IF YOU BECOME NATURALIZED AS A CITIZEN OF THE UNITED STATES AND AN IMMIGRANT VISA HAS NOT YET BEEN ISSUED TO THE BENE- FICIARY, NOTIFY THIS OFFICE IMMEDIATELY, GIVING THE DATE OF YOUR NATURALIZATION. AT SAME TIME, IF THE PETITION WAS IN BEHALF OF YOUR SON OR DAUGHTER, ALSO ADVISE WHETHER THAT PERSON IS STILL UNMARRIED. THIS INFORMATION MAY EXPEDITE THE ISSUANCE OF A VISA TO THE BENEFICIARY. REMARKS: I-485 will be furnished in the near future. The attached Form I-485 and other forms must be completed by the beneficiary and forwarded to the District Director, Los Angeles, Cal. DOCUMENTS WHICH YOU SUBMITTED IN SUPPORT OF YOUR PETITION HAVE SERVED OUR PURPOSE AND ARE RETURNED. Documents and passports, 7426 & CAll9, So. Africa, have been forwarded to your attorney. MPORTANT IF THE BENEFICIARY WILL APPLY FOR A VISA AT A UNITED STATES CONSULATE ABROAD, IT IS IMPORTANT THAT YOU UNDERSTAND THAT ANY INQUIRY CONCERNING VISA ISSUANCE SHOULD BE ADDRESSED TO THE CONSULATE. THIS SERVICE WILL BE UNABLE TO RESPOND TO ANY INQUIRY CONCERNING VISA ISSUANCE. NAME AND ADDRESS OF PETITIONER VERY TRULY YOURS, Mrs. Meryl Alpert 83-43, 118th Street Kew Gardens, New York 11415 DISTRICT DIRECTOR DATE OF APPROVAL OF PETITION October 11. 1969 CHECK THIS BOX WHEN COPY MAILED TO ATTORNEY OR REPRESENTATIVE Form I-171 (Rev. 10-1-68) FILE COPY"
}