{
  "anumber": "A19055851",
  "id": "A19055851_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION TO FILE PETITION FOR NATURALIZATION, N-4 ( 5-1-73)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1975,
        1971,
        1884,
        1910,
        1876,
        1972,
        1945,
        1934,
        1969,
        1940,
        1883,
        1900
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Form approved IMMIGRATION AND NATURALIZATION SERVICE OMB No. 43-R0079 FEE STAMP APPLICATION TO FILE PETITION FOR NATURALIZATION Mail or take to: IMMIGRATION AND NATURALIZATION SERVICE ALIEN REGISTRATION (Show the exact spelling of your name as it appears on your alien registration (See INSTRUCTIONS. BE SURE YOU UNDERSTAND EACH receipt card, and the number of your card. If you did not register, so state.) Name George Wolfson QUESTION BEFORE YOU ANSWER IT.) No. A19 055 851 Date: May 23, 1975 My name B George Wolfson 2 1005. Doheny #30mg type here your present full name only) live at: 10717 Wilshire Blvd- 3 (Print or type present apartment number, street address, and if appropriate \"in care of ) Los Angeles, California 90048. (State) (ZIP Code) Suppthy. Application to File Petition for Naturalization RE: Wolfson, George #la on page 1 Tleselrazar (Mrs. Wolfson born in Rumania on April 5, 1883 and Sarah George Wolfson) born in Br. India on April 21, 1884 are the Svamuur, 1940 and Wolfson. They became naturalizaed citizens approximately parents between of information is known about their naturalization. 1945. Since both Mr. & Mrs. Wolfson are deceased no further (d) July 1900 (3) What were the names, addresses, and occupations (or types of business) of your employers during the last 5 years? (If none, write \"None.\") List present employment FIRST. FROM- To- EMPLOYER'S NAME ADDRESS OCCUPATION OR TYPE OF BUSINESS (a) 4 19 75 PRESENT TIME Renee of Beverly Domestic Beverly Hills, CA Counselor 1 10 75 3 1975 Bernard Greeff Santa Barbara Butler (a) 3 1972 9 1972 Mr. Nutten 718 Crescent Dr; Bev Hils, CA-Butler (b) 7 19 71 3 19 72 B.D. Kelgs Rancho Sta Fe Madreselva CA-Butler (c) 6 1971 7 19 71 J. P. Langley 635 Park Ave N.Y. NY Butler (d) 3 1876 3 1969 10 19 1910 71 Barhara Weinburg Drur Lane & LA CA Butler Moss (4) Have you been out of the United States since you first arrived? 312 Faring Rd; LA, CA er Yes No If \"Yes\" fill in the following information for every absence of less than 6 months, no matter how short it was. NAME OF SHIP, OR OF AIRLINE, RAILROAD COMPANY. Bus DATE DEPARTED DATE RETURNED COMPANY, OR OTHER MEANS USED TO RETURN TO THE PLACE OR PORT OF ENTRY THROUGH WHICH You UNITED STATES (5) How many times have you been married? 2.. How many times has your husband or wife been married? I If either of you has been married more than once, fill in the following information for each previous marriage. Check one) How MARRIAGE DATE MARRIED DATE MARRIAGE ENDED NAME OF PERSON TO WHOM MARRIED SEX PERSON MARRIED WAS CITIZEN ENDED ALIEN (a) Jan. 1934 June 22, 1949 Rebecca James F Divorce (b) (c) (d) Form N-400 (Rev. 5-1-73)N (1) (OVER)"
}