{
  "anumber": "A19055851",
  "id": "A19055851_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "years": {
      "ms_years_nlp_v1": [
        1925
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "INSTRUCTIONS To request allocation of a visa number for the preference or nonpreference case under Section 245 com- plete form in triplicate and mail original and one copy to Visa Control Office. In other cases where out- standing instructions require the form to be forwarded to the Visa Control Office, it shall be prepared in duplicate and the original placed in the file. When grant of permanent residence becomes final, the file copy shall be appropriately endorsed. In cases where permanent residence is granted without referral to the Visa Control Office, except where Selective Service is to be notified, only an original I-181 need be prepared and placed in the file. In addition to the above copies, a copy of Form I-181, noted to show the date permanent residence status is granted, shall be forwarded to the State Director of Selective Service in the case of every male alien born on or after September 15, 1925, and who has reached 18 years of age. PREFERENCE: Under Section 245, the priority date will be the filing date of the petition. NON-PREFERENCE: Under Section 245, the priority date shall be fixed by the following factors, whichever is the earliest; (1) the priority date accorded the applicant by the consular officer as a non- preference immigrant; (2) the date on which application Form I-485 is filed, if the applicant establishes that the provisions of section 212(a) (14) of the Act do not apply tohim or that heis a qualified member of an occupation within Schedule A, 29 CFR 60; or (3) the date of issuance of an individual certification by the Secretary of Labor pursuant to section 212(a) (14) of the Act, if such individual certification is required. Check and complete the block re certifications on the form as appropriate in a nonpreference case. REMARKS: If the visa number requested is based on Section 202(b)(1), (2), (3), or (4), or Section 203(a)(9) of the Act explain as appropriate in 'Remarks' block.\""
}