{
  "anumber": "A19055851",
  "id": "A19055851_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR A SEARCH OF THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "Canada",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "for the APPLICATION convenuence FOR A SEARCH OF the government Form Budget please approved. Bureau No. 43-R0104 THE RECORDS OF THE IMMIGRATION AND NATURALIZATION SERVICE Fee Stamp (See instructions on reverse) Take or mail to- IMMIGRATION AND NATURALIZATION SERVICE It is requested that: Place \"X\" in applicable box(es) (Fill in with typewriter or print in block letters in ink) Information be furnished regarding the person described below. There be furnished copies of the record described below. (Number) The record described below be made available for inspection. 1. SPECIFIC INFORMATION OR RECORD DESIRED: 2. PURPOSE FOR WHICH DESIRED: what the date of lurth is Y when recorded SOCIAL SECURITY BENEFITS OTHER (Explain fully) for The Gonvemereey government. the 3. THE INFORMATION SHOULD BE IN THE FORM OF (letter, exact copy, or certified copy) letter or DATA FOR IDENTIFICATION OF THE RECORD entitied Copy 4. FAMILY NAME GIVEN NAME MIDDLE NAME 5. ALIEN REGISTRATION NUMBER WOLFSON GEORGE A-19055851 6. OTHER NAMES USED IF ANY 7. NAME USED/A TIME OF ENTRY George 9. DATE OF BIRTH 8. PLACE OF BIRTH Walfson British W.India ( Pakistan) 12-11-09. 10. PORT OF ENTRY 11. PORT ABROAD FROM WHICH LEFT FOR UNITED 12. DATE OF ENTRY 13. NAME OF Jos Angeles VESSEL OR OTHER MEANS OF ENTRY Ca. Loronto STATES Canada 1231-65 airplane (not remember name) GIVE THE FOLLOWING INFORMATION IF THE PERSON WAS NATURALIZED 14. NAME ON NATURALIZATION CERTIFICATE 15. CERTIFICATE NUMBER 16. NATURALIZATION DATE 17. ADDRESS AT TIME OF NATURALIZATION 18. NAME AND LOCATION OF NATURALIZATION COURT 19. SEND INFORMATION TO ADDRESS: NUMBER, STREET, CITY, STATE, AND ZIP, CODE Cerd 4475 I consentito the furnishing of the above information 5/29/75 gay NAME reverse) (see Instruction 2 on NAME OF PERSON REQUESTING INFORMATION Social Recente admin ADDRESS: NUMBER, STREET, CITY, STATE, AND ZIP CODE ADDRESS: NUMBER, STREET CITY, STATE AND ZIP CODE 10717 Wilshne Bhd 7204 F2 1514 th Xt moneed Santa DATE: pa 90024 DATE: 2/08/25 90406 #176 Form N-585 (Rev. 10-13-67) UNITED STATES DEPARTMENT OF JUSTICE-Immigration and Naturalization Service"
}