{
  "anumber": "A19055851",
  "id": "A19055851_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19055851_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization, 3732205"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Pakistan",
        "United States",
        "South Africa",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1970,
        1909,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT JUSTICE IMMIGRATION AND NATURALIZA SERVICE DUPLICATE UNITED STATES OF AMERICA (To accompany monthly report on PETITION FOR NATURALIZATION No. 373205 Form N-4) To the Honorable P.S. District Court, Los Angeles, Calife The Court of at This petition for naturalization, hereby made and filed under section 316a Immigration and Nationality Act, respectfully shows: (1) My full, true, and correct name is George Wolfson 100 (Full. true name S. Doheny 303 (2) My present place of residence is 1071 Willshire Blvd. Los Angeles, (Apt. No.) (Number and street) Les Angeles California (City 20048 (County) (State) (ZIP Code) (3) I was born on December 11, 1909 in Karachi (City or town) Pakistan India (County. district. province. or State) (Country (4) I am x married, and have 2 living children. (5) I was lawfully admitted to permanent on the United States for residence May 25, 1970 19 and have not abandoned such residence. (6) My present nationality is South Africa ALIEN REGISTRATION NO. A19 055 851 reh (7) I have not heretofore made a petition for naturalization. (8) I pray that my name be changed to Geor Fredrick Wolfson (continued over) AFFIDAVIT OF WITNESSES The following witnesses, each being severally, duly, and respectively sworn, depose and say: (1) My name is Maxine Skoda I reside at 16728 Rayen Street, Sepulveda, California and (Number and street) (City or town) (State) (2) My name is Clara Stern I reside at 262 Nor Crescent Drive, Beverly Hills, California (Number and street) (City or town) (State) I am a citizen of the United States of America; I have personally known and have been acquainted in the United States with the petitioner named in the petition for naturalization of which this affidavit is a part, since at least 6/1/71 ; to my personal knowledge, based upon (Month) (Day) (Year) frequent observations and personal contacts with the petitioner within the State(s) of residence of the petitioner since said date, the petitioner has resided, imme- diately preceding the date of filing this petition, in the United States continuously since the date last mentioned; that the petitioner has been physically present in the United States for at least 33 months of that period; and that petitioner has been a resident in the State in which the petition is filed during at least the last 6 months. I have personal knowledge that the petitioner is, and during all such periods has been a person of good moral character, attached to the principles of the Constitution of the United States, and well disposed to the good order and happiness of the United States, and in my opinion the petitioner is in every way quali- fied to be admitted a citizen of the United States. I do swear (affirm) that the statements of fact I have made in the affidavit to this petition for naturalization subscribed by me are true to the best of my knowledge and belief: so HELP ME GOD. clara Stern (Signature of Witness) (Signature of Witness) WHEN OATH ADMINISTERED BY CLERK OR DEPUTY WHEN OATH ADMINISTERED BY DESIGNATED EXAMINER CLERK OF COURT Subscribed and sworn to (affirmed) before me by above-named peti- Subscribed and sworn to (affirmed) before me by above-named peti- tioner and witnesses in the respective forms of oath shownin said petition tioner and witnesses in the respective forms of oath shown in said petition and affidavit, and filed by said petitioner. in the office of the clerk of said and affidavit at SEAL this court at Flos Angeless day of A.D. 19 OF THE California this 15th day of June A.D. 19 76 U. S. DISTRICT CO Designated Examiner. I HEREBY CERTIFY That the foregoing petition for naturalization was by By JUN15 1976 petitioner named herein filed in the office of the clerk of said court Clerk at this day of Deputy Clerk. OF CENTRAL DISTRICT OF CALIFORNIA CLERK, U. S. DISTRICT COURT A.D. 19 CALIFORNIA (REAL] Road Clerk. By Form N-405 (Rev. 7-1-70) DEPUTY Deputy Clerk. STATISTICS"
}