{
  "anumber": "A19529822",
  "id": "A19529822_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U ED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 20 West Broadway New York, New York 10007 NAME OF BENEFICIARY NAME AND ADDRESS OF APPLICANT/PETITIONER Durupadi J. Wadhwani Durupadi Jagatrai Wadhwani DATE 97- 11 Horace Harding Expwy August 24, 1972 Lafrak City, New York 11368 FILE NO. A19 529 822 AFTER REVIEW IT HAS BEEN FOUND THAT YOUR APPLICATION/PETITION CANNOT BE ADJUDICATED WITH- OUT ADDITIONAL DOCUMENTS AND/OR INFORMATION. PLEASE COMPLY WITH THE BELOW CHECKED INSTRUCTIONS 1. The above application/petition and its supporting documents are attached. After complying with the indicated instructions, please resubmit the fully documented application/petition to this office. 2. Please complete the blocks on your enclosed application/petition which are checked in red. 3. Furnish the required fee of $ 4. Furnish the birth or baptismal certificate of 5. Furnish the marriage certificate of 6. Furnish proof of death or legal termination of marriage of 7. All foreign language documents must be accompanied by English translations thereof, including certification as to accuracy of translation and competency of translator. 8. Furnish the date and port of each of your entries into the United States and the name of the ship, plane, or other vehicle on which you traveled. 9. Complete Form MA 7-50A. 10. Furnish evidence of your qualifications in accordance with attached instructions for completion of Form MA 7-50A. 11. Your petition to confer preference under section 203(a)(6) of the Immigration and Nationality Act cannot be accepted unless accompanied by a certification from the Secretary of Labor or his designated representative. To apply for the certification, attached Forms MA 7-50 (A and B), and the evidence of the alien's qualifications must be filed in the local state employment service office. The Forms MA 7-50A and B and the evidence will be returned to you, with the certification stamped on the form if a certification is issued. You may then file the petition at this office, at- taching all papers and documents returned to you by the Department of Labor. 12. Submit to your (prospective) employer, completed Form MA 7-50A and evidence of your qualifications. Request your (prospective) employer to complete Form MA 7-50B, and to submit the Forms MA 7-50A and B and evidence of your qualifications to the local state employment service office. If the Labor Department issues a certification, your employer should return to you the evidence of your qualifications and Forms MA 7-50A and B with the certification stamped on Form MA 7-50, for submission with your application. (Forms MA 7-50 A and B with instructions are attached.) 13. You have indicated that you do not intend to seek employment. You must furnish evidence that you have sufficient funds or other means of maintaining yourself in this country. 14. Furnish two photographs, 1 1/2\" x 1 1/2\" with distance from top of head to point of chin 1 1/4\". Machine-made photos not acceptable. 15. Resubmit your application with an approved visa petition in your behalf. Also complete form G-325A where checked in red(Five years employment is require and return. LP Form I-72 RETURN THIS LETTER AND ALL ATTACHMENTS WITH (Rev. 6-1-70) Y YOUR RESPONSE GPO 887.737"
}