{
  "anumber": "A19529822",
  "id": "A19529822_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Continued on back, N-4 ( Rev 07/19)N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1978,
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 Continued on back Part 7. Additional eligibility factors. Please answer each of the following questions. If your answer IS \"Yes\", explain on a separate paper. 1. Are you now, or have you ever been a member of, or in any way connected or associated with the Communist Party, or ever knowingly aided or supported the Communist Party directly, or indirectly through another organization, group or person, or ever advocated, taught, believed in, or knowingly supported or furthered the interests of communism? Yes No 2. During the period March 23, 1933 to May 8, 1945, did you serve in, or were you in any way affiliated with, either directly or indirectly, any military unit, paramilitary unit, police unit, self-delense unit, vigilante unit, citizen unit of the Nazi party or SS, government agency or office, extermination camp, concentration camp, prisoner of war camp, prison, labor camp, detention camp or transit camp, under the control or affiliated with: a. The Nazi Government of Germany? Yes No b. Any government in any area occupied by, allied with, or established with the assistance or cooperation of, the Nazi Government of Germany? Yes No 3. Have you at any time, anywhere, ever ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion? Yes No 4. Have you ever left the United States to avoid being drafted into the U.S. Armed Forces? Yes No 5. Have you ever failed to comply with Selective Service laws? Yes No If you have registered under the Selective Service laws, complete the following information: Selective Service Number: Date Registered: If you registered before 1978, also provide the following: Local Board Number: Classification: 6. Did you ever apply for exemption from military service because of alienage, conscientious objections or other reasons? Yes No 7. Have you ever deserted from the military, air or naval forces of the United States? Yes No 8. Since becoming a permanent resident have you ever failed to file a federal income tax return ? Yes No 9. Since becoming a permanent resident have you filed a federal income tax return as a nonresident or failed to file a federal return because you considered yourself to be a nonresident? Yes No 10 Are deportation proceedings pending against you, or have you ever been deported, or ordered deported, or have you ever applied for suspension of deportation? Yes No 11. Have you ever claimed in writing, or in any way, to be a United States citizen? Yes No 12. Have you ever: a. been a habitual drunkard? Yes No b. advocated or practiced polygamy? Yes No C. been a prostitute or procured anyone for prostitution? Yes No d. knowingly and for gain helped any alien to enter the U.S. illegally? Yes NO e. been an illicit trafficker in narcotic drugs or marijuana? Yes No f. received income from illegal gambling? Yes No g. given false testimony for the purpose of obtaining any immigration benefit? Yes No 13. Have you ever been declared legally incompetent or have you ever been confined as a patient in a mental institution? Yes No 14. Were you born with, or have you acquired in same way, any title or order of nobility in any foreign State? Yes No 15. Have you ever: a. knowingly committed any crime for which you have not been arrested? Yes No b. been arrested, cited, charged, indicted, convicted, fined or imprisoned for breaking or violating any law or ordinance excluding traffic regulations? Yes No ( If you answer yes to 15 in your explanation give the following information for each incident or occurrence the city, state, and country, where the offense took place, the date and nature of the offense, and the outcome or disposition of the case). Part 8. Allegiance to the U.S. If your answer to any of the following questions is \"NO\", attach a full explanation: 1. Do you believe in the Constitution and form of government of the U.S.? Yes No 2. Are you willing to take the full Oath of Allegiance to the U.S.? (see instructions) Yes No 3. If the law requires it, are you willing to bear arms on behalf of the U.S.? Yes No 4. If the law requires it, are you willing to perform noncombatant services in the Armed Forces of the U.S.? Yes No 5. If the law requires it, are you willing to perform work of national importance under civilian direction? Yes No Continued on back Form N-400 (Rev 07/17/91)N"
}