{
  "anumber": "A19529822",
  "id": "A19529822_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 9. Memberships and organizations."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 Part 9. Memberships and organizations. A. List your present and past membership in or affiliation with every organization, association, fund, foundation party, club, society, or similar group in the United States or in any other place. Include any military service in this part. If none, write \"none\". Include the name of organization, location, dates of membership and the nature of the organization. If additional space IS needed, use separate paper. NONE Part 10. Complete only if you checked block \" C\" in Part 2. How many of your parents are U.S. citizens? One Both (Give the following about one U.S. citizen parent:) Family Given Middle Name Name Name Address N/A Basis for citizenship: Relationship to you (check one): natural parent adoptive parent Birth parent of child legitimated after birth Naturalization Cert. No. If adopted or legitimated after birth, give date of adoption or, legitimation: (month.day.year) Does this parent have legal custody of you? Yes No (Attach a copy of relating evidence to establish that you are the child of this U.S. citizen and evidence of this parent's citizenship.) Part 11. Signature. (Read the information on penalties in the instructions before completing this section). I certify or, if outside the United States, I swear or affirm, under penalty of perjury under the laws of the United States of America that this application, and the evidence submitted with it, IS all true and correct. I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit I am seeking. Signature Date DURUPADI 2/19/97 Please Note: If you do not completely fill out this form, or fail to submit required documents listed in the instructions. you may not be found eligible for naturalization and this application may be denied Part 12. Signature of person preparing form if other than above. (Sign below) I declare that I prepared this application at the request of the above person and it is based on all information of which I have knowledge. Print Your Name Date Signature Hill JWadhwon HARISH J. WADHWANI 2/19/97 Firm Name REPRESENTING SELF and Address 57 MANGER ROAD, CEDAR KNOLLS NJ 07927 DO NOT COMPLETE THE FOLLOWING UNTIL INSTRUCTED TO DO so AT THE INTERVIEW I swear that I know the contents of this application, and supplemental Subscribed and sworn to before me by the applicant. pages 1 through , that the corrections numbered 1 through were made at my request, and that this amended application, is true to the best of my knowledge and belief. (Examiner's Signature ) Date (Complete and true signature of applicant) Form -100 (Rev 07:17'91)N *U.S. Government Printing Office: 1996 - 405-024/34022"
}