{
  "anumber": "A19529822",
  "id": "A19529822_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEDICAL Examination and Immigration Interview, FORM 1-486 A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE A19 529 822 (245) FILE NO.: be 20 WEST BROADWAY NEW YORK, N. Y. 10007 DATE: October 19, 1972 MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW Durupadi J. Wadhwni 97-11 Horace Harding Expwy. Apt. 18-K Lefrak, City, New York 11368 INSTRUCTIONS FOR MEDICAL EXAMINATION A MEDICAL EXAMINATION IS NECESSARY AS PART OF YOUR APPLICATION FOR ADJUSTMENT OF STATUS TO THAT OF A PER. MANENT RESIDENT. WHEN YOU APPEAR FOR THE MEDICAL EXAMINATION BRING WITH YOU THIS LETTER, THE TWO ATTACHED COPIES, AND THE FOLLOWING: 1. X-RAY FILM (14\" x 17\") OF YOUR CHEST, UNLESS YOU ARE UNDER 11 YEARS OF AGE, AND A REPORT BY A LICENSED PHYSICIAN INTERPRETING IT. FILM MUST NOT BE MORE THAN 30 DAYS OLD. 2. SEROLOGY REPORT, UNLESS YOU ARE UNDER 15 YEARS OF AGE. SEROLOGIC TEST FOR SYPHILIS MUST NOT BE MORE THAN 30 DAYS OLD. THIS X-RAY AND TEST MUST BE ACCOMPLISHED BY A LICENSED PHYSICIAN OR A STATE OR LOCAL HEALTH DEPARTMENT APPROVED LABORATORY. IF YOU DO NOT HAVE A PERSONAL PHYSICIAN, YOU MAY WISH TO TELEPHONE YOUR STATE OR LOCAL HEALTH DEPARTMENT FOR THE NAME OF AN APPROVED LABORATORY THAT MAY BE ABLE TO PERFORM THE X-RAY AND TEST REQUIRED. PLEASE NOTE THE BOX CHECKED BELOW WITH REGARD TO YOUR MEDICAL EXAMINATION. AN APPOINTMENT HAS BEEN MADE FOR YOU TO BE EXAMINED BY A PHYSICIAN OF THE U.S. PUBLIC HEALTH SERVICE AT: USPHS Outpatient Clinic ADDRESS: November 1, 1972 245 West Houston Street DATE: Between New York, New York 10014 TIME: 8:00 AND 10:00 AM PLEASE ARRANGE FOR YOUR MEDICAL EXAMINATION WITH THE BELOW LISTED PHYSICIAN AT THE ADDRESS SHOWN. THE EXAMINATION SHOULD BE COMPLETED BEFORE PHYSICIAN'S NAME AND ADDRESS: PLEASE SHOW THE COPIES OF THIS LETTER TO YOUR PHYSICIAN (OR LABORATORY) PERFORMING THE EXAMINATION AND FURNISH HIM WITH YOUR SIGNATURE, WRITTEN IN HIS PRESENCE FOR INCLUSION WITH HIS REPORT. TO PHYSICIAN PERFORMING THE EXAMINATION PLEASE OBTAIN THE APPLICANT'S SIGNATURE IN THE SPACE PROVIDED AND MEDICALLY EXAMINE HIM FOR ELIGIBILITY FOR ADJUSTMENT OF STATUS. IF THE APPLICANT IS FREE OF MEDICAL DEFECTS LISTED IN SECTION 212 (A) OF THE IMMIGRATION AND NATIONALITY ACT, ENDORSE THIS COPY OF FORM 1-486A IN THE SPACE PROVIDED AND HAND IT TO THE APPLICANT IN A SEALED ENVELOPE FOR PRESENTATION AT HIS IMMIGRATION INTERVIEW. IF THE APPLICANT IS NOT FREE OF SUCH MEDICAL DEFECTS. DO NOT SIGN THIS FORM; INSTEAD WRITE \"SEE FS-398\" IN THE PHYSICIAN'S SIGNATURE BLOCK AND PREPARE MEDICAL CERTIFICATE ON FORM FS-398 AND HAND IT TO THE APPLICANT IN A SEALED ENVELOPE TOGETHER WITH THIS COPY OF FORM 1-486A FOR PRESENTATION AT HIS IMMIGRATION INTERVIEW. (IF EXAMINATION IS CONDUCTED BY A CIVIL SURGEON, INSERT IN ENVELOPE BOTH COPIES OF FORM 1-486A; X-RAYS AND LABORATORY REPORTS; AND TWO COPIES OF FORM FS-398 IF APPLICANT IS NOT FREE OF MEDICAL DEFECTS.) DISTRICT DIRECTOR I CERTIFY THAT THE ATTACHED X-RAY AND SEROLOGY REPORT, (BLOOD TEST) RELATE TO ME. SIGNATURE OF APPLICANT: pnyupad PENALTY: THE LAW PROVIDES SEVERE PENALTIES FOR KNOWINGLY ANDWILFULLY FALSIFYING OR CONCEALING X A MATERIAL FACT OR USING ANY FALSE DOCUMENTS IN CONNECTION WITH THIS APPLICATION. MY EXAMINATI ON INCLUDING X-RAY, BLOOD SEROLOGICAL AND OTHER REPORTS, WHEN NEEDED, SHOW THE APPLICANT TO BE FREE OF ANY DEFECTS, DISEASES OF DISABILITIES LISTED IN SECTION 212(A) OF THE IMMIGRATION AND NATIONALITY ACT AS AMENDED SIGNATURE OF PHYSICIAN TITLE m newton DATE 11-1-72 FORM I-486 A (REV. 9-1-71) Y"
}