{
  "anumber": "A19529822",
  "id": "A19529822_0068",
  "page_index": 68,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0068/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF APPROVAL OR REVALIDATION OF IMMIGRANT VISA PETITION, Form I-171"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1972
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 FILES: FOIA (b) (6) A20 222 862 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SEI FOIA (b)(6) Pittsburgh, Penna. 15222 June 19, 1972 NOTICE OF APPROVAL OR REVALIDATION OF IMMIGRANT VISA PETITION NAME AND ADDRESS OF PETITIONER NAME OF BENEFICIARY Mr. Bhagwan J. Wadwani *See Remarks Below MAIL TO: 203 Skyline Drive CLAS:201 Nation FILE NO California, Penna. 15419 Secs. .203(a)(5) DATE PETITION FILED DATE OF APPROVAL OF TITION May 11, 1972 June 7, 1972 VA Petition approved for relative is valid for duration of relationship to petitioner and status estab- person. If petition is for a person in the professions, arts or sciences, or an employee, the approval Please the ems below which are indicated by \"X\" marks concerning the visa petition filed by you in behalf of the above beneficiary 1. YOUR PETITION TO CLASSIFY THE BENEFICIARY AS AN IMMEDIATE RELATIVE OF A UNITED STATES CITIZEN HAS BEEN APPROVED AND FORWARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETI- TION. THE UNITED STATES CONSULATE, WHICH IS UNDER THE SUPERVISION OF THE DEPARTMENT OF STATE. WILL ADVISE THE BENEFICIARY CON- CERNING VISA ISSUANCE Inquiry concerning visa issuance should be addressed to the Consul. This Service will be unable to answer any inquiry concerning visa issuance 2. IF YOU BECOME NATURALIZED AS A CITIZEN OF THE UNITED STATES AND AN IMMIGRANT VISA HAS NOT YET BEEN ISSUED TO THE BENEFICIARY NOTIFY THIS OFFICE IMMEDIATELY GIVING THE DATE OF YOUR NATURALIZATION AT THE SAME TIME. IF THE PETITION WAS IN BEHALF OF YOUR SON OR TAUCHTER ALSO ADVISE WHETHER THAT PERSON is STILL UNMARRIED THIS INFORMATION MAY EXPEDITE THE ISSUANCE OF A VISA TO THE BEACHILLARY 3. YOUR PETERS FOR PREFERENCE CLASSIFICATION AS SHOWN ABOVE. HAS BEEN APPROVED BY THE SERVICE AND FORWARDED TO THE UNITED STATES CONSULATE AT THIS COMPLETES ALL ACTION BY THIS SERVICE ON THE PETITION THIS s RVIC HAS NORHING TO DO WITH THE ACTUAL ISSUANCE OF VISAS VISAS ARE ISSUED ONLY BY UNITED STATES CONSULS WHO ARE UNDER THE SOUTON OF THE U.S. DEPARTMENT OF STATE UNDER THE LAW ONLY A LIMITED NUMBER OF VISAS MAY BE ISSUED BY THAT DEPARTMENT DURIN EAC YEAR AND THEY MUST BE ISSUED STRICTLY IN THE CHRONOLOGICAL ORDER IN WHICH PETITIONS WERE FILED FOR THE SAME CLAS- SIFIC. WHEN THE BENEFICIARY'S TURN IS REACHED ON THE VISA WAITING LIST. THE UNITED STATES CONSUL WILL INFORM HIM AND CON- SIDER SSUANCE OF THE VISA Inguir concerning visa issuance should be addressed to the Consul. This Service will be unable to answer any inquiry con- cerning to issuance. THE PETITION HAS BEEN APPROVED THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAW- FUL PERMANENT RESIDENT THE ENCLOSED APPLICATION FOR THIS PURPOSE (FORM 1-485) SHOULD BE COMPLETED AND SUBMITTED BY THE BENEFICIARY IN ACCORDANC WITH THE INSTRUCTIONS CONTAINED THEREIN (IF THE BENEFICIARY HAD PREVIOUSLY SUBMITTED FORM 1-485 WHICH WAS RETURNED HIM. HE SHOULD RESUBMIT THAT FORM.) 5. THE PETITION HAS BEEN APPROVED THE BENEFICIARY WILL BE INFORMED OF THE DECISION MADE ON HIS PENDING APPLICATION TO BECOME ALAWFUL PERMANENT RESIDENT (FORM 1-485). 6. THE PETITION HAS BEEN APPROVED THE PETITION STATES THAT THE BENEFICIARY IS IN THE UNITED STATES AND WILL APPLY TO BECOME A LAW- FUL PERMANENT RESIDENT. HOWEVER AN IMMIGRANT VISA NUMBER IS NOT PRESENTLY AVAILABLE. THEREFORE. THE BENEFICIARY MAY NOT APPLY TO BECOME A PERMANENT RESIDENT 7. THE PENTION HAS BEEN APPROVED TOWEVER. SINCE THE BENEFICIARY IS A NATIVE OF THE WESTERN HEMISPHERE. HE IS INELIGIBLE TO BE- COME ALAWFUL PERMANENT RESIDE OTHER THAN BY DEPARTING FROM THE UNITED STATES AND REENTERING IN POSSESSION OF AN IMMI- GRANT VISA ISSUED BY AN AMERICAN CONSUL 8. THE PETITION HAS BEEN EVALIDATED AND FORWARDED TO THE UNITED STATES CONSULATE AT WHICH THE BENEFICIARY WILL APPLY FOR A VISA. ANY INQUIRY CONCERN ISSUANCE OF A VISA SHOULD BE DIRECTED TO THE CONSULATE AT This Service be unable any inquiry concerning visa issuance. 9. THE PETITION AS BEEN REVALIDATED NO NOTICE OF REVALIDATION OF THE PETITION HAS BEEN SENT TO A UNITED STATES CONSULATE AS IT HAS BEEN IND ATED THAT THE BENEFICIARY is APPLYING TO BECOME A LAWFUL PERMANENT RESIDENT Harish J. Wadhwani-brother Usha J. Wadhwani-sister 10. REMARKS Durupadi J. Wadhwani-mother Saraswati J. Wadhwani-sister Jagatrai M. Wadhwani-father Gobind J. Wadhwani-brother 11) X DOCUMENTS WHICH YOU SUBMITTED IN SUPPORT OF YOUR PETITION HAVE SERVED OUR PURPOSE AND ARE RETURNED RAYMOND VERY YOURS- A. MORRIS Form 1-171 (Rev. 11-3-69) Officer in Charge"
}