{
  "anumber": "A19529822",
  "id": "A19529822_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Processing Information., 1111-0009, 20503."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 Processing Information. superior to those arising from any human relation, but Rejection. Any application that is not signed or is not does not include essentially political, sociological, or accompanied by the proper fee will be rejected with a philosophical views or merely a personal moral code. notice that the application is deficient. You may correct the deficiency and resubmit the application. However, an Oath ceremony. You may choose to have the oath of application is not considered properly filed until it is allegiance administered in a ceremony conducted by the accepted by the Service. Service or request to be scheduled for an oath ceremony in a court that has jurisdiction over the applicant's place of Requests for more information. We may request more residence. At the time of your examination you will be information or evidence. We may also request that you asked to elect either form of ceremony. You will become submit the originals of any copy. We will return these a citizen on the date of the oath ceremony and the originals when they are no longer required. Attorney General will issue a Certificate of Naturalization as evidence of United States citizenship. Interview. After you file your application, you will be notified to appear at a Service office to be examined under If you wish to change your name as part of the oath or affirmation. This interview may not be waived. If naturalization process, you will have to take the oath in you are an adult, you must show that you have a court. knowledge and understanding of the history, principles, and form of government of the United States. There is no Penalties. exemption from this requirement. If you knowingly and willfully falsify or conceal a material fact or submit a false document with this request, we will You will also be examined on your ability to read, write, deny the benefit you are filing for, and may deny any other and speak English. If on the date of your examination you immigration benefit. In addition, you will face severe are more than 50 years of age and have been a lawful penalties provided by law, and may be subject to criminal permanent resident for 20 years or more, or you are 55 prosecution. years of age and have been a lawful permanent resident for at least 15 years, you will be exempt from the English Privacy Act Notice. language requirements of the law. If you are exempt, you We ask for the information on this form, and associated may take the examination in any language you wish. evidence, to determine if you have established eligibility for the immigration benefit you are filing for. Our legal Oath of Allegiance. If your application is approved, you right to ask for this information is in 8 USC 1439, 1440, will be required to take the following oath of allegiance to 1443, 1445, 1446, and 1452. We may provide this the United States in order to become a citizen: information to other government agencies. Failure to provide this information, and any requested evidence, may \"I hereby declare, on oath, that / absolutely and entirely delay a final decision or result in denial of your request. renounce and abjure all allegiance and fidelity to any foreign prince, potentate, state or sovereignty, of whom or Paperwork Reduction Act Notice. which / have heretofore been a subject or citizen; that / We try to create forms and instructions that are accurate, will support and defend the Constitution and laws of the can be easily understood, and which impose the least United States of America against all enemies, foreign and possible burden on you to provide us with information. domestic; that / will bear true faith and allegiance to the Often this is difficult because some immigration laws are same; that / will bear arms on behalf of the United States very complex. Accordingly, the reporting burden for this when required by the law; that / will perform collection of information is computed as follows: (1) noncombatant service in the armed forces of the United learning about the law and form, 20 minutes; (2) States when required by the law; that / will perform work completing the form, 25 minutes; and (3) assembling and of national importance under civilian direction when filing the application (includes statutory required interview required by the law; and that / take this obligation freely and travel time, after filing of application), 3 hours and 35 without any mental reservation or purpose of evasion; so minutes, for an estimated average of 4 hours and 20 help me God.\" minutes per response. If you have comments regarding the accuracy of this estimate, or suggestions for making If you cannot promise to bear arms or perform this form simpler, you can write to both the Immigration noncombatant service because of religious training and and Naturalization Service, 425 I Street, N.W., Room belief, you may omit those statements when taking the 5304, Washington, D.C. 20536; and the Office of oath. \"Religious training and belief\" means a person's Management and Budget, Paperwork Reduction Project, belief in relation to a Supreme Being involving duties OMB No. 1115-0009, Washington, D.C. 20503. For sale by the U.S. Government Printing Office Superintendent of Documents, Mail Stop: SSOP, Washington, DC 20402-9328"
}