{
  "anumber": "A19529822",
  "id": "A19529822_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "IMMIGRATION AND NATURALIZATION SERVICE APPLICATION FOR AGRICULTURAL EMPLOYMENT, I-458A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "Cuba",
        "Mexico",
        "Dominican Republic",
        "Haiti",
        "Netherlands",
        "United States",
        "Bahamas",
        "Barbados",
        "Bermuda",
        "Jamaica"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1966,
        1948,
        2023,
        1924,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 landlord's present address and the beginning and termination dates of your relative classification, and you are not a member of one of the classes of \"special residence at the particular premises; marriage certificate of present and any immigrants\" listed in section 101(a)(27) of the Immigration and Nationality Act, as previous marriages, and documents showing how many previous marriages were amended. (The classes of \"special immigrants\" include certain former citizens of the terminated; bills, letters or receipts from your gas, electric, water or telephone United States; certain ministers of religious denominations, and certain employees or company showing the dates during which you received service from it. honorably retired former employees of the United States Government abroad.) NOTE: Women unemployed since marriage and unable to furnish evidence If you are a nonpreference alien who has checked box \"D\" in item 1 of this in their own names may furnish evidence in the names of their parents or other application, and you are performing or seek to perform skilled or unskilled labor, you persons with whom they have been living if affidavits of the parents or other are subject to the requirement contained in section 212(a)(14) of the Immigration persons are submitted attesting to residence with them. If any of the and Nationality Act, as amended, of obtaining a certification from the Secretary of documents are lengthy or bulky, only the pertinent parts should be attached. Labor that there are not sufficient workers in the United States who are able, willing, (2) Affidavits of creditable witnesses, preferably citizens of the United qualified, and available to perform such skilled or unskilled labor, and your States, who have personal knowledge of and can vouch for the continuity of employment will not adversely affect the wages and working conditions of workers in your residence in the United States. Where practicable, such affidavits shall be the United States similarly employed. executed on Form I-488 (Affidavit of Witness). it you are a nonpreference alien performing or seeking to perform work in a NOTE: If entry occurred prior to July 1, 1924, a record of lawful category of employment for which the Secretary of Labor has determined that he admission may be created as of the date of such entry. Therefore, if you have cannot now issue a certification (as listed in Schedule B, Part 60, Title 29, Code of resided continuously in the United States since a date prior to July 1, 1924, it Federal Regulations), you are considered ineligible for adjustment of your status is very important to furnish evidence establishing that fact. under section 245 of the Immigration and Nationality Act, as amended. To apply for the Secretary of Labor's certification, you must follow this 6. INTERVIEW.-Whe you are requested to appear for interview you will be procedure: required to bring with you your temporary entry permit (Form I-94, ARRIVAL (a) Submit Form MA 7-5UA with this application if you are a member of a DEPARTURE RECORD), and your PASSPORT. profession for which the Secretary of Labor does not require a job offer or a person with exceptional ability in the sciences or arts: or if you are qualified and 7. INELIGIBILITY. You are ineligible for status as a permanent resident if you will be employed in an occupation currently listed by the Secretary of Labor on checked box \"A\" or \"D\" of block 1 and: Schedule \"A\" (29 CFR 60) or Schedule \"C\" Precertification list (when that list (a) You were born in any country of the Western Hemisphere or the islands of has not been suspended by the Secretary of Labor). Saint Pierre, Miquelon, Cuba, the Dominican Republic, Haiti, Bermuda, the (b) If you are not within the classes of aliens described in paragraph 10(a) Bahamas, Barbados, Jamaica, the Windward and Leeward Islands, Trinidad, above, you must fill out Form MA 7-50A in accordance with the instructions for Martinique and other British, French, and Netherlands territory or possessions in the completion of that form and send it with documentary evidence of your or bordering on the Caribbean Sea. qualifications specified in paragraph (c) below to your employer or prospective However, if you are a native or citizen of Cuba who was employer. He must complete Form MA 7-50B and must send it, with Form MA inspected and admitted or paroled into the United States 7-50A and documentary evidence of your applications, to the local office of the subsequent to January 1, 1959 and have been physically present State Employment Service. When and if a certification is issued to your employer, in the United States for at least two years; or if you are the it should be submitted with your application, together with the Forms MA 7-50A spouse or minor unmarried child of such native or citizen of and MA 7-50B and the documentary evidence of your qualifications. Cuba with whom you are residing in the United States and were (Information concerning the categories of employment currently yourself inspected and admitted or paroled into the United listed in Schedules A, B, and C, Part 60, Title 29, Code of Federal States subsequent to January 1, 1959 and have been physically Regulations, may be obtained at principal offices of the Immigration present in the United States for at least two years, you are and Naturalization Service). eligible to apply for adjustment of status under the Act of (c) The following documentary evidence of your qualifications must be November 2, 1966, and you may apply for adjustment on Form submitted with your application for a labor certification: 1-485A. (1) School Records-If your eligibility is based in whole or in part on (b) You entered the United States as a member of the crew of a vessel or higher education or attendance at a technical or vocational school, attach aircraft, or were destined to join a vessel or aircraft in the United States as a certified copy of school record. The record must show period of attendance, member of the crew when you arrived in this country. major field of study, and degrees or diplomas awarded. (c) You were not admitted or paroled into the United States following (2) License or Other Official Permission to Practice a Profession-If you are inspection by a United States immigration officer. a member of a profession, attach a copy of the license or other official (d) You are or have been an exchange alien, subject to, but have not complied permission granted you to practice the profession in the country where you with the foreign residence requirement of section 212(e) of the Immigration & have been found qualified to practice that profession, if a license or other Nationality Act and have not been granted a waiver of this requirement. (This permission is required in that country. ground of ineligibility applies to persons who checked box \"A\", \"B\". \"C\" or \"D\" (3) Evidence of Exceptional Ability in the Sciences or the Arts-If your of block 1.) eligibility is based upon exceptional ability in the sciences or the arts. NOTE: If you are ineligible under any of the foregoing but have resided in the documentary evidence supporting the claim should be submitted. Such United States continuously since prior to June 30, 1948, you may still apply on this evidence may testify to the universal acclaim and either national or form to have a record of lawful admission for permanent residence created under international recognition accorded you; show that you have received a section 249, Immigration and Nationality Act. In such case check box \"E\" or \"F\" of nationally or internationally recognized prize or award or won a nationally or block 1. internationally recognized competition for excellence for a specific product or 8. IMMEDIATE RELATIVE AND PREFERENCE ALIENS.-I you are the performance or for outstanding achievement; or testify that you are a member spouse or minor unmarried child of a United States citizen, or if you are the parent in a national or international association of persons which maintain standards of a United States citizen who is at least 21 years of age, you are classifiable as an of membership requiring outstanding achievement as judged by recognized immediate relative; a visa petition must be filed in your behalf unless your United national or international experts in the specific discipline or field of endeavor. States citizen spouse, parent or son or daughter is unable or unwilling to file the (4) Affidavits and Published Material-If your eligibility is based on petition for a reason other than the cost or inconvenience of doing so. technical training or specialized experience, documentary evidence supporting the claim should be submitted. The recommended forms of evidence are NOTE: If you checked box \"B\". \"E\" or \"F\" of block 1 of this application, affidavits or published material. Instruction 8 does not apply to you. Affidavits These must be made by independent sources, such as your If a visa petition is required to establish immediate relative or preference status, it former employerson recognized experts familiar with your work, and must: must have been approved prior to filing this application. (a) Identify the affiant, showing the capacity in which he is testifying; 9. IMMEDIATE AVAILABILITY OF IMMIGRANT SA.-Information as to (b) Give the place and the dates during which you gained your immediate availability of an immigrant visa may be obtained at the nearest office of experience; (c) Describe in detail the duties performed, tools used, supervision this Service. exercised over you and exercised by you. A mere statement for 10. CERTIFICATION OF THE DEPARTMENT OF LABOR.- instruction example that you were employed as a baker is not adequate; and applies to you only if: you checked box \"D\" of block 1 of the application, and you (d) Show the date on which the affidavit was signed. are performing or seek to perform skilled or unskilled labor, and you are seeking Published Material- adjustment as a nonpreference alien. You are considered to be a nonpreference alien (a) Copies of material published by or about you may be submitted if you are not the beneficiary of a currently valid visa petition approved by the (b) The material must be identified as to date, place and name of Immigration and Naturalization Service to accord you a preference or immediate publication. WARNING: If you contemplate departing from the United States to any country, including Canada or Mexico, before a decision is made on your application, consult with the office of the Immigration and Naturalization Service processing your case before departure, since a departure from the United States may result in a denial of your application. If you have not attached the documents called for by the instructions this application will be returned to you. Severe penalties are provided by law for knowingly and willfully falsifying or concealing a material fact or using any false document in the submission of this application. GPO 919-955 (Page 4)"
}