{
  "anumber": "A19529822",
  "id": "A19529822_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A19529822_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/13/2023 U.S. Department of Justice OMB #1115-0009 Immigration and Naturalization Service Application for Naturalization INSTRUCTIONS Purpose of This Form. Fingerprints. If you are between the ages of 14 and 75, This form is for use to apply to become a naturalized you must sumit your fingerprints on Form FD-258. Fill out citizen of the United States. the form and write your Alien Registration Number in the space marked \"Your No. OCA\" or \"Miscellaneous No. Who May File. MNU\". Take the chart and these instructions to a police You may apply for naturalization if: station, sheriff's office or an office of this Service, or other you have been a lawful permanent resident for five reputable person or organization for fingerprinting. (You years; should contact the police or sheriff's office before going you have been a lawful permanent resident for three there since some of these offices do not take fingerprints years, have been married to a United States citizen for for other government agencies.) You must sign the chart those three years, and continue to be married to that in the presence of the person taking your fingerprints and U.S. citizen; have that person sign his her name, title, and the date in you are the lawful permanent resident child of United the space provided. Do not bend, fold, or crease the States citizen parents; or fingerprint chart. you have qualifying military service. U.S. Military Service. If you have ever served in the Children under 18 may automatically become citizens Armed Forces of the United States at any time, you must when their parents naturalize. You may inquire at your submit a completed Form G-325B. If your application is local Service office for further information. If you do not based on your military service you must also submit Form meet the qualifications listed above but believe that you N-426, \"Request for Certification of Military or Naval are eligible for naturalization, you may inquire at your local Service.\" Service office for additional information. Application for Child. If this application is for a permanent resident child of U.S. citizen parents, you must also General Instructions. submit copies of the child's birth certificate, the parents' Please answer all questions by typing or clearly printing in marriage certificate, and evidence of the parents' U.S. black ink. Indicate that an item is not applicable with citizenship. If the parents are divorced, you must also \"N/A\". If an answer is \"none,\" write \"none\". If you need submit the divorce decree and evidence that the citizen extra space to answer any item, attach a sheet of paper parent has legal custody of the child. with your name and your alien registration number (A#), if any, and indicate the number of the item. Where to File. File this application at the local Service office having Every application must be properly signed and filed with jurisdiction over your place of residence. the correct fee. If you are under 18 years of age, your parent or guardian must sign the application. Fee. The fee for this application is $90.00. The fee must be If you wish to be called for your examination at the same submitted in the exact amount. It cannot be refunded. DO time as another person who is also applying for NOT MAIL CASH. naturalization, make your request on a separate cover sheet. Be sure to give the name and alien registration All checks and money orders must be drawn on a bank or number of that person. other institution located in the United States and must be payable in United States currency. The check or money Initial Evidence Requirements. order should be made payable to the Immigration and You must file your application with the following evidence: Naturalization Service, except that: If you live in Guam, and are filing this application in A copy of your alien registration card. Guam, make your check or money order payable to the \"Treasurer, Guam.\" Photographs. You must submit two color photographs of If you live in the Virgin Islands, and are filing this yourself taken within 30 days of this application. These application in the Virgin Islands, make your check or photos must be glossy, unretouched and unmounted, and money order payable to the \"Commissioner of Finance have a white background. Dimension of the face should of the Virgin Islands.\" be about 1 inch from chin to top of hair. Face should be 3/4 frontal view of right side with right ear visible. Using Checks are accepted subject to collection. An uncollected pencil or felt pen, lightly print name and A#, if any, on the check will render the application and any document issued back of each photo. This requirement may be waived by invalid. A charge of $5.00 will be imposed if a check in the Service if you can establish that you are confined payment of a fee is not honored by the bank on which it is because of age or physical infirmity. drawn. Form N-400 (Rev. 07/17/91) N"
}