{
  "anumber": "A20177550",
  "id": "A20177550_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, 20537"
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        1977
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FEDERAL BUREAU OF. INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 1. LOOP APPLICANT CENTER OF LOOP TO OBTAIN CLASSIFIABLE FINGERPRINTS: 1. USE PRINTER'S INK. 2. DISTRIBUTE INK EVENLY ON INKING SLAB. 3. WASH AND DRY FINGERS THOROUGHLY 4. ROLL FINGERS FROM NAIL TO MAIL, AND AVOID ALLOWING FINGERS TO SLIP. 5. BE SURE IMPRESSIONS ARE RECORDED IN CORRECT ORDER 6. IF AN AMPUTATION OR DEFORMITY MAKES IT IMPOSSIBLE TO PRINT A FINGER, MAKE A NOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER BLOCK DELTA 7. IF SOME PHYSICAL CONDITION MAKES IT IMPOSSIBLE TO OBTAIN PERFECT IMPRESSIONS, SUBMIT THE BEST THAT CAN BE OBTAINED WITH A MEMO STAPLED TO THE CARD EXPLAINING THE CIR. CUMSTANCES. 8. EXAMINE THE COMPLETED PRINTS TO SEE IF THEY CAN BE CLASSIFIED, SEARING IN MIND THAT THE LINES BETWEEN CENTER OF MOST FINGERPRINTS FALL INTO THE PATTERNS SHOWN ON THIS CARD (OTHER PATTERNS OCCUR LOOP AND DELTA MUST SHOW INFREQUENTLY AND ARE NOT SHOWN HERE). 2. WHORL LEAVE THIS SPACE BLANK THIS CARD FOR USE BY: DELTAS 1. LAW ENFORCEMENT AGENCIES IN FINGERPRINTING APPLICANTS FOR LAW ENFORCEMENT POSITIONS AND PRINT APPLICANTS FOR EMPLOYMENT LICENSES OR PERMITSUN THOSE STATES WITH STATUTES PROVIDING EOR FINGER. 54 PRINTING AS A REQUISITE FOR THE TYPE OF EMPLOY. MENT, LICENSE OR PERMIT TO BE ISSUED. LOCAL AND COUNTY ORDINANCES, UNLESS SPECIFIC LiBASED ON APPLICABLE STATE STATUTES, DO NOT SATISFY THIS REQUIREMENT. A SET OF APPLICANT PRINTS MUST FIRST BE CHECKED THROUGH THE APPROPRIATE STATE IDEN. TIFICATION BUREAU OR, IF NO SUCH BUREAU EXISTS, THROUGH A CENTRAL AGENCY DESIGNATED FOR SUCH THESE LINES RUNNING BETWEEN PURPOSE WITHIN THE STATE. ONLY THOSE FINGERPRINTS FOR WHICH NO DISQUALIFYING RECORD HAS BEEN FOUND DELTAS MUST BE CLEAR LOCALLY SHOULD BE SUBMITTED FOR FBI SEARCH. IF A MORE CURRENT COPY OF AN EXISTING FBI IDENTIFICA. 3. ARCH TION RECORD IS REQUIRED, SIMPLY SUPPLY NAME, FBI NUMBER OR LOCAL ARREST NUMBER AND, IF READILY AVAILABLE, THE PRIMARY AND SECONDARY PARTS OF THE FINGERPRINT CLASSIFICATION no 2. U.S. GOVERNMENT AGENCIES IN CONNECTION WITH CLEARANCES. IDENTITY OF PRIVATE CONTRACTOR SHOULD BE SHOWN IN SPACE \"EMPLOYER AND ADDRESS,\" THE CONTRIBUTOR IS THE NAME OF AGENCY SUBMITTING THE FINGERPRINT CARD TO THE FBI. FBI NUMBER, IF KNOWN, SHOULD ALWAYS BE FURNISHED IN APPROPRIATE SPACE. MISCELLANEOUS NO. - RECORD: OTHER ARMED FORCES NO. PASSPORT NO. (PP), ALIEN REGISTRATION NO. (AR), RECORDED PORT SECURITY CARD NO. (PS), SELECTIVE SERVICE NO. ARCHES HAVE NO DELTAS (SS), VETERANS' ADMINISTRATION CLAIM NO. (VA). FEB 28 1977 FD 1288 (Rev. 4-25-72) U.S. GOVERMENT PRINTING OFFICE: 1973 -524-273 IDENT. DIV. 49"
}