{
  "anumber": "A20177550",
  "id": "A20177550_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form I-4-102, Alien Registration Application for Permanent Resident Status; Title: Alien Registration Application for Permanent Resident Status."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "NOTA: Llénese desde la Casilla 14 hasta la Casilla 19 solamente si usted ha marcado la Casilla 1A. NOTE: Complete Blocks 14 through 19 only if you checked BLOCK 1A. 14. Yo soy soltero (a) casado (a) divorciado (a) viudo (a) am single married divorced widowed a. Yo he estado casado 1 veces, incluyendo mi matrimonio actual (si esta casado ahora). I have been married times, including my present marriage, if now married. (Si esta casado ahora de los siguientes datos:) (If you are now married give the following:) b. Número de veces que mi marido (esposa) se ha casado. Number of times my husband (wife) c. Nombre de mi marido (esposa). Name of husband (wife). has been married. 2 Hortencia Rad-cliff d. Mi marido (esposa) reside en conmigo separadamente en la dirección (Num. del apto.) (Num. y calle) (Pueblo o ciudad) (Provincia o Estado) (Pais) My husband (wife) resides with me apart from me at Address (Apt. No.) (Number and Street) (Town or City) (Province or State) (Country) 15. a. Tengo hijos 0 hijast (llene todas las columnas correspondientes a cada hijo o hija; si viven con usted indique \"conmigo\" en la ultime columna; de lo contrario, indique la ciudad, el estado o país donde reside cada hijo o hija). I have sons or daughters as follows: (complete all columns as to each son or daughter; if living with you state \"with me\" in last column; otherwise give city and state or country of son's or daughter's residence). (Nombre) (Sexo) (Lugar de nacimiento) (Fecha de nacimiento) (Ahora esta residiendo en) Name p Sex Place of Birth Date of Birth Now living at none b. Los siguientes miembros de mi familia tambien están solicitando la categoria de residentes permanentes: The following members of my family are also applying for permanent resident status. None 16. A continuacion hago una lista de todas las organizaciones, sociedades, clubs y associaciones, pasadas o presentes, de las que he sido socio en los Estados Unidos o en algun pais extranjero, y los periodos y lugares en que era socio. (Si usted nunca ha sido socio de ninguna organización, declare \"Ninguna.\") list below all organizations, societies, clubs, and associations, past or present, in which I have held membership in the United States or a foreign country, and the periods and places of such membership. (If you have never been a member of any organization, state \"None.\") none 17. He recibido no he recibido tratamiento por razón de un trastorno mental, adicción a drogas o alcoholismo. (De haberl recibido, explique.) I have have not been treated for a mental disorder, drug addiction or alcoholism. (If you have been, explain.) 18. He sido X20 he sido arrestado, juzgado culpable o encarcelado. (De haber sido, explique.) I have have not been arrested, convicted or confined in a prison. (If you have been, explain.) 19. He recibido no he recibido un perdón, anmistia, decreto de rehabilitación, U otro acto de clemencia o acción similar. (De haberlo recibido, explique.) I have have not been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar' action. (If you have been, explain.) 20. TODA PERSONA QUE SOLICITE EL ESTADO LEGAL DE RESIDENTE PERMANENTE DEBERA PROBARQUE REUNE LOS REQUISITOS DE ADMISION A LOS ESTADOS UNIDOS. SALVO DE OTRO MODO DISPUESTO POR LEY, LOS EXTRANJEROS COMPRENDIDOS DENTRO DE LAS SIGUIENTES CATEGORIAS NO SERAN ADMITIDOS A LOS ESTADOS UNI- DOS, Y POR LO TANTO, NO TENDRAN DERECHO A SOLICITAR EL ESTADO LEGAL DE RESIDENTE PERMANENTE: Los extranjeros que sean retardados mentales dementes, o hayan su- quier partido comunista u otro partido totalitario, inclusive cualquier frido uno omas ataques de locura; los extranjeros que padezcan de per- subdivisión o filial de los mismos; los extranjeros que hayan abogado sonalidad sicopatica, desviacion sexual, defecto mental, adicción a o profesado, sea por manifestaciones personales, escritos o impresos, drogas narcoticas, alcoholismo crónico, o cualquier enfermedad peli- o mediante afiliación con un organismo, (i) oposición al gobierno con- grosa contagiosa; los extranjeros que tengan un defecto fisico, enfer- stituido, (ii) 1a derrocación del gobierno mediante 1a fuerza y 1a violen- medad o incapacidad que afecte su capacidad de ganarse 1a vida; los cia, (iii) el asalto o el asesinato de funcionarios gubernamentales por extranjeros que sean mendigos, pordioseros o vagos de profesión; los razón de sus personerias oficiales, (iv) 1a destrucción ilegal de propie- extranjeros que sean poligamos o que profesen la poligamia; los ex- dad, (v) el sabotaje, (vi) las doctrinas del comunismo internacional, o tranjeros que hayan sido excluidos de los Estados Unidos dentro de el establecimiento de una dictadura totalitaria en los Estados Unidos; los ultimos doce meses, o que hayan ido en cualquier ocasión de- portados de los Estados Unidos, o que en cualquier ocasión hayan si- los extranjeros que intenten participar en actividades perjudiciales o do expulsados de los Estados Unidos por cuenta y costo del Gobierno; ilegales de caracter subversivo; los extranj eros que hayan sido halla- los extranjero que hayan obtenido, O intentado obtener una visa me- dos culpables de violar cualquier iey o reglamento relacionado con diante fraude o falsedad; los extranj eros que hayan salido o permane- drogas narcoticas o marihuana; que hayan sido traficantes ilicitos de cido fuera de los Estados Unidos para evadir el servicio militar en drogas narcoticas O marihuana; los extranjeros que hayan estado in- tiempo de guerra o emergencia nacional; los extranjeros que hayan si- miscuidos en prestar ayuda a cualquier otro extranjero para entrara do visitantes de intercambio y que no han cumplidoes requisito de dos los Estados Unidos violando las leyes; los extranjeros que han soli- anos de residencia en el extranjero; los extranjeros que hayan come- citado exencion o licenciamiento de entrenamiento o servicio en las tido o se les haya hallado culpables de algun delito que encierre tor- Fuerzas Armadas de los Estados Unidos por razón de ser extranjero, peza moral (no se incluyen las infracciones leves a las leyes de tran- y que hayan sido eximidos o licenciados de tal entrenamiento o servi- sito); los extranjeros que se hayan dedicado o que intenten dedicarse cio. a cualquier trato sexual comercial; los extranjeros que sean o que al- ¿Le corresponde a usted alguna de dichas categorías? Si No guna vez hayan sido anarquisitas, o miembros de, o afiliados a cual- (De contestar Si, sirvase explicar) APPLICANTS FOR STATUS AS PERMANENT RESIDENTS MUST ESTABLISH THAT THEY ARE ADMISSIBLE TO THE UNITED STATES, EXCEPT AS OTHERWISE PROVIDED BY LAW. ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE NOT ADMISSIBLE TO THE UNITED STATES AND ARE THEREFORE INELIGIBLE FOR STATUS AS PERMANENT RESIDENTS: Aliens who are mentally retarded, insane, or have suffered one or more procured or have attempted to procure a visa by fraud or misrepresen- attacks of insanity; aliens afflicted with psychopathic personality, sex- tation; aliens who have departed from or remained outside the United ual deviation, mental defect, narcotic drug addiction, chronic alcohol- States to avoid miliary service in time of war or national emergency; sm or any dangerous contagious disease; aliens who have a physical aliens who are former exchange visitors who have not fulfilled their defect, disease or disability affecting Irlability to earn a living; two year foreign residence requirement; aliens who have committed or aliens who are paupers, professional beggars or vagrants; aliens who who have been convicted of a crime involving moral turpitude (does are polygamists or advocate polygamy; aliens who have been excluded not include minor traffic violations) aliens who have been engaged in from the United States within the past year, or who at any time have or who intend to engage in any commercialized sexual activity; aliens been deported from the United States, or who at any time have been re- who are or at any time have been anarchists, or members of or affilia- moved from the United States at Government expense; aliens who have (Page 2)"
}