{
  "anumber": "A20177550",
  "id": "A20177550_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "femenino"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION BY CUBAN REFUGEE FOR PERMANENT RESIDENCE SOLICITUD PARA RESIDENCIA PERMANENTE DE REFUGIADO CUBANO, C-14282"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "Cuba",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1964,
        1972,
        1959
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Ci-2828 APPLICATION BY CUBAN REFUGEE FOR PERMANENT RESIDENCE Form Approved SOLICITUD PARA RESIDENCIA PERMANENTE DE REFUGIADO CUBANO OMB No. 43-R0437 DATE RECEIVED DEC 26 FILE NO. APPLICANT FOR BENEFITS OF MIAMI Section 1 of the Act of November 2, 1966. Section 2 of the Act of November 2, 1966. RBD 61 26172 NO ESCRIBA ASARRIBA DE ESTA LINEA. VEA LAS INSTRUCCIONES ANTES DE EJECUTAR LA PLANILLA DE SOLICITUD. SI NECESITA MAS ESPACIO PARA CONTESTAR POR COMPLETO ALGUNA PREGUNTA, USE UN PLIEGO SEPARADO E IDENTIFIQUE CADA RESPUESTA CON EL NUMERO DE LA PREGUNTA CORRESPONDIENTE ESCRIBA CON LETRA DE IMPRENTA. DO NOT WRITE ABOVE THIS LINE. SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION. IF YOU NEED MORE SPACE TO AN- SWER FULLY ANY QUESTION ON THIS FORM. USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER THE CORRESPONDING QUESTION. PRINT IN BLOCK LETTERS. (LLENESE SOLAMENTE EL CUADRO 1A o EL 1B) (COMPLETE BLOCK 1A OR 1B ONLY) 1. A. Por la presente yo solicito convertirme en residente permanente extranjero sobre la siguiente base: (Marque solamente (1) o (2).) I hereby apply to become a lawful permanent resident alien on the following basis: (Check (1) or (2) only.) (1) Yo soy nativo o ciudadano de Cuba. Fui inspeccionado por un funcionario del Servicio de Inmigración de los Estados Unidos de America y admitido o permitido entrar bajo palabra en los Estados Unidos con posterioridad al 1 de Enero 1959, y he estado fisicamente presente en este pais, por lo menos dos anos despues de eso, o I am a native or citizen of Cuba. I was inspected by a U.S. immigration officer and admitted or paroled into the United States subsequent to January 1, 1959, and have been physically present in the United States for at least 2 years thereafter, or (2) Yo no soy nativo ni ciudadano de Cuba, sino soy la esposa el esposo, o la hija el hijo menor de edad y de estado soltero, de un nativo o ciudadano de Cuba, tal como ha sido descrito anteriormente en \"(1)\", con quien estoy residiendo. Yo fui inspeccionado por funcionario del Servicio de Inmigracion de los Estados Unidos de America y admitido o permitido entrar bajo palabra en los Estados Unidos, con posterio dad al 1 de Enero 1959, y he estado presente fisicamente en este país por lo menos dos años despues de eso. I am not a native or citizen of Cuba but I am the husband wife, or minor unmarried child of a native or citizen of Cuba described in \"(1)\" above with whom I am residing. I was inspected by a U.S. immigration officer and admitted or paroled into the United States subsequent to January 1, 1959, and have been physically present in the United States for at least 2 years thereafter. 1. B. Por la presente yo solicito que mi permiso para residencia permanente tenga como fecha la de mi llegada original a los Estados Unidos de América cuando admitido bajo palabra o como no emigrante, o la del 2 de Mayo de 1964, de las dos la que sea posterior. (Marque solamente (1) o (2).) I hereby apply to have my admission for permanent residence recorded as of the date I originally arrived in the United States as a nonimmigrant or parolee, or as of May 2, 1964, whichever date is later. (Check (1) or (2) only.) (1) Yo soy un nativo o ciudadano de Cuba, que fue legalmente admitido en los Estados Unidos para residencia permanente. I am a native or citizen of Cuba who was lawfully admitted into the United States for permanent residence. (2) Yo no soy nativo ni ciudadano de Cuba, sino soy la esposa el esposo, o la hija el hijo menor de edad y de estado soltero, de un nativo o ciudadano de Cuba, tal como ha sido descrito anteriormente en \"(1)\", con quien estoy residiendo. Fui admitido en los Estados Unidos para residencia permanente. I am not a native or citizen of Cuba but I am the husband wife, or minor unmarried child of a native or citizen of Cuba described in \"(1)\" above with whom I am residing. I was admitted into the United States for permanent residence. 2. Mi nombre es (Apellido) (Nombre de pila) (Nombre intermedio(s)) My name is (Last) (First) (Middle) SEXO Masculino Femenino BRITO-VAREIA, Silvano SEX Male Female 3. Yo vivo en los Estados Unidos en: (Calle y Num.) (Núm. del Apto.) (Ciudad) (Estado) (Codigo postal-ZIP) I reside in the United States at: (No. and Street) (Apt. No.) (State) 4. ¿ Ha solicitado Ud. alguna vez residencia (City) (ZIP Code) permanente en los EE. UU.? Si No 720 N.W. 27 Ct Apt 1 Miami Fla 33125 (Si la respuesta es \"Si\", indique feeha y 5. Mi numero de Registro de Extranjeros es 6. Ahora soy un ciudadano de (Pais) 7. Fecha de nacimiento lugar de presentacion y resolucion definitiva.) My alien registration number is I am now a citizen of (Country) Date of Birth Have youever applied for permanent residence A-20-177-550 Cuba status in the United States? 8/30/07 Yes No 8. Lugar de nacimiento o ciudad) (Departamento o provincia) (Pais) (If \"Yes\" give date and place of filing and Place of Birth (City or Town) (County, Province, or State) (Country) final disposition.) Ha b Cuba 9. Nombre segun aparece se Su documento de entrada como no Mi numero de permiso en el formulario I-94 es; emigrante formulario I-94. Name as appears on nonimmigrant My I-94 permit number is: document Form I-94. Same as above 10. Mi primera llegada a los Estados Unidos, después del I de enero de 1959, fue'en Al puerto o aeropuerto de My first arrival in the United States after January 1, 1959, occurred on Fecha (Mes, dia y año) At the Port of (City, State) Date (Month, Day, Year) 12/27/72 Miami Fla 11. Yo llegué por (Nombre del barco u otro medio de transporte) como un (Visitante, estudiante, ciudadano de los EE. UU. polizon, inmigrante, I arrived by (Name of vessel or other means of travel) bajo palabra, etc.) as a (Visitor, student, U.S. citizen, stowaway, immigrant, parolee, etc. AMSA 450 Parolee 12. 13. 1773 Pasé No pasé por la inspeccion. Mi visa de no inmigrante, numero fue erpedida por el Consul de los Estados Unidos en (Ciudad, Pais) el (Fecha: dia, mes, año). Mexico I My nonimmigrant visa, number was was not inspected was issued by the U.S. Consul at (city, state) on (month, day year) Hab Cuba May 2,1972 Form I-485A (Rev. 12-1-73)N (Page 1) RECEIVED TRANS. IN RET'D-TRANS. OUT COMPLETED"
}