{
  "anumber": "A20177550",
  "id": "A20177550_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, FORM 1—468 A ( (REV.10-11-76Y)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TC/rs UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE FILE NO: A20 177 550 DATE: MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW Silvano Jose Brito Varela 1350 N. W. 5th St. Apt 6 Miami, Fla 33125 INSTRUCTIONS FOR MEDICAL EXAMINATION A medical examination is necessary as part of your application for adjustment of status to permanent resident. If you have reached your fifteenth birthday you must IMMEDIATELY obtain and bring with you when you appear for your medical examination a serology report and 14\" X 17\" chest X-ray film with a reading by a licensed physician interpreting the X-ray film. The serologic test must be performed by a laboratory approved by a state or local health department. The X-ray film and serologic test for syphilis may not be more than 90 days old. YOUR MEDICAL EXAMINATION CANNOT BE COMPLETED WITHOUT THE (1) SEROLOGIC REPORT, (2) X- RAY AND (3) READING OF THE X-RAY FILM. Please note, also the boxes checked below with regard to your medical examination. Please obtain your serologic report, X-ray film and reading promptly. You may telephone your state or local Health Department for the name of an approved laboratory where you may obtain these. Bring them and copies of this letter with you when you appear for examination by a physician of the U. S. Public Health Service for which an appointment has been made at the place and date indicated below: ADDRESS DATE TIME Please communicate immediately with the below listed physician or with one of the physicians on the attached list, if a list is attached, (1) to ascer- tain what arrangements you should make to obtain a serologic report, X-ray film and reading prior to your medical examination, and (2) to arrange for your medical examination by him, which must be completed before All expenses in connection with this examination must be paid by you. PHYSICIAN'S NAME, ADDRESS, AND TELEPHONE NUMBER Please show this letter to any laboratory performing tests. Also present the copies of this letter to the physician performing the medical examination, and furnish him with your signature written in his presence for inclusion with his report. TO PHYSICIAN PERFORMING THE EXAMINATION PLEASE OBTAIN THE APPLICANT'S SIGNATURE IN THE SPACE PROVIDED AND MEDICALLY EXAMINE HIM FOR ELIGIBILITY FOR AD- JUSTMENT OF STATUS. IF THE APPLICANT IS FREE OF MEDICAL DEFECTS LISTED IN SECTION 212 (A) OF THE IMMIGRATION AND NATIONALITY ACT, ENDORSE THIS COPY OF FORM 1-486A IN THE SPACE PROVIDED AND HAND IT TO THE APPLICANT IN A SEALED ENVELOPE FOR PRESENTATION AT HIS IMMIGRATION INTERVIEW. IF THE APPLICANT IS NOT FREE OF SUCH MEDICAL DEFECTS, DO NOT SIGN THIS FORM. INSTEAD WRITE 'SEE FS-398' IN THE PHYSICIAN'S SIGNATURE BLOCK AND PREPARE MEDICAL CERTIFICATE ON FORM FS-398 AND HAND IT TO THE APPLICANT IN A SEALED ENVELOPE TOGETHER WITH THIS COPY OF FORM 1-486A FOR PRESENTATION AT HIS IMMIGRATION INTERVIEW. (IF EXAMINATION IS CONDUCTED BY A CIVIL SURGEON, INSERT IN ENVELOPE BOTH COPIES OF FORM 1-486A, X-RAYS AND LABORATORY REPORTS AND TWO COPIES OF FORM FS-398 IF APPLICANT IS NOT FREE OF MEDICAL DEFECTS.) DISTRICT DIRECTOR I CERTIFY THAT THE ATTACHED X-RAY AND SEROLOGY REPORT (BLOOD TEST) RELATE TO ME SIGNATURE OF APPLICANT PENALTY THE LAW PROVIDES SEVERE PENALTIES FOR Shere BRITO VARNEY KNOWINGLY AND WILFULLY FALSIFYING OR CONCEALING A MATERIAL FACT OR USING ANY FALSE DOCUMENTS IN CONNECTION WITH THIS APPLICATION. MY EXAMINATION, INCLUDING X-RAY BLOOD SEROLOGICAL AND OTHER REPORTS, WHEN NEEDED. SHOW THE APPLICANT TO BE FREE OF ANY DEFECTS, DISEASE OR DISABILITIES LISTED IN SECTION 212(A) OF THE IMMIGRATION AND NATIONALITY ACT AS AMENDED. SIGNATURE OF PHYSICIAN DATE 10-17-77 TITLE MP FORM 1-486 A REV.11-10-76)Y"
}