{
  "anumber": "A20177550",
  "id": "A20177550_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCCIONES PARA EL RECOGNICIMIENTO MÉDICO"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "(VEASE AL DORSO DE ESTA PAGINA LA DIRECCIÓN, FECHA Y HORA RESERVADA PARA SU RECONOCIMIENTO MEDICO Y ENTREVISTA) INSTRUCCIONES PARA EL RECONOCIMIENTO MEDICO Como parte de su solicitud para modificar su status a uno de residente permanente, se exige un examen físico. Si ha cumplido usted 15 años de edad deberá obtener INMEDIATAMENTE, y traer consigo en el momento de presentarse al examen físico, un informe sobre los resultados de un análisis de sangre y una radiografía del tórax de 14\" por 17\" (35,50 cm. por 43 cm.) con el informe interpretativo de dicha radiografía preparado por un médico autorizado. El análi- sis de sangre debera hacerse en un laboratorio autorizado por el Departamento de Sanidad de un gobierno local o del Estado. La radiografía y el analisis de sangre para sifilis no deberan haber sido hechos mas de 90 días antes de la fecha de presentación. su EXAMEN MÉDICO NO SE PODRÁ COMPLETAR SIN (1) UN INFORME SEROLÓGICO, (2) UNA RAD- IOGRAFIA Y (3) LA INTERPRETACIÓN DE LA RADIOGRAFIA. TENGA LA BONDAD DE FUARSE TAMBIEN EN LAS CASILLAS MARCADAS A CONTINUACIÓN EN RELACION CON SU RECONOCIMIENTO MÉDICO Sírvase obtener prontamente su informe serológico, radiografía y la interpretación de la radiografía. Usted puede llamar por teléfono a la oficina local o estatal del Deportamento de Salud y solicitar el nombre de un laboratorio autorizado donde podrá obtener estos servicios. Sirvasa troer estos documentos juntamente con copias de esta carta al presentarse a examen ante un médico del Servicio de Salud Pública de los Estados Unidos, examen para el cual se ha concertado una cita en el lugar y fecha abajo indicados FECHA boig HORA Sírvase comunicarse immediatamente con el médico obajo indicado o con uno de los médicos cuyos nombres aparecen en la lista adjunta, si S@ adjunta una lista, para 1) determinar que medidas debeza usted tomar para obtener un informe serológico, una radiografía y la interpret oción de la radiografía antes de cita con of médico para hacerse el examen, el cual debera completarse antes del Todos los gostos relacionados con este examen deben ser sufragados por usted. Sírvase mostrar esta carta a cualquier laboratorio que haga estos examenes. Además, entregue las copias de la carta of médico que le examine, y firme su nombre en presencia del médico para que él incluya SU firma en el informe. INSTRUCCIONES ACERCA DE LA ENTREVISTA DE INMIGRACIÓN TAMBIEN SE HA CONCERTADO UNA ENTREVISTA ANTE UN FUNCIONARIO DE INMIGRACIÓN EN: DIRECCIÓN: FECHA: HORA: AL COMPARECER PARA ESTA ENTREVISTA, TENGA LA BONDAD DE TRAER CONSIGO LOS DOCUMENTOS SIGUIENTES: 1. EL SOBRE SELLADO QUE LE ENTREGÓ EL MÉDICO QUE LLEVÓ A CABO EL RECONOCIMIENTO. 2. SU PASAPORTE Y EL FORMULARIO I-94. 331S2 SI USTED NO HABLA INGLÉS, DEBE ACOMPAÑARLO (A) UNA PERSONA DE SU SEXO QUE SIRVA COMO. INTÉRPRETE DURANTE EL RECONOCIMIENTO MÉDICO Y LA ENTREVISTA DE INMIGRACIÓN AVISO: EL NO PRESENTARSE A LA HORA Y FECHA INDICADAS PARA ESTAS ENTREVISTAS U OLVIDARSE LLEVAR LOS DOCUMENTOS REQUERIDOS SERÁ MOTIVO DE QUE SU CASO SE ATRASE. TRAIGA SU PASAPORTE Y EL FORMULARIO I-94 ID"
}