{
  "anumber": "A20177550",
  "id": "A20177550_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration & Naturalization Service, M-180 (Rev. 7-71)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "TO SERVE We are replying to your letter with notations on the letter itself. This informal meth hables us to re- spond to you immediately. We trust you will agree that promptness is more important than formality. No record has been made of this correspondence and should you write again concerning the same matter, please return the attached correspondence. UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Social Security Administration Room 301, 1800 SW 1 Street 3 GPO 912.116 Miami, FL 33135 Telephone: 541-1881 Date: April 12, 1978 Immigration & Naturalization Service 51 SW First Avenue Miami, FL 33130 RE: Name: SILVANO BRITO-VARELA A/N 267-45-5030 Alien No.: A20-177-550 Other Identifying Information: Gentlement SILVANO BRITO-VARELA BORN 08-30-07 and residing at 1350 NW 5th Stre Apt. 6 Miami, Fla. 33125 has applied for Medicare. He has recived Form I-151, showing the effective date of his/her permanent residency status as 06/26/72 In order to determine his/her eligibility for Medicare, we must know the date on which your office approved his/her change in status under Public Law 89-732. Please complete the bottom portion of this form and return it in the enclosed envelope. Your cooperation is appreciated. Sincerely yours Jevere C.Peal Teresa C. Paulos Claims Representative Enclosure Date of Approval: 10-27-77 Date Signed: 04-17-78 MIA 2-C IFR VC Edward T. Sweeney, District Director TCP'mcr Signature and Title"
}