{
  "anumber": "A20177550",
  "id": "A20177550_0023",
  "page_index": 23,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0023/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, FORM 1—486"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. GOVERNMENT PRINTING OFFICE 1976 208-417 PD 12/26/74 TCbh /cas UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE FILE NO A20 177 550 1001 S. W. 1st St. (Room 201) Miami, Florida 33130 APR 12 1977 DATE MEDICAL EXAMINATION AND IMMIGRATION Silvano BRITO-Varela RETURNED 720 N.W. 27th Court Apt 1 Miami, FL 33125 INSTRUCTIONS FOR MEDICAL EXAMINATION A medical examination is necessary as part of your application for adjustment of status to permanent resident If you have reached your fifteenth birthday you must IMMEDIATELY obtain and bring with you when you appear for your medical examination a serology report and 14\" x 17\" chest X-ray film with a reading by a licensed physician interpreting the X-ray film. The serologic test must be performed by a laboratory approved by a state or local health department The X-ray film and serologic test for syphilis may not be more than 90 days old. YOUR MEDICAL EXAMINATION CANNOT BE COM- PLETED WITHOUT THE (1) SEROLOGIC REPORT, (2) X-RAY AND (3) READING OF THE X-RAY FILM. Please note, also the boxes checked below with regard to your medical examination. Please obtain your serologic report, X-ray film and reading promptly. You may telephone your state or local Health Department for the name of an approved laboratory where you may obtain these. Bring them and copies of this letter with you when you appear for examination by a physician of the U.S. Public Health Service for which an appointment has been made at the place and date indicated below: ADDRESS DATE TIME Please communicate immediately one of the physicians on the attached list, if a list IS attached, (1) to as- certain what arrangements you should make to obtain a serologic report, X-ray film and reading prior to your medical examination, and (2) to arrange for your medical examination by him, which must be completed before All expenses in connection with this examination must be paid by you. Please show this letter to any laboratory performing tests. Also present the copies of this letter to the physician performing the medical examina. tion, and furnish him with your signature written in his presence for inclusion with his report. INSTRUCTIONS FOR IMMIGRATION INTERVIEW AN APPOINTMENT HAS ALSO BEEN MADE FOR AN INTERVIEW BEFORE AN IMMIGRATION OFFICER AT ADDRESS 1001 S. W. 1st St. (Room 201) DATE APR 26 1977 1-30 PM Miami, Florida 33130 TIME Bring with you at the time of interview the following: 1. The sealed envelope furnished to you by the physician who performed the medical examination. 2. Your passport and Form I-94. ORIGINAL AND COPY OF YOUR BIRTH CERTIFICATE & TWO RECENT IF YOU DO NOT SPEAK ENGLISH. A PERSON OF YOUR OWN SEX WHO CAN ACT AS INTERPRETER SHOULD NOTE: ACCOMPANY YOU TO THE MEDICAL EXAMINATION AND IMMIGRATION INTERVIEW FAILURE TO KEEP THESE APPOINTMENTS AND TO BRING THE REQUIRED DOCUMENTS WILL DELAY YOUR CASE. BRING PASSPORT AND I-94 FORM 1-486 District Director (REV 6-1-73) Y (SPANISH LANGUAGE TRANSLATION OF ABOVE APPEARS ON REVERSE OF THIS PAGE)"
}