{
  "anumber": "A20177550",
  "id": "A20177550_0035",
  "page_index": 35,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A20177550_0035/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, FORM I-160 ( (Rev. 6-1-70) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Mexico",
        "Cuba",
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE 1. FROM Port and initials of preparing officer MIA JC Date and time 2. TO: (Address of onward port or FCO, as appropriate) 12-22-72 11 P DD File or \"A\" Number MIAMI OWN RECOG ROUTE TO TRAVEL CONTROL WITH ANY RELATED \"A\" FILE. 3. (CHECK APPROPRIATE BOX(ES) AND FURNISH INFORMATION REQUIRED BY ITEM(S) INDICATED) NOTICE OF PAROLE NOTICE OF DEFERRED INSPECTION (Complete Items 4, 10, 11 & 12) (Complete Items 4, 10, 11 & 12) n.m NOTICE OF LOOKOUT INTERCEPT (Complete Items 4, 11 & 15) (See Note.3 3) PRINT OR TYPE ALL INFORMATION 4. LAST NAME (Use CAPITAL letters) FIRST NAME BRITO 1 VARELA MIDDLE INITIAL SILVANO PERMANENT ADDRESS: ITEMS 5 THRU 9 MUST BE COMPLETED IF NO FORM I-94 ATTACHED 5. Date and Place of Birth 8 30 07 6. Nationality 7. Passport No. 8. Type of visa: 9. Date and Place visa issued: CUBA 10. Reasons for Parole/Deferred Inspection 11, Purpose for seeking admission 12. Grounds of inadmissibility Subject arrived from Mexico with attached I-512 paralee Left Cuba today with USC wife Action Required at Onward Office: Intended Destination: (Address, if avail.) Disposition of Case: 117 NW 32 Ave (If applicable) Alien instructed to report to your office Intended period of stay: FORM I-160A FORWARDED TO On 12-227-12 INDER CANADIAN IMMIGRATION AT: 13. REMARKS: I-512 issued 7-28-70 revalidated by swiss If interview must be conducted in foreign language, check box and specify language. x SPANISH 14. ACTION TAKEN BY FCO (INTERCEPTS ONLY): 15. DISPOSITION (INTERCEPTS ONLY) NOTES: (Check One) 1. Attach any documents surrendered by alicn. 2. If more than one block is checked under Item 3, execute Withdrew application for admission. sufficient copies for notification to each office con- Refused a landing permit. cerned. 3. Do not execute this form solely on basis of lookout Other (Specify) posted at request of another agency. FORM I-160 (Rev. 6-1-70) Y GPO 892-901"
}