{
  "anumber": "A21200457",
  "id": "A21200457_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Oath Ceremony Questionnaire, N-4"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 You should answer these questions the day you are to appear for the naturalization oath ceremony. These questions refer to actions Authority for collection of the information requested since the date you were first interviewed on your Application for Naturalization. They do not refer to anything that happened before on Form N-445 is contained in Sections 101(f), 316, 332, 335 that interview. and 336 of the Immigration and Nationality Act (8 U.S.C. 1101 (f), 1427, 1443, 1446 and 1447). Submission of the After you have answered every question, sign your name and fill in the date and place of signing, and provide your current address. information is voluntary. The principal purposes for You must bring this completed questionnaire with you to the oath ceremony, as well as the documents indicated on the front, and give requesting the information are to enable examiners of the them to the Immigration employee at the oath ceremony. You may be questioned further on your answers at that time. Immigration and Naturalization Service to determine an applicant's eligibility for naturalization The information requested may, as a matter of routine use, be disclosed to AFTER THE DATE you were first interviewed on your Application for Naturalization, Form naturalization courts and to other federal, state, local or N-400: ANSWERS foreign law enforcement and regulatory agencies, the 1. Have you married, or been widowed, separated, or divorced? (If \"Yes\" please bring documented Department of Defense, including any component thereof, proof of marriage, death, separation or divorce. ,Un No the Selective Service System, the Department of State, the Yes Department of the Treasury, the Department of 2. Have you traveled outside th United States? 2. Yes No Transportation, Central Intelligence Agency, Interpol and 3. Have you knowingly committed any crime or offense, for which you have not been arrested; or individuals and organizations in the processing of any have you been arrested, cited, charged, indicted, convicted fined, or imprisoned for breaking or application for naturalization, or during the course of violating any law or ordinance, including traffic violations? 3. Yes No investigation to elicit further information required by the 4. Have you joined any organization, including the Communist Party, or become associated or Immigration and Naturalization Service to carry out its connected therewith in any way? functions. Information solicited which indicates a violation 4. Yes No or potential violation of law, whether civil, criminal, or 5. Have you claimed exemption from military service? 5. Yes No regulatory in nature, may be referred, as a routine use, to the 6. Has there been any change in your willingness to bear arms on behalf of the United States; to appropriate agency, whether federal, state, local or foreign, perform non-combatant service in the armed forces of the United States; to perform work of charged with the responsibility of investigating, enforcing or national importance under civilian direction, if the law requires it? 6. Yes No prosecuting such violations. Failure to provide all or any of 7. Have you practiced polygamy, received income from illegal gambling; been a prostitute, procured the requested information may result in a denial of the anyone for prostitution or been involved in any other unlawful commercialized vice; encouraged or application for naturalization. helped any alien to enter the United States illegally; illicitly trafficked in drugs or marihuana; Public Reporting burden for this collection of information is given any false testimony to obtain immigration benefits; or been a habitual drunkard? 7. Yes No estimated to average 5 minutes per response, including the time for reviewing instructions, searching existing data I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. sources, gathering and maintaining the data needed, and minh completing and reviewing the collection of information. Signed at van Anguyen- ,on December 3-1992 Send comments regarding this burden estimate or any other (City and State) (Date) aspect of this collection of information, including suggestions (nsiblido) for reducing this burden to: U.S. Department of Justice, 1718 S. King sheet City Santa (Full ana CA 92704 aid Immigration and Naturalization Service, (Room 5304), Washington, DC 20536; and to the Office of Management (Full Signature) Address and ZIP Code) and Budget, Paperwork Reduction Project: OMB No. 1115 0052, Washington, DC 20503. RECEIVER 18A3.19"
}