{
  "anumber": "A21203456",
  "id": "A21203456_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21203456_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Sworn Statement of Refugee Applying for Parole into the United States, G-64(5.12.75)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "United States Department of Justice Immigration and Naturalization Service SWORN STATEMENT OF REFUGEE APPLYING FOR PAROLE INTO THE UNITED STATES Name TA THI VIEN A 21 203 456 APPLICANTS MUST ESTABLISH THAT THEY ARE ADMISSIBLE TO THE UNITED STATES. EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE NOT AD- MISSIBLE TO THE UNITED STATES: Aliens who have committed or who have been convicted of a crime involving moral turp- itude (does not include minor traffic violations); aliens who have been engaged in or who intend to engage in any commercialized sexual activity; aliens who are or at any time have been, anarchists, or members of or affiliated with any communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who have advocated or taught, either by personal utterance, or by means of any written or prin- ted matter, or through affiliation with an organization, (i) opposition to organized government, (ii) the overthrow of government by force or violence, (iii) the assault ing or killing of government officials because of their official character, (iv) the unlawful destruction of property, (v) sabotage, or (vi) the doctrines of world comm- unism, or the establishment of a totalitarian dictatorship in the United States; ai- iens who intend to engage in prejudicial activities or unlawful activities of a sub- versive nature; aliens who have been convicted of violation of any law or regulation relating to narcotic drugs or marijuana, or who have been illicit traffickers in nar- cotic drugs or marijuana; aliens who have been involved in assisting any other aliens to enter the United States in violation of law; aliens who have applied for exemption or discharge from training or service in the Armed Forces of the United States on the ground of alienage and who have been relieved or discharged from such training or ser- vice. Aliens who are mentally retarded, insane, or have suffered one or more attacks of in- sanity; aliens afflicted with psychopathic personality, sexual deviation, mental de- fect, narcotic drug addiction, chronic alcoholism or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn a living; aliens who are paupers, professional beggars or vagrants; aliens who are polygamists or advocate polygamy; aliens who have been excluded from the United States within the past year, or who at any time have been deported from the United States, or who at any time have been removed from the United States at Government expense; aliens who have procured or attempted to procure a visa by fraud or misrep- resentation; aliens who have departed from or remained outside the United States to avoid military service in time of war or national emergency. Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain on reverse) Further, / have never ordered, assisted or otherwise participated in the persecution of any person because of race, religion or political opinion. I understand all the foregoing statements, having asked for and obtained a translation or explanation of every point which was not understood or clear to me. + (COMPLETE & TRUE SIGNATURE OE APPLICANT) her mark myel Subscribed and sworn to before me by the above-named applicant at CP PENDLETON, CA on GEP 10-1975 (MONTH/DAY.YYAR) Name of Interpreter (print) MARY Signature of Interpreter SIGNATURE AND TITLE (11 OFFICIAL FORM G-646 3(5.12.75)"
}