{
  "anumber": "A21200457",
  "id": "A21200457_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application,"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 41. Have you ever claimed in writing, or in any other way, to be a United States 49. Did you ever apply for exemption from military service because of alienage, citizen? conscientious objections, or other reasons? (If \"Yes\", attach a full explana- Yes No tion) Yes No 42. Have you ever deserted from the military, air or naval forces of the United States? 50. Did you ever register under United States Selective Service laws or draft Yes No laws? (If \"Yes\", complete the following) Yes No 43. Have you ever left the United States to avoid being drafted into the Armed Date registered Forces of the United States? None Yes No bonies Selective Service Number 44. Do you believe in the Constitution and form of government of the United None States? Local Board Number X Yes No None Present classification 45. Are you willing to take the full oath of allegiance to the United States? (See None instruction #5) x Yes No 51. The law provides that you may not be regarded as qualified for naturalization, 30 46. If the law requires it, are you willing to bear arms on behalf of the United if, at any time during the period for which you are required to prove good moral States? (If \"No\", attach a full explanation) character, you have been a habitual drunkard; advocated or practiced Yes No polygamy; have been a prostitute or procured anyone for prostitution; have SACI knowingly and for gain helped any alien to enter the United States illegally; 47. If the law requires it, are you willing to perform noncombatant services in the have been an illicit trafficker in narcotic drugs or marijuana; have received Armed Forces of the United States? (If \"No\" attach a full explanation) your income mostly from illegal gambling, or have given false testimony for Yes No the purpose of obtaining any benefits under this Act. Have you ever, 48. If the law requires it, are you willing to perform work of national importance any where, been such a person or committed any of these acts? (If you under civilian direction? (If 'No attach a full explanation) answer yes to any of these, attach full explanation.) Yes No Yes No This block is to be completed by the person preparing form, if other than You may, by law, change your name at the time you are naturalized. If you wish Oste the applicant. to do so, please print or type that name below, or the name you want your certificate of naturalization issued under. / declare that this document was prepared by me at the request of the applicant and is based on all information of which / have any knowledge. Signature Signature of Applicant X FAMILY LEEUNIE tration IMMIGRATION & NATURALIZAD X FE SERVICE CENTER Junk Van Nguyen Address AVE., SUITE 210 Mailing Address Wastm er, CA 92683 1718 S. King St. PHONE: (714) 775-7225 Santa Ana CA 92704 Telephone Number Date Telephone Number Date Jun 08, 1991 (714)556-8526 Jun. 08, 1991 Do not fill in blanks below these lines: This application must be sworn to before an officer of the Immigration and Naturalization Service. AFFIDAVIT / do swear that / know the contents of this application, comprising pages 1 to 4, Subscribed and sworn to before me by applicant at the preliminary investigation inclusive, and the supplemental forms thereto, (Form Numbers Anna ) subscribed to by me; that the same are true to the best of my knowledge and At LOS belief; that corrections numbered: 10 to This day of 3-24-91 19 were made by me or at my request, and that this application was signed by me / certify that before verification of the above applicant stated in my presence he or with my full, true and correct. name, so help me God. she had (heard) read the foregoing application, corrections therein and supplemental form(s) and understood the contents thereof. M much Van of Nguyen 15 Barett (Complete and true signature applicant) (Naturalization Examiner) (Demonstrate applicant's ability to write English) Non Filed 3.5113 USAE (Date, reasons) Form N-400 (12/05/86) N Page 4 GPO : 1988 0 206-658"
}