{
  "anumber": "A21200457",
  "id": "A21200457_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INTERNATIONAL RESCUE COMMITTEE, INC., No. 767/IRG/75"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 INTERNATIONAL CABLE: INTERESCUE, NEW YORK RESCUE ANGIER BIDDLE DUKE Honorary Chairman IRC LEO CHERNE Chairman COMMITTEE, INC. MRS. MARY P. LORD Vice Chairman 1933 386 PARK AVENUE SOUTH NEW YORK, NEW YORK 10016 TEL. (212) 679-0010 LEONARD H. MARKS President GARRET G. ACKERSON, JR. Vice President No.767/IRC/75 EDWIN J. WESELY Vice President MORTON I. HAMBURG REFUGEE RELEASE BY VOLUNTARY AGENCY Vice President & General Counsel FORT CHAFFEE, ARK. DAVID SHER Chairman, Executive Committee JOHN C. WHITEHEAD MAY 27 1975 Chairman, Finance Committee WILLIAM J. vanden HEUVEL Name ID Number Alien Registration Number Chairman, Planning Committee RICHARD M. HAMMER Treasurer Nauyen Van Minh 507386 A21 200 457 MRS. ANDREW GOODMAN Secretary MRS. EDWARD S. LANDRETH Assistant Treasurer CHARLES STERNBERG Executive Director ALTON KASTNER FOIA (b)(6) Deputy Director BOARD OF DIRECTORS Ralph M. Baruch Mrs. Rose Becker Richard F. Blanchard Mrs. Jean-Jacques Boissier Joseph Buttinger Anthony D. Duke H. William Fitelson Harry S. Flemming Clifford Forster Harold S. Geneen Mrs. Sophie H. Gimbel Mrs. Sheba Strunsky Goodman Phillip Gordon Signature Funds Louise Gore Herbert G. Graetz Albert Magnin and Jr, Date Required Allen Grover John S. Hayes Mrs. Edmund Jackson Jacob K. Javits MAY 27 1975 A. E. Jolis Mrs. Margery Levenstein John L. Loeb, Jr. Mrs. Clare Boothe Luce Cecil B. Lyon B. F. McLaurin Jose Moscoso The above named family is being moved for resettlement Henry S. Moyer Zimmerman 918 Brinton Park Dr. Robert D. Murphy Claiborne Pell to Wynnewood, PA. 19096 Thomas W. Phipps under the auspices of Orea Root Howard A. Rusk. M.D. Bayard Rustin International Rescue Committee, Inc. Richard R. Salzmann Isadore M. Scott Albert Shanker Jacob Sheinkman James T. Sherwin Mrs. H. Gilbert Smith Sterling D. Spero Name and Signature of What Albert Magnin, Jx. Louis Stulberg Accredited Representative Charles J. Tanenbaum Mrs. Lawrence Copley Thaw Albert K. Trout Henri J. van Oosten Msgr. Bela Varga Daniel L. Weiner, M.D. Chester S. Williams Charles S. Zimmerman OVERSEAS OFFICES Berlin Dacca Geneva Hamburg Hong Kong Madrid Mexico City Montreal Munich Nuremberg Paris Rome Saigon Trieste Vienna Contributions to the International Reccue Committee are tax deductible. 182"
}