{
  "anumber": "A21200457",
  "id": "A21200457_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0049/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE FOREIGN SERVICE OF THE UNITED STATES OF AMERICA MEDICAL EXAMINATION OF VISA APPLICANTS, FORM FS-398"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 PLACE DEPARTMENT OF STATE 1466 FOREIGN SERVICE OF THE UNITED STATES OF AMERICA DATE OF EXAMINATION MEDICAL EXAMINATION OF VISA APPLICANTS 5MA475 At the request of the American Consul at CITY COUNTRY AGE SEX I certify that on the above date I examined NGUYEN NAME VAN MINH 60 An WHO BEARS PASSPORT NO. ISSUED BY ON 507 386 I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Chancroid Lymphogranuloma venereum Gonorrhea Syphilis, infectious stage Granuloma inguinale Tuberculosis, active Leprosy, infectious MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Psychopathic personality Chronic alcoholism Insanity Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, B, or C - diagnosis, and pertinent details*): PAROLED until: INDEF Purpose: Refuse [Officer] [Port] 5/28/75 (Date) wew Chest X-ray report things from Dr. Blood serological report YR from Dr. Other special report(s) (when needed) from Dr. TITLE DATE OF FINAL REPORT SIGNATURE MEDICAL TECHNICAL ADVISOR OF Kiksandri FORM *Continue on reverse side if necessary. FS-398 10-74"
}