{
  "anumber": "A21200457",
  "id": "A21200457_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INSTRUCTIONS, I-325"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 (Bette 3) LOLW I 181 CC: Coupon OHICE A129 OHICS of 21946 D'C' S0250 AT of A129 LOLLU I-321 LOLLE T-T2I 2619 11093003 (APO office Debr of giores) 218ueq INSTRUCTIONS GENERAL: To request allocation of a visa number for a preference or nonpreference case under Section 245. Mail the original and one copy to the Visa Control Office. When grant of permanent residence be- comes final, the copy returned by the Visa Control Office which allocates the visa number shall be appropriately endorsed, and placed in the file. In cases where permanent residence is granted without referral to the Vi sa Control Office only on original -181 need be prepared and pl aced in the file. In other cases where outstanding instructions require the Form 1-181 to be forwarded to the Visa Control Office it shall be prepared in duplica and the original pl aced in the file. Date 21102 PREFERENCE: Under Section 245, the priority date will be the filing date of one of the first six t Cpreference petitions sor OLLICE br INONPREFERENCE: Under Section 245, the priority date shall be fixed by the following factors, whichever is the earliest; (1) the priority date accorded the applicant by the consular officer as a nonpreference immigrant; (2) the date on which application Form 1-485 is properly filed, if the applicant establishes that he is a member of a profession or allperson with exceptional ability in the sciences or the arts not included in the Department of Labor's Schedule A(29 CFR 60) provided a certification is issued on that basis, or that he is within Schedule A, or that the provisions of Section 212(a)(14) of the Act do not apply to him; (3) the date on which an ap- ye proved valid third or sixth preference visa petition rbehalf was filed; or (4) the date an application for certification based on a job offer was accepted for processing by any office within the employment service system of the Department of Labor, provided the certification applied for was issued A nonpreference priority date, once established is retained by the alien even though at the time a visd number becomes available and he is allotted a nonpreference visa number he meets the provisions of Section 212(a)(14) of the Act by some means other than that by which he originally established entitlement to the nonpreference priority date. LABOR CERTIFICATION: Check and complete the block regarding on the form as appropriate in a nonpreference case. REMARKS (If the visa number requested based on Section 202(b)(1), (2), (3) or (4) or Section 203(a)(9) of the Act explain as appropriate in \"Remarks\" block. DELAY NOTICE: When the Service must obtain a visa number from the Department of State before granting permanent residence, the letter portion of this form notifying of the delay is mailed to the applicant with a copy to the attorney of record. In represented cases the attorney CONNIBA is notified of the approval of an application by furnishing him with a copy of the notice which is part of this form. HOUR XGU' nbber DexpA's IV* reos OE BIBTH 21L681 I38 KOUC Korq have wrup Asu NEMAGU W 01150152 SEX DYLE OE BIBIH 21010 as a jampa belwaueur of the 12 accolqeq: VSI 500 121 IV bloce Ot OE KECOKD Ok AMENT RESIDENCE aug 20LAICE ANILED INVICE"
}