{
  "anumber": "A21200457",
  "id": "A21200457_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Alien Certification Application for Naturalization and Citizenship, N-4-1026"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "creened by NARA, 8/17/202 16. I have have not been treated for a mental disorder, drug addiction or alcoholism. (If you have been, explain.) 17. I have have not been arrested, convicted or confined in a prison. (If you have been, explain.) 18. T have have not been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similiar action. (If you have been, explain.) 19. APPLICANTS FOR STATUS AS PERMANENT RESIDENTS MUST ESTABLISH THAT THEY ARE ADMISSIBLE TO THE UNITED STATES. EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE NOT ADMIS- SIBLE TO THE UNITED STATES AND ARE THEREFORE INELIGIBLE FOR STATUS AS PERMANENT RESIDENTS: Aliens who have committed or who have been convicted of a crime involving moral turpitude (does not include minor traffic violations): aliens who have been engaged in or who intend to engage in any commercialized sexual activity: aliens who are or at any time have been, anarchists, advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an organization, (i) or members of or affiliated with any Communist or other totalitarian party, including any subdivision or affiliate thereof; aliens who have opposition to organized government, (ii) the overthrow of government by force or violence, (iii) the assaulting or killing of government officials because of their official character, (iv) the unlawful destruction of property, (v) sabotage, or (vi) the doctrines of world communism, or the establishment of a totalitarian dictatorship in the United States: aliens who intend to engage in prejudicial activities or unlawful activities of a subversive nature; aliens who have been convicted of violation of any law or regulation relating to narcotic drugs or marihuana, or who have been illicit traffickers in narcotic drugs or marihuana; aliens who have been involved in assisting any other aliens to enter the United States in violation of law: aliens who have applied for exemption or discharge from training or service in the Armed Forces of the United States on the ground of alienage and who have been relieved or discharged from such training or service. Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain) 20. (COMPLETE THIS BLOCK ONLY IF YOU CHECKED BOX \"A\", \"B\". \"C\". or \"D\" OF BLOCK 1) APPLICANTS WHO CHECKED BOX \"A\" \"B\" \"C\" OR \"D\" OF BLOCK 1 (INCLUDING REFUGEES) IN ADDITION TO ESTABLISHING THAT THEY ARE NOT MEMBERS OF ANY OF THE INADMISSIBLE CLASSES DESCRIBED IN BLOCK 10 ABOVE MUST, EXCEPT AS OTHERWISE PROVIDED BY LAW, ALSO ESTABLISH THAT THEY ARE NOT WITHIN ANY OF THE FOLLOWING INADMISSIBLE CLASSES: Aliens who are mentally retarded, insane, or have suffered one or more attacks of insanity; aliens afflicted with psychopathic personality, sexual deviation, mental defect, narcotic drug addiction, chronic alcoholism or any dangerous contagious disease; aliens who have a physical de- fect, disease or disability affecting their ability to earn a living; aliens who are paupers, professional beggars or vagrants; aliens who are poly- gamists or advocate polygamy; aliens who intend to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor (see Instruction 10); aliens likely to become a public charge: aliens who have been excluded from the United States within the past year, or who at any time have been deported from the United States, or who at any time have been removed from the United States at Government expense; aliens who have procured or have attempted to procure a visa by fraud or misrepresentation; aliens who have departed from or remain- ed outside the United States to avoid military service in time of war or national emergency; aliens who are former exchange visitors who are subject to but have not complied with the two year foreign residence requirement. Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain) 21. I do do not intend to seek gainful employment in the United States. If you intend to seek gainful employment in the United States, state the occupation you intend to follow"
}