{
  "anumber": "A21200457",
  "id": "A21200457_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, 21 200 4457"
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 U.S. Department of Justice Immigration and Naturalization Service 300 North Los Angeles Street District Director Los Angeles, CA. 90012 MINH VAN NGUYEN Alien Number: 21 200 457 1718 S. KING STREET Petition Number: SANTA ANA, CA 92704 THIS IS NOT A FINAL HEARING CEREMONY GREETINGS: To complete the processing of your application for citizenship, the items below are needed prior to the issuance of your certificate on your coming FINAL HEARING CEREMONY. Please come in person to the I.N.S., Federal Building, 300 North Los Angeles Street, City of Los Angeles, CA on: OCT 20 1992 Date & Time: 9:30 AM ONL Y Room: #8511 8th Flr. Other applicants were scheduled on above date & time with you. So please wait for your turn. The following are needed: Two (2) identical 2 X 2 inch. photographs, unglazed, taken within the last thirty (30) days; the distance from top of head to point of chin is 1-1/4 inch.; on thin paper with light background, showing front view of face without hat. Photographs may either be in natural color or black and white. Do not bring machine-made pictures or simple snapshots. Your correct and full name written clearly on your certificate and photographs. Information concerning your personal circumstances. Accomplish G-325A Form and Fingerprint card. However, if you were already naturalized, please mail back this letter with the following information: Date of Naturalization: Certificate Number: Please address the return letter to: IMMIGRATION & NATURALIZATION SERVICE 300 North Los Angeles Street Los Angeles, CA 90012 Attn : CITIZENSHIP, Rm. 8511 VALL Please present this letter at window on designated ROBERT M. MOSCHORAK appointment. District Director"
}