{
  "anumber": "A21200457",
  "id": "A21200457_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0005/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization, N-400"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1986,
        2023,
        1997,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 U.S. Department of Justice Application to File OMB #1115-0009 Immigration and Naturalization Service Petition for Naturalization This block for government use only. You Please read the instructions before filling out this form. Section of Law 2 3/6 10183 001 004 07/09/91 14:30 1 2 N400 90.00 1. Your name (Exactly as it appears on your Alien Registration Receipt Card) 14. Place you were admitted for permanent residency (City and State) Nguyen, Minh Van PHI IC6 PA 2. Your Alien Registration number 3. Your Social Security Number 15. Date your continuous residency began in the U.S. (Month/Day/Year) A- 21-200-457 586-40-9958 May. 28, 1975 4. Your name (Full true and correct name, if different from above) 16. How long have you continuously resided in the State where you now live? Minh Van Nguyen (Number of Months) 192 months 5. Any other names you have used (Including maiden) 17. Do you intend to reside permanently in the United States? None (If No, explain fully) Yes No 6. Your date of birth (Month/Day/Year) 7. Your Sex Jul. 14, 1915 Male Female 8. Your place of birth (City or Town) Hung Yen (County, Province or State) (Country) Viet Nam 9. Was your father or mother ever a United States citizen? 18. Have you served in the United States Armed Forces? (If Yes, explain fully) Yes No (If Yes, complete all of #18.) Yes No Branch of Service (Indicate if Reserve or National Guard) None Inducted Enlisted Location where you entered (City and State) None Service began (Month/Day/Year) None Service ended (Month/Day/Year) None 10. Can you read and write English? Service number Yes No None 11. Can you speak English? Rank at discharge Yes No None 12. Can you sign your name in English? Type of discharge (Honorable, Dishonorable, etc.) Yes No None 13. Date you were admitted for permanent residency (Month/Day/Year) Reason for discharge (Alienage, conscientious objector, other) None 19. At what addresses in the United States have you lived during the last 5 years? List present address first. Street Address City county and State From (Month/Day/Year) To (Month/Day/Year) Santa Ana, Orange 1718 S. King St. County, CA Jun. 1986 Present Ono other 20. What employment have you held during the last 5 years? List present or most recent employment first. (If none, write \"None\".) Name and Address of Employer Occupation or Type of Business From (Month/Day/Year) To (Month/Day/Year) Retired SSP Senior Citizen B 1,984 Present no Other JUL 12/1997 Form N-400 (12/05/86) N"
}