{
  "anumber": "A21200457",
  "id": "A21200457_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0020/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE, A2 1 200 457"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service MEMORANDUM OF CREATION OF RECORD OF LAWFUL PERMANENT RESIDENCE Place Philadelphia, PA. File No. A21 200 457 Status as a lawful permanent resident of the United States is accorded: SEX DATE OF BIRTH Name Minh Van Nguyen M 07/14/15 Street 138 Kent Road PLACE OF BIRTH Address Upper Darby, PA. 19082 Hung Yen, Vietnam City, State.cZi 0 we FOLW NATIONALITY 12 YOURSO OL WE abblesal of au abpycation or CODA of we volice COUNTRY TO WHICH CHARGEABLE (If any) PREFERENCE (If any) Vietnam walleg IUG abbjicau MIP a cob 10 we OHOLUSA of ESCOLO IN Lebu we aHowal PRIORITY DATE petole None belwaueur lue bourou of III! form of we 96101 12 REMARKS MOIICE SOLAICO unwood wo Dobayment of 21940 503(a)(a) of we Act exbjaiu 02 abbiobliate IU Kewalk2 plock NONPREFERENCE: Section 212(a)(14) certification not required because: sos(p)(1) (5)\" (3) OL OL abbiobaje IU a voublejeleuce case Individual section 212(a)(14) certification issued Blanket section 212(a)(14) certification:issue forw as under the following provision of law: SPOLOUCE gape Sec 203(h) of the I & N Act the bu Sec 249 of the 1&& N Act Sec 214(d) & NActs weave OTHEL Private Law no of OAGU wonder of the mw a Aleg unwpel pecower the Sec 244( ol i) of the I & N Act Sec J of the Act of 11/2/66 Congress session MUDIU JUG ROLAICE 01 we Deballweur rapol bloaided we COLLICION Sec 245 of the & N Act Sec 13 of the Act of 9/11/57 Sec 101 of the I&N Act 10/28/77 for pazeq ou Mat (Other law Specify) bLOA 05 iping 28 b75 eleuce A120 betty Philadelphia, PA. (1169) OL (v) the gate au As of at bi.o (Month)? of (Day) 31510 (Year) of lie Act PORT OF ENTRY FOR PERMANENT RESIDENCE au ab- pol !2 12200 IC6 that pas!? OL A Class of admission. (Insert symbol) wat us 12 MUPIN OL you the apillis w we 01 aus E WG Deboywaw of rapol visa CLB DATE we abbucaus you us 12 a womper OF a APPROVED INS MIP RECOMMENDED BY: (Immigration Officer) (Date) ACTION LOUDLOLOLGUCE (s) 3 APR 1978 abbycation OLW 482 12 blobeli abt 3 gaje the APR 1978 COUNNIAL as gaje apall DISTRICT FOR USE BY VISA/CONTROL OFFICE PHILA., PA. nugel 20CHOU 5&2' the pe the UII gate of OUG of live (112) SIX Date TATISTICS ForeignState240H po biobalog gabjicare aceq we III cases MUGGLE Lednits the Low 18140 pe formalqeq to we A!20 Control Preference Category 00 181 U66q pe biobaleq auq b aceq IU the 10 abbiobuale auq blaceq ID the the ca262 MUGLE 2 mispont Number COWCE the CODA p^ the A!20 Coulto MPICH allocates the A120 unwpet suall pe Month of Issuance TH2\" JALOI LUG OUG cob A 10 us A!20 Contious Office MUGU dout of pe- allocation of a A120 unwpet for a OL C026 nuger 2echou Signed (Visa Office, Dept. of State) Form 1-357 delivered Form 1-151 Serial No. 11063603 mailed delivered CC: Visa Control Office, Visa Office, Department of State, Washington, D.C. 20520 for allocation of immigrant visa number. Form 1 - 181 (Rev. 4-1-77)Y (Page 1)"
}