{
  "anumber": "A21200457",
  "id": "A21200457_0017",
  "page_index": 17,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0017/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, N-430A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 OMB #1115-0064 U. S. Department of Justice Immigration and Naturalization Service Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch U.S. IMMIG & NATZ. SERVICE 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 File or A # A21 200 4.57 Date 2/26/1992 MAR 24 8 23 AH '92 EXAMINER ID: LOSBARNE You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, AND PLACE, shown below. REC'D CITIZENSHIP Date 3/24/1992 MINH NGUYEN Time 9:45 AM 1718 S KING ST SANTA ANA CA 92704 Place 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 FEDERAL BUILDING - DOWNTOWN BASEMENT. ROOM B-119 You MUST BRING the following with you: 5.2 This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED IN Alien Registration Receipt Card. ROBERT M. MOSCHORAK Any evidence of Selective Service Registration. Any documents you have which you used in connection with any entries into the United States. DISTRICT DIRECTOR Those items noted on the reverse side of this letter which are applicable to you. Tail Filing Fee. PLEASE BE PREPARED TO SPEND TWO TO THREE HOURS FOR COMPLETION OF INTERVIEW. Please KEEP this APPOINTMENT even if However, you MUST bring the Filling Fee. Form N-430A IMPORTANT - PLEASE SEE REVERSE"
}