{
  "anumber": "A21200457",
  "id": "A21200457_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/17/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1975,
        1913
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 21. What is your present marital status? Married Widowed Divorced Single 22. Complete the following regarding your husband or wife if you are currently married. First (given) name Date married (Month/Day/Year) Date of birth (Month/Day/Year) Country of birth Vac 1933 Aug. 22, 1913 Hung Yen, Viet Nam Place he or she entered the U.S. Date entered the U.S. (Month/ Day/Year) His or her Alien Registration Number Present immigration status PHI IC6 PA May. 28, 1975 A Date naturalized (Month/Day/Year) Place naturalized Present address (street and number) City and State or country None None with me Santa Ana, CA, USA 23. Complete the following if you were previously married. Total number of times you have been married 01 Name of prior husband or wife Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Year) How marriage ended INS status Alien None Citizen Alien Amore Citizen Alien Citizen 24. Complete the following if your present husband or wife was previously married. Total number of times your husband or wife has been married 01 Name of prior husband or wife Date of marriage (Month/Day/Year) Date marriage ended (Month/Day/Year) How marriage ended INS status Alien None Citizen Alien Citizen Alien Citizen 25. Complete all columns for each of your children. (If child lives with you, state \"with me' in Location column; otherwise, give the City and State of that child's residence.) Indicate your total number of children. 12 Given name Date of birth Country of birth Date of entry Port of entry Location Alien Registration No. Sex Minh- FOIA (b)(6) Male Nguyet Oct.10,34 Viet Nam Mar. 05,90 Sandiego CA SD, CA Female chau Jan.16,38 Viet Nam May 28, 5Havertown PAPHI, PA Male Nghia Feb.01,40 Viet Nam Jun.21,7 5Lawrance KS.C,Kansa Female Van Apr.20,44 Viet Nam Jun. 21, 5Havertown, PA SD, CA Male Khang Jul.13 Viet Nam Aug.12,70 OHavertown, PAJSV, FL Female Kha Auq.15,47 Viet Nam None None BK, TL None Male FOIA (b)(6) 26. Complete the following with regard to each absence you have had from the United/States for a period of six months or less since you entered for permanent residence. (If none, write \"None\".) JY Wes Ship, airline, railroad or bus company, or other means used to return to the United States Returned at (Place or port of entry) Date departed Date returned None nal 27. Complete the following with regard to each absence you have had from the United States for a period of six months or more since you entered for permanent residence. (If none, write \"None\") Ship. airline, railroad or bus company, or other means used to return to the United States. Returned at (Place or port of entry) Date departed Date returned None Form N-400 (12/05/86) N Page 2"
}