{
  "anumber": "A21200457",
  "id": "A21200457_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/17/2023, Form N-4 ( (12/05/86) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 28. The law provides that you may not be regarded as qualified for naturalization, a) knowingly committed any crime for which you have not been arrested? Yes No if you knowingly committed certain offenses or crimes, even though you may not have been arrested. Have you ever, in or outside the United States: b) been arrested, cited, charged, indicted, convicted, fined or imprisoned for (If you answer \"Yes to a) or b), give the following information as to each breaking or violating any law or ordinance, including traffic regulations? Yes No incident.) Date of Offense Nature of Offense Outcome of case, if any Where (City, State and Country) None ARRESTS 29. List you present and past membership in or affiliation with every organization, association fund foundation, party, club, society or similar group in the United States or in any other place, and your foreign military service (If none, write \"None\".) Name of organization Location of organization Membership from Membership to None 810 MS8 MO 30. Are you now, or have you ever, in the United States or in any other place, been 34. During the period of March 23, 1933 to May 8, 1945, did you ever order, incite, a member of, or in any other way connected or associated with the assist, or otherwise participate in the persecution of any person because of Communist Party? (If \"Yes\", attach full explanation) race, religion, national origin, or political opinion? Yes No Yes No aunda watingus LOCGIAGO Lednitez Aon MHNUC to 31. Have you ever knowingly aided or supported the Communist Party directly, or 35. Were you born with or have you acquired in some way, any title or order of indirectly through another organization, group orperson? (If \"Yes\" attach full nobility in any foreign state? blecning SUAQUE Yes No explanation) Aon No brong MINIUO Yes 36. Have you ever been declared legally incompetent or have you ever been 32. Do you now or have you ever advocated, taught, believed in or knowingly confined as a patient in a mental institution? Yes No supported or furthered the interests of Communism? (If \"Yes\", attach full explanation) 10 (SKG we 1011 0911 37. Are deportation proceedings pending against you, or have you ever been Yes No deported or ordered deported, or have you ever applied for suspension of 33. During the period March 23, 1933 to May 8, 1945, did you serve in, or were you deportation? Yes No in any way affiliated with, either directly or indirectly, any military unit, paramilitary unit, police unit, self-defense unit, vigilante unit, citizen unit, unit 38. When was your last federal income tax return filed? of the Nazi Party or SS, government agency or office, extermination camp, (year concentration camp, prisoner of war camp, prison, labor camp, detention camp or transit camp, under the control or affiliated with: 39. Since becoming a permanent resident of the United States, have youfiled an income tax return as a nonresident? (If'Yes\", explain fully). Yes No a) the Nazi Government of Germany? Aon Yes No 40. Since becoming a permanent resident of the United States, have you failed to b) any Government in any area occupied by, allied with, or established with file an income tax return because you regarded yourself as a nonresident? (If the assistance or cooperation of, the Nazi Government of Germany? \"Yes\", explain fully) Yes No Yes No Form N-400 (12/05/86) N Page 3"
}