{
  "anumber": "A21200457",
  "id": "A21200457_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A21200457_0004/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Vietnam",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/17/2023 UNITED STATES DEPARTMENT OF JUSTICE M IMMIGRATION AND NATURALIZATION SÉRVICE DESCRIPTION SEX MARITAL STATUS: M Processing Sheet 5 in. 2 HEIGHT: ft. COUNTRY OF FORMER NATIONALITY Vietnam File No. 21200457 3-24-92 FINAL ACTION INITIAL INTERVIEW English: Speaks ok Reads of Institution Date and 1 Denial: Date & Initials Government: INS Test OK STAND. TEST ( , withdravals Date & Initials ( , Oath Takens Certificate issued. REEXAM: Date and Initials ACTION OR DOCUMENTS STILL REQUIRED Documents presented: ( , See attached K-14 ( 3 Reexemination ARC: 7-14-15 ( , Vise File ( 1 Other DOB: POE/COE PH.1 Itb ( 1 Post Audit CID/CDL: 1683297 DOE 5-28-75 RECORMENDATION: GA/AB APPROVED LN.D DISTRICT DIRECTOR Date and Initials COMMENTS: MAR 24 1992 53/15 english Rece Barnett LOS 4393 Approval (stamp) OATH OF ALLEGIANCE ' , Modified Oath. Delete part(s) Oath with INS ( J Promise to Bear Arms. ( , Noncombat Duty Oath with Court NAME CHANGE Court No. and 1 HEREBY DECLARE. on each. that I absolutely and entirely renounce and abjure all allegiance and fidelity to that foreign I will prince. pocentate. stace. or sovereignty of whom or which I have herecofore been a subject or citizen: foreign support and defend the Constitution and the laws of the United States of America against all enemies. and domestic: that I will bear crue faith and allegiance to the same: that that 1 I will bear arms on behalf of the United States when required by the law: In this obligation freely without any mental reservation or purpose of evasion: so HELP law; ME and COD. that I take perform work of national importance under civilian direction when required by the that 1 will will perform noncombatant service in the Armed Forces of the United States when required by the law: acknowledgement whereof I have hereunto affixed my signature. 6 n minh Signature Van hguyen They form 37 be over - sted or stamped to show instructions, items requested, items received, or other perminent data which may facilitate processing. Xeep this show oa top of all material in file until initial decision is made =163"
}