{
  "anumber": "A22484466",
  "id": "A22484466_0012",
  "page_index": 12,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A22484466_0012/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE, FC-239 ( (Rev. 8-17-75)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1975
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "FEDERAL BUREAU OF INVESTIGATION UNITED STATES DEPARTMENT OF JUSTICE WASHINGTON, D.C. 20537 2 1. LOOP APPLICANT CENTER OF LOOP TO OBTAIN CLASSIFIABLE FINGERPRINTS: 1. USE BLACK PRINTER'S INK. 2. DISTRIBUTE INK EVENLY C11 INKING SLAB 3. WASH AND DRY FINGERS THOROUGHLY. 8. ROLL FINGERS FROMMAN TO MAIL AND AVCID ALLOWING FINGERS TO SLIP. 5. BE SURE EXPRESSIONS ARE RECORDED IN CORRECT ORDER 6. IF AN AMPUTATION OR DEFORMITY TO PRINT A FINGER MAKE AMOTATION TO THAT EFFECT IN THE INDIVIDUAL FINGER DELTA 7. 10 SOME PHYSICAL CONDITION MAKES IT COTAIN PERFECT IMPRESSIONS SUBMIT THE BEST THAT CALL DE ODTAINED WITH STAPLED TO THE CARD EXPLAINING THE CIR CUSSTANCES 8. EXAMINE THE COMPLETED CRINTS SEE FATHER CAN CLASSIFIED DEARING IN MIND THAT THE LINES MOST FINGERFRIN is FALL INTO THE PATTER/S SIOW ON THIS CARD (OTHER PATTERNS OCCUR LOOP INFREQUENTLY AND AREHOT SHOWI HERE). 2. WHOPE THIS CARD FOR USIDY LEAVE CANTS FOR LAVE DELTAS 2. OFFICIALS STATE AU FORE CE EMPLOY 12ED CENERA 3. U.S.COVERNMENTAGENCIESIN CONNECTION WITH C1 EAR ANCES.** 4. OFFICIALS OF FEDERALLY CHARTERED OR INSURED BANK. ING INSTITUTION TO PROMOTE OR MAINTAIN THE SECURITY OF THOSE INSTITUTIONS. THESE LINES RUNNING BETWEEN INSTRUCTIONS: DELTAS MUST BE CLEAR \"T. PRINTS MUST FIRST BE CHECKED THROUGH THE APPRO. PRIATE STATE IDENT TION BUREAU AND ONLY THOSE 3. ARCH FINGERPRINTS FOR NO DISQUALE YING RECORD HAS DEEN FOUND LOCALLY SHOULD DE SUBMITTED FOR FBI SEARCH 2. PRIYACY ACT 05 1071 COME OF LL STATE PRINT BEING RETURNED ON BASIS OF SE- AGE. PRESENT POLICY PROVIDES FOR ARCHES HAVE NO DELTAS CURITY CARD MO VETER- RETENTION OF CRIMINAL PRINTS OF ANS ADAINISTRATION CLAIM NO.(VA.). INDIVIDUALS 13 YEARS OF AGE OR LESS, FD-258 (Rev. 9-17-75) ** U.S. GOVERNMENT PRINTING OFFICE: 1975 595-270"
}