{
  "anumber": "A26875947",
  "id": "A26875947_0086",
  "page_index": 86,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0086/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Other Contract Provisions, NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Other B. Acute infections or inflammations except for: sinusitis: cholecystitis; emphysema: phlebitis; and bronchitis or pneumonitis associated with asthma Contract C. Perforation of a hollow abdominal organ. or massive stomach or intestinal bleeding when treated as an emergency by surgery or multiple transfusions. Provisions D. Sudden clot blocking an artery of the heart when proven by electrocardiogram and other diagnostic tests. E. Sudden rupture or clot of a brain artery resulting in paralysis. (continued) F. Acute failure or overactivity of glands such as thyroid or adrenal glands. G. Acute severe inflammatory disease when proven by diagnostic tests involving: arteries: cartilage: and connective or supporting tissues. For example: acute rheumatoid arthritis or periarteritis. H. Acute hemolytic anemia or acute bleeding problems due to clotting deficiency. 1. Diabetic coma in a previously unknown diabetic. J. Cancerous tumors except for those of the lips or skin. K. Non-cancerous tumors of: the breast: windpipe: lungs or lung covering: esophagus: stomach: intestines (but not rectum and anus): abdominal membrane supporting the intestines; pancreas; kidney: pituitary gland: carotid body: bones; brain: spinal cord: and the membranes covering the brain and spinal cord. 2. WHEN YOUR PARTICIPATING PHYSICIAN OR PARTICIPATING PSYCHOLOGIST MAY CHARGE YOU MORE When your participating physician or participating psychologist provides services on a usual and customary charge basis they must accept the usual and customary charge allowance as payment in full except in the following five cases: A. If you have a private duty nurse when it is not medically necessary. B. If you receive or could have received benefits or payment for the same type of services from someone else. This also applies when you could have received these kinds of benefits or payments if you did not have this contract. C. If you received payment from another person. or his insurance company. for injuries he caused. D. If the physician or psychologist is located outside Massachusetts. E. If you are treated by a Massachusetts physician or psychologist who does not have an agreement with US. (Please remember that we will not provide any benefits at all for these services unless we determine that there was an emergency and that you could not be treated by a provider having an agreement with us.) In these cases you may have to pay more. 3. SERVICES BY NON-PARTICIPATING OR NON-COOPERATING PROVIDERS A. IN MASSACHUSETTS The benefits provided under this contract. for services furnished by a provider who does not have an agreement with Blue Cross or Blue Shield. are available ONLY when in the judgment of Blue Cross or Blue Shield you require emergency services and a participating provider is not reasonably available B. OUT OF MASSACHUSETIS Page 13 We will provide benefits for the covered services that are described in this contract when they are furnished out of Massachusetts by a non-participating provider to the same extent that we would provide benefits for participating providers in Massachusetts"
}