{
  "anumber": "A26875947",
  "id": "A26875947_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE, G-29"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 NOTICE OF ENTRY OF APPEARANCE AS ATTORNEY OR REPRESENTATIVE In re: DATE April 6, 1987 Rose Garcon Petit FILE No. A26 875 947 I hereby enter my copecrence as attorney for (or representative of), and at the request of, the following named person(s): NAME Petitioner Applicant Rose Garcon Petit Beneficiary ADDRESS (Apt. No.) (Number a Street) (City) (State) (ZP Code) 48 Fuller Street Dorchester, MA 02124 NAME Petitioner Applicant Beneficiary ADDRESS (Apr. No. (Number is Street) (City) (State) (22 Code) Check Applicable Item(s) below: I am cn attorney and G member in good standing of the ber of the Supreme Court of the United States or of the highest court of the following State, territory, insular possession, or District of Columbia Massachusetts Supreme Judicial Court and cm not under c (Name of Court) court or administrative agency order suspending, enjoining, restraining, disberring, or otherwise restricting me in precticing law. 2. I cm on accredited representative of the following nemed religious, charitable, social service, or similer organization established in the United States and which is so recognized by the Board: 3. I am associated with 3 the attorney of record who previously filed a notice of appearance in this case and my appearance is ct his request. (If you check this item, also check item 1 or 2 whichever is andropriate.) 4. Others (Explain fully.) SIGNATURE COMPLETE ADDRESS Greater Boston Legal Services Great D. wall 68 Essex Street, Boston, MA 02111 NAME (Type or Princ) TELEPHONE NUMBER Gerald D. Wall (617) 357e5757eext. 3999 PURSUANT TO THE PRIVACY ACT OF 1974, I HEREBY CONSENT TO THE DISCLOSURE TO THE FOLLOWING NAMED ATTORNEY OR REPRESENTATIVE OF ANY RECORD PERTALVING TO ME WHICH APPEARS IN ANY IMMIGRATION AND NATURALIZATION SERVICE SYSTEM OF RECORDS: (Name of Attomey or Representative) THE ABOVE CONSENT TO DISCLOSE IS IN CONNECTION WITH THE FOLLOWING MATTER: NAME OF PERSON CONSENTING SIGNATURE OF PERSON CONSENTING DATE (NOTE: Execution of this box is required under the Privacy Act of 1974 where the person being represented is e citizen of the United States or an alien lawfully admitted for permanent residence.) Form G-29 (Rev.10-25-79)N (OVER) UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}