{
  "anumber": "A26875947",
  "id": "A26875947_0093",
  "page_index": 93,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0093/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 6 Index, Screened by NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Part 6 This index lists the major benefits and limitations of your contract. Of course it does not list everything which is covered in your contract. To fully understand all benefits and limitations you must read carefully through your contract Adjustments and Refunds Page 16 Telephone. Television. Radio Page Index Ambulance Services Page 10 Work Related Injury Page 11 Benefit Period Page 4 Family Contract Page 5 Benefit Table Page 3 Filing a Claim Page 19 Benefits Page 6 Hospital Services Page 6-9 Benefits after Cancellation Page 16 Immediate Benefits Page 12 Blue Cross Page 4 Individual Contract Page 5 Blue Shield Page 4 Inpatient Hospital Services Page 6. 8 Cancellation Policy Page 16 Introduction Page Changing the Contract Page 14 Limitations: Continuation of Coverage: Inpatient Consultations Page 10 Coverage after 19 Page 15 Maximum Contract benefits Page 10 Coverage after 65 Page 15 Medical Appliances Page 9 Coverage after Divorce Page 15 Medical Information and Records Page 14 Handicapped Child after 19 Page 15 Medically Necessary Services Page Marriage before 19 Page 15 Member Page 5 Offspring of a Dependent Child Page 15 Mental Disorders Page 5 Contract Page 4 Notices Page 17 Coordinated Home Health Agency Services Page 9 Outpatient Services Page 9 Coordination of Benefits Page 18 Oxygen and Equipment Page 9 Covered Inpatient Care Page 4 Physical Therapy by a Registered Deductibles Page 6 Therapist Page 9 Diagnostic X-Ray and Lab Services Page 7. 9 Physicians and Effective Date Page 5 Psychologists' Services Page 7 Enrollment Changes Page 17 Prescription Drugs Page 9 Exclusions: Reasonable Charge Page 5 Blood and Derivatives Page 11 Routine Charge Page 6 Contact Lenses Page 11 Skilled Nursing Facility Page 8 Custodial Care Page 10 Subscriber Page 6 Eyeglasses or Eye Exams Page 11 Subscription Charges Page Hearing Aids or Exams Page 11 Terminating the Contract Page Investigational Drugs Page 11 Time Limit: Pregnancy. Birth Control and Sterility Adjustments or Refunds Page 16 Services Page 11 Filing a Claim Page Private Duty Nurses Page 11 Usual and Customary Charge Page 6 Routine Physical Exams and Tests Page 10 Visiting Nursing Association Services Page 9 Waiting Period Page 12 Page 20"
}