{
  "anumber": "A26875947",
  "id": "A26875947_0159",
  "page_index": 159,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0159/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medicaid Verification Checklist, 1985"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 RETURN THIS LETTER WITH YOUR VERIFICATIONS DEPARTMENT OF PUBLIC WELFARE 1985 43 HAWKINS STREET BOSTON, MA 02114 DATE: 8/7 RETURN BY: 8166 MEDICAID VERIFICATION CHECKLIST DEAR Ms Petit PLEASE SUPPLY VERIFICATIONS THAT ARE MARKED WITH AN \"X\" BELOW. consecutive wage stubs or a written, dated statement from your PAST employer 5 Five current, GROSS, DEDUCTIONS, NET PAY & NUMBER OF HRS. WORKED EACH WEEK FOR verifying WEEKS. IF SELF-EMPLOYED, PROVIDE COPY OF CURRENT TAX RETURNS AND ESTIMATED QUARTERLY TAX FORM. Since you have requested retroactive coverage, submit proof of income for each month requested, i.e., 5 consecutive wage stubs. of checking accounts and/or savings accounts for past 24 months, i.e., accounts complet ar Proof of all savings account passbooks including account nos. and names verify copies accounts: 24 consecutive months of statements. Also, please in. reason Checking for withdrawals from savings or checking accounts of $500 or more. Please describe how much and what type of real estate you own. No. of rental units. Provide verification of expense bills on property which you own (mortgage, unit. taxes, water & sewer, insurance) and copies of rent receipts for each rental Provide photostatic copies of CURRENT CHECK(s) or OTHER WRITTEN VERIFICATION from the SOURCE of THE FOLLOWING INCOME: Provide LIFE INSURANCE DATA for EVERY POLICY which is owned by you, your surrender spouse, children exact as to: (a) company (ies) (b) policy nos. (c) face value (s) (d) cash value (s) obtain from your agent. IF BORN in the U.S., provide photostatic copies of CITIZENSHIP PAPERS, I-94 ALIEN CARD. RE- GISTRATION NOT PAPERS (green card both sides) ARRIVAL/DEPARTURE RECORDS AND IF you entered the U.S. within the past 5 years, supply alien consent form. Birth Certificates for: Copy of rent receipt, mortgage payment or utility bill to verify your current residen- MUST BE CURRENT AND SHOW YOUR NAME AND CURRENT ADDRESS* cy. Proof of School Enrollment & Attendance for: Verification of health insurance from school, if applicable. Proof of child care (must be a current written, dated & signed statement from agency or person, listing name (s) of child(ren), amount charged and frequency. Proof of relationship of each chilla to applicant. Provide copies of private health insurance premium, card and no. If payroll deductic please state so."
}