{
  "anumber": "A26875947",
  "id": "A26875947_0143",
  "page_index": 143,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0143/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/11/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 - 2 - Based on the foregoing, we conclude that you are an alien likely to become a public charge. In view of your age and lack of private medical insurance there is a very high probability that you will incur expensive medical bills within the foreseable future that your sponsors simply could not afford to pay-out-of-pocket in view of their income and primary support obligations to their three children. While the District Director may, as a matter of discretion, allow your sponsors to post a Public Charge Bond in your behalf pursuant to Section 213 of the Act, such a bond to assure you would not become a public charge would be pointless since we are not questioning the good intentions of your sponsors but their inability to pay exhorbitant but expected medical bills without insurance. The fact that you have apparently already applied for Medicaid, a publicly funded program to pay for the medical care of the indigent, underscores our analysis. The record further indicates that you entered the United States on December 30, 1984 as a \"B-2\" visitor based on a visa issued by the American Embassy in Port-au-Prince on December 13, 1984. At your sworn interview you insisted that 'you told the American Consul that you were coming only to \"visit\" the United States for a period of \"one year\". You denied that you had a preconceived intention which you concealed from the Consul to immigrate to the United States despite the fact that you came only with a one-way airline ticket and your actual application for permanent residence was filed only one month after your arrival here. You were completely unable to articulate any objective explanation of why you have chosen to remain in the United States with your daughter. A copy of yor nonimmigrant visa application has been obtained from the American Embassy and reveals that you did not request a stay of one year in the United States but only \"8 days\" (item #29) to come to \"Boston\" for \"tourism\". Section (212) (a) of the Act provides for the exclusion of: 11 Any alien who seeks to procure, or has sought to procure, or has procured a visa or other documentation, or seeks to enter the United States, by fraud, or by willfully misrepresenting a material fact\". The definition exposition in case law precedents binding upon the Immigration Service concerning Section 212(a)(19) of the Immigration and Nationality Act is found in Matter of S & B-C 9 I & IN Dec. 436. The case defines the materiality of a misrepresentation It is material if \"(A) the alien is excludable on the true facts, or (B) the misrepresentation tends to shut off a line of inquiry which is relevant to the alien's eligibility and which might well have resulted in a proper determination that he be excluded\". Had your true intention of seeking to remain indefinitely in the United States been known to the Consular Officer you would have been ineligible to receive a visitor's visa (Section 214(b) and Section 101(a)(15)(3) because you lacked a foreign residence which you had no intention of abandoning and did not immediately qualify for an invigrant visa. By failing to admit what we now hold to be the true facts surrounding your walver visitor's visa, you have also failed to avail yourself of the possibility of (Form I-601) pursuant to Section 212(i) of the Act. Accordingly you are statutorily ineligible for admission into the United States or for an immigrant visa due to your violation of Section 212(a)(19) of the Act."
}