{
  "anumber": "A26875947",
  "id": "A26875947_0220",
  "page_index": 220,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0220/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "TO BE COMPLETED FOR APPLICANTS WITH ACTIVE TUBERCULOSIS OR SUSPECTED TUBERCULOSIS, 2-41"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 TO BE COMPLETED FOR APPLICANTS WITH ACTIVE TUBERCULOSIS OR SUSPECTED TUBERCULOSIS A. STATEMENT BY APPLICANT: Upon admission to the United States I will go directly to the physician or health facility named in Section B; will present all X rays used in the visa medical examination to substantiate diagnosis; will submit to such examinations, treatment, isolation, and medical regimen as may be required; and will remain under the pre- scribed treatment or observation, whether on inpatient or outpatient basis, until discharged. Date Signature of Applicant APPLICANT'S SPONSOR IN U.S.: Arrange for medical care of the applicant and have the physician complete Section B. B. STATEMENT BY PHYSICIAN OR HEALTH FACILITY (May be executed by a private physician, health department, other public or private health facility, or military hospital. NOTE Upon arrival of the alien in the U.S., Form CDC 4.451 - Report on Alien with Tuberculosis Waiver\"-will be sent to the address given below.) I agree to supply any treatment or observation necessary for the proper management of the alien's tubercu- lous condition. I agree to submit Form CDC 4.451 to the health officer* named below either (a) within 30 days of the alien's reporting for care, indicating presumptive diagnosis, test results, and plans for future care of the alien; or (b) 30 days after receiving.Form CDC 4.451 if the alien has not reported Satisfactory financial arrangements have been made. (NOTE: This statement does not relieve alien of sub- mitting such evidence as consul may require to establish that alien is not likely to become a public charge.) I represent (enter X in the appropriate box and give complete name and address of facility): 1 Local Health Department Outpatient Clinic 3 Other Public or Private Health Facility 2 Military Hospital 4 Private Practice Address (If military, enter name and address of receiving hospital) # Military submits direct to Date Signature of Physician Center for Disease Control, Atlanta, Ga 30333 APPLICANT'S SPONSOR IN U.S.: If medical care will be provided by a physician who checked box 3 or 4 in Section B, have Section C completed by the Local or State Health Officer who has jurisdiction in the area where the applicant plans to reside in the U.S. Provide the Health Officer with the address at which the applicant plans to reside in the U.S. C. ENDORSEMENT BY LOCAL OR STATE HEALTH OFFICER Date Endorsed by: Signature of Health Officer Health Officer: Endorsement signifies recognition of the physician or facility for the purpose of providing care for tubercu- losis. If the facility or physician who signed in Section B is not in your health jurisdiction and is not famil- iar to you, you may wish to contact the health officer responsible for the jurisdiction of the facility or physician prior to endorsing. Enter name and address of the Local Health Department to which the \"Notice of Arrival of Alien with Tuberculosis Waiver\" should be sent when the alien arrives in the United States. Local Health Department Address 2-41"
}