{
  "anumber": "A26875947",
  "id": "A26875947_0210",
  "page_index": 210,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0210/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE DATE: 02/12/93 ROSE CARCON PETIT FILES A26875947 9425 NW 2ND PLACE MIAMI FL 33150 PLEASE COME TO THIS OFFICE: 7880 BISCAYNE BLVD, ROOM 490, MIAMI, FL 83138 OH: 05/03/93 AT: 7:45 AM regarding your application for adjustment of status. Failure to respond to this request may result in denial of your application BE ON TIME. A late arrival can cause you a long delay or postponement of the interview EMERGENCY If you must cancel this appointment because of an emergency please indicate below the nature of the emergency and attach evidence of the emergency. Sign and date this form and return it to this office immediately. BRING WITH YOU: This letter; an interpreter (if you do not speak English): all documents listed below (any document in a foreign language must be accompanied by a certified English translation) Documents submitted must be originals or certified copies that bear the seal of the issuing authority Provide an addi- tional photocopy of any original document you wish returned BRING YOUR PASSPORT, birth certificate & original entry document (2-94) PROOF OF SUPPORT. You and/or any employed family members must present from each employer a letter on official stationery that indicates the position, whether the position is temporary or permanent current salary, and date of initial employment IF YOU HAVE AT ANY TIME BEEN ARRESTED in any country you must submit the following for EACH arrest: arresting officer's report: indictment 05.£ applicable) and a document showing the disposition of the case. CURRENT MEDICAL REPORT Aug soon as you receive this notice, you are required to makecbrrangements for your medical examination with one of the medical examiners on the attached list of INS-approved physicians who will perform the medical examination, required Laboratory procedures and any necessary chest x-ray, NOTE: Applicants 2 years of age or older are required to have DY tuberculin skin test (Mantoux) as part of the medical examination followed by a chest x-ray examination of 5mm or greater. ROUTINELY APPLICANTS UNDER 15 YEARS of ACE ARE NOT REQUIRED TO HAVE THE TESTS AS PART OF THEIR MEDICAL EXAMINATION IF YOU ARE THE BENIFICIARY OF AN APPROVED VISA PETITION: Bring copies of all documents submitted with that petition"
}