{
  "anumber": "A26875947",
  "id": "A26875947_0087",
  "page_index": 87,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0087/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screened by NARA, 8/11/22023, Page 14"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 IMPORTANT: No benefits are available for the services of a non-participating skilled nursing facility in or out of Massachusetts You can ask your provider if he or she has an agreement with us. If you prefer, you can contact your Customer Service Office listed at the end of this certificate. 4. IF YOU HAVE I EGAL RIGHTS AGAINST SOMEONE FLSH You may have a legal right to recover some of the costs of your health care from someone else because another person has caused your illness or injury. When you have a right like that. you must let us use it if decide to recoverany payments we have made for the illness or injury. However, if you use this right to recover money from someone else. you must repay us for the payments we have made. Our right to repayment comes first. It can be reduced only hy our share of your reasonable cost of collecting your claim against the other person. It is not reduced even il you are not paid for all of your claim against the other person or if the payment received is described as payment for other than health care expenses. You must give us information and assistance and sign necessary documents to help US receive our repayment. You must not do anything which might limit our repayment. 5. WE MUST HAVE ACCESS TO YOUR MEDICAL OR OTHER RECORDS You agree that when you claim benefits under this contract. you give us the right to obtain from any source all medical records or other information that we need This information will be kept confidential. 6. SUBSCRIPTION CHARGES A. PAYMENTS - The amount of money which you pay to Blue Cross and Blue Shield fo your benefits under this contract is called your \"subscription charge\". We will send you a bill which tells you the amount of money to pay us and the date your payment is due. B. CHANGES - We may change your subscription charge. If we do, the change will apply to all contracts of thistype not just to your contract. Each time we change the subscription charge we will send you a notice at least 15 days before the change takes effect. The notice will usually be included with your bill. 7. WE MAY CHANGE YOUR CONTRACT We may change a part of your contract. II we do. the change will apply to all the contracts of this type. not just to your contract We will send a notice each time we change part of your contract We will usually include the notice with your bill Your contract will be changed whether or not you in fact received our notice The notice will describe the change being made. You can get the actual language of the amendment to your contract by asking our Home Office or any one of our Customer Service Offices These Offices are listed at the end of this certificate The notice will tell you the effective date of the change. The change will apply to all benefits for services you receive on or after the effective date. There is one exception. If you are an inpatient on the effective date of the change. we will not apply Page 14 the change to you until you are discharged from that inpatient stay"
}