{
  "anumber": "A26875947",
  "id": "A26875947_0084",
  "page_index": 84,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0084/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Limitations and Exclusions, NARA Form 10-2345"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Limitations routine nursing care: rehabilitation of a chronic condition: training or help in personal hygiene: or supervision in daily activities. and F. Services that are rendered to all patients as a result of hospital requirements G. The travel time and related expenses of a provider who is rendering medical services. Exclusions H. Services rendered to someone other than the patient. (continued) I. Services related to: (1) pregnancy: (2) birth control: or (3) sterility. J. Services related to mental disorders, except for an inpatient in a participating general hospital as described in Part 2 on page 6. K. Eyeglasses: contact lenses; hearing aids: or exams to prescribe. fit or change them. 1.. Whole blood: packed red blood cells: and blood donor fees. M. A drug which we determine is investigational or which has not been approved for general sale and distribution by the United States Food and Drug Administration N. Personal comfort items such as: telephone: radio: television: or personal care services. O. An illness or injury which we determine arose out of and in the course of your employment. P. A service which you are not required to pay for or which you would not be required to pay for if you did not have this contract. Q. A service for which benefits are available under another Blue Cross or Blue Shield Certificate. R. A separate fee for services rendered by: interns; residents: fellows: or other physicians who are salaried employees of a hospital or other facility. S. An illness or injury for which benefits in one form or another are available, in whole or in part. through a government program. or would have been available if you did not have this contract. A government program includes a local, state, national or foreign law or regulation which provides or pays for health services. It does not include Medicaid. We will not provide benefits if you could have received government benefits by applying for them on time. T. Charges that you incur when. for your own convenience. you choose to stay in a covered facility beyond their discharge hour. U. A service furnished by a provider to a member of his or her immediate family. V. Private duty nurses. W. The services of a Blue Shield provider in a facility in Massachusetts that does not have an agreement with Blue Cross. except in an emergency as determined by Blue Shield 2. WE PROVIDE BENEFITS ONLY FOR SERVICES WHICH ARE MEDICALLY NECESSARY We will not provide benefits for a service which is not medically necessary to diagnose or treat your illness, injury, symptom or complaint. A. What We Mean by \"Medically Necessary\" - To be medically necessary. a service must be: Page 11 Consistent with the diagnosis and treatment of your condition: In accordance with standards of good medical practice: Not solely for your convenience. or the convenience of your family or your provider. and"
}