{
  "anumber": "A26875947",
  "id": "A26875947_0163",
  "page_index": 163,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0163/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Acte d'inscription de mariage religieux, N° 1701 E"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 REPUBLIQUE D'HAITI. 35 JUSTICE TOUS REPUBLIOUS D HAITY POU B. C, 367 NOTE DES No 1701 E Gde Gde Acte d'Inscription de mariage religieux IPiE TIMBREC Une Gourde LIBERTE EGALITE FRATERNITE REPUBLIQUE D'HAITI L'an mil neuf cent soixante trieze, N°191.- dis Ostobre. An 1 11/03 de l'Indépendance et le evereredi Nous, Officier Jacques de l'Etat Civil Au: de la Oriol Acction Est de Part all twice Cours les pièces à nous transmises par be here Lafoutant, Lure de ta Saroisse die Sonssigné; save conformément à l'article 6 de la loi du 16 Décembre 1929 modifié par celle du , 26 Janvier 1945. Constatons, enregistrons et certifions qu'après les publications dûment faites, aucune opposition n'ayant été signifiée Au. susdit Ministre religieux; Hom sertificat fri stetural word me a Villan Ville Monsieur lieve Milbert magny, Comftable deverset Knt main dett âgé de ringt unfaus domicilié à du fruise, shows suptoit immetical cocus l'auves w fils et de Birisuie Laulest evelfoyer do miciliée à Kntall service, de Brininlle flagory ellartientier. domicilié à fort are louise all N: 176 st' pulant t pour Mui et els are your thermoul d'une part; Et dureaut immuse defor sucif Illasic sice thouse fah Petit. faitely dastiflo graftle, âgée de rungt sept and it Act an domiciliée à York all Juice, # certificat prescriptional l'an like dg fraudfeau settl tailleus domiciliée àu Cap faitien, from No st palant pour elle et eu sou Alous honorwel, et de Idbra scene Yaul bouturigere do miciliée àu Caf Haitier, d'autr part Me ill cocus, all Se sent présentés le quatre doilt mil neuf cent soixante treine à six 176 of2 # heures quising du soir Bu &' Egglise du Sacre Cocus pour contracter mariage. A la question s'ils consentaient à se prendre pour époux, ils ont répondu chacun séparémentnet aff rmativement, en présence du susdit Ministre religieux et de 10) tricleal Golu, profes- Toucau few frience âgé de Might mean and, domicilié à , 20) were effectative audsium âgée de truute trais aus, domiciliée à lost are services I's L'acte ont été dressé ainsi par unis le par susdit le mariage. Ministre religieux a été signé par lui (A) P. Laforetant En foi de quoi avens dressé et signé le présent acte conformement s à la Loi. (off tu. Oniol- deu reurous ell liverge bous. Récénissé de l'Administration Générale des Contributions. with Signé : the M No. 069 Série NN- 41812 P-au-P"
}