{
  "anumber": "A26875947",
  "id": "A26875947_0194",
  "page_index": 194,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0194/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U. S. Department of Justice Immigration and Naturalization Service N-4 Adjudication Processing Worksheet, N-650B ( (Rev. 11/1/98)"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U. S. Department of Justice Immigration and Naturalization Service N-400 Adjudication Processing Worksheet A# 26 875 947 INTERVIEW Initials Date Remarks Appeared for interview RS JUN 0 7 2001 No show on (Date) (Initials and Current Date) A-file present at time of initial interview Rs JUN 07 2001 OFFICER Initials Date Remarks (Only circle standard annotations when and if applicable) Met L 3 312 requirements at initial interview USE Rs JUN 0 7 2001 (55/15) (50/20)(65/20) Appeared for Re-Exam DS 8-7-01 No show on: (Date) (Initials and Current Date) N645 accepted see left D18-7-49 Met ยง 312 requirements at Re-Exam If applicable, met ยง 312(b) disability exceptions Ds 8-7-07 N648 acceptel.see Established physical presence/residence Ds 8-7-01 Ds 8-7-01 over 75yis 308-2-07 Established good moral character (See Sworn Statement) (Criminal Record in File) Established attachment to Constitution (If modified oath, circle notation in remarks) Ds 8-7-01 (Religious Objection) Met other eligibility requirements (put reason(s) in remarks) (See Sworn Statement) Recommendation, if supervisory review required CIRCLE RECOMMENDATION: (CRIMINAL) and/or Ds 8-2-01 1st (GRANT) (DENY) (WITHDRAW) (T-FILE) and/or (DISABILITY) CIRCLE RECOMMENDATION: If necessary, enter 2ND (GRANT) (DENY) (WITHDRAW) SUPERVISORY CONCURRENCE WITH Initials Date Remarks (Indicate non-concurrence issue(s) within remarks) OFFICER'S RECOMMENDATION ARY 08-07-01 OFFICER Initials Date Remarks (Circle decision) Indicate decision under remarks free Reverifier's 8-7-01 Signature (GRANTED) (DENIED) / Date (WITHDRAWN) Reverified 8/7/01 Form N-650B (Rev. 11/1/98)"
}