{
  "anumber": "A26875947",
  "id": "A26875947_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, Page 18"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 We do not guarantee that you will be admitted to any facility or that you will get a special type of room or service II you are admitted to a facility. you will be subject to all of its rules. I his includes its rules on admission. discharge and the availability of services. We are not liable for injuries or damages resulting from the acts or omissions of a provider. 18. SERVICES BY MORE THAN ONE PHYSICIAN Except as described in the benefit section on page 7. we will not provide benefits for medical services that are furnished by MORE than ONE physician. 19. COORDINATION OF BENEFITS INTRODUCTION We will apply \"coordination of benefits\" to all the benefits described in your contract. The coordination of benefits program, known as COB. applies to you if YOU or ANY of your dependents have another plan which provides coverage for your hospital. medical, dental or other health care expenses. This program is designed to prevent people from making a profit from health insurance by collecting more than the actual charge for their covered health care services. This practice eventually leads to increased costs of health care for all of us. COB regulates all benefit payments for covered services so that the total payments received from all insurance programs do not exceed the total charge for those covered services. WE will decide which plan should provide benefits first. The plan that provides benefits first is known as the primary plan. The primary plan is responsible for providing benefits to the full extent of their coverage. The plan that provides benefits next is known as the secondary plan. The secondary plan provides benefits towards any remaining balance of covered services as long as the payment. when added to the primary plan's payment. is not more than the total amount of the covered benefit expenses. HOW TO DETERMINE THE PRIMARY PLAN We will decide who is the primary and secondary plan by the same rules that are used throughout the insurance industry. Those rules are: A. If only one of the plans has COB, the plan that DOES NOT is the primary plan. B. When both plans have COB the rules listed below will apply: 1. If the patient is the subscriber under one plan and a covered dependent under another, the plan through which he or she is the subscriber is the primary plan. ge 18 2. If the patient is a covered dependent under the plan of both a male and a female subscriber, the male's plan is the primary plan."
}