{
  "anumber": "A26875947",
  "id": "A26875947_0156",
  "page_index": 156,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0156/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "femme"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEgreement de Travail, 156 ( (Rev. 6/82)"
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 17 DEC 1984 44-1 1 NOM DE FAMILLE Te ou @ figure BUK votre passeport NE PAS ECRIRE DANS CETTE CASE B-1 B-2 B-1/B-2 PETIT Other PRI NOW USUEL ET AUTRES PRENOMS (Ohis qu'ils figurent 60 Rose 2 votre passaport Jaccon Idora Mult or Mos. 3 AUTRES NOMS (nom de jaune fille religieux de professign Issued/ pseudonymeal Refused on by 4-114 Baturie 4 DATE DE NAISSANCE (jour, mois. 7. No DU PASSEPORT Refused Section annéel 11.12.1905 84 1-20806 5 LIEU DE NAISSANCE (villa localité) DATE DU PASSEPORT Reviewed by Guzener The 6 NATIONALITE DATE D'EXPIRATION DU PASSEPORT 6 DOMICILE iv complete is numéro de appartement et As zone postular Lours ,First 80 A 9 NOM ET ADRESSE DE L'EMPLOYEUR ou DE L'ECOLE (un numéro the botte postale n'est pes acceptable) For 10 NUMERO DE TELEPHONE 11 NUMERO DE TELEPHONE DU DOMICILE DU LIEU DE TRAVAIL Non 12 SEXE 13 COULEUR DES 14. COULEUR DES Masculin CHEVEUX YEUX Féminer Resta 15 TEINT 16 TAILLE 17. ETAT CIVIL Marié(e) Célibataire 18 SIGNES PARTICULIERS Vauf(ve) Divorcé(e) Séparé(e) 15 NOMS ET LIENS DE PARENTE DES PERSONNES vous 25. PROFESSION ou EMPLOI ACTUEL ACCOMPAGNANT (NOTE Une demande de visa devre #tre (pour les retraités. indiquer l'ancienne produite séparèment per cheque voyageur V compris les enfants profession) mineurs of case on bes Age) 26. QUELLE SERA VOTRE ADRESSE AUX ETATS-UNIS? 20 AVEZ vous DEJA FAIT UNE DEMANDE DE VISA D'IMMIGRANT ou DE NON-IMMIGRANT POUR LES ETATS-UNIS? Boston non oui un vise été accordé Quand? 27. QUEL EST LE BUT DE VOTRE VISITE? was été refusé Senre do visa? 21 UN VISA DES ETATS-UNIS vous A-T-IL JAMAIS ETE RETIRE? non oui (Dans l'affirmative expliquez) 28. DATE PREVUE POUR VOTRE ARRIVEE AUX ETATS-UNIS? 22. LES DETENTEURS DE VISAS DE VISITEURS NE DOIVENT NI Kine TRAVAILLER NI ETUDIER AUX ETATS-UNIS 29. QUELLE SERA LA DUREE DE VOTRE SEJOUR AUX ETATS-UNIST AVEZ-VOUS L'INTENTION DE TRAVAILLER AUX U.S.A.? oui non (Dans l'affirmative. expliquez) To 30. AVEZ-VOUS L'INTENTION D'EFFEC TUER D'AUTRES VOYAGES AUX U.S.A.? 23. AVEZ-VOUS L'INTENTION D'ETUDIER AUX U.S.A.? oui non (Dens l'affirmative veuillez écrire le nom now et l'adresse de récole tels que portés sur le formulaire 1-20) 31. vous ETES-VOUS JAMAIS RENDU AUX ETATS-UNIS? non oui 24 QUI ASSURERA VOTRE SOUTIEN FINANCIER AINSI QUE Quand? vos BILLETS? Durée du séjour? 7220nic REPONDEZ A TOUTES LES QUESTIONS DEMANDE DE VISA DE NON-IMMIGRANT FIGURANT AU VERSO DE CE FORMULAIRE OPTIONAL FORM 156 (Rev. 6/82) PAGE 1 DEPARTMENT OF STATE"
}