{
  "anumber": "A26875947",
  "id": "A26875947_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Certification For Disability Expections"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U. S. Department of Justice OMB # 1115-0205 Immigration and Naturalization Service Medical Cerfication For Disability Expections Part I. THIS SECTION TO BE COMPLETED BY THE APPLICANT (Please print or type information) Last Name First Name Middle Name Social Security Number Petit Rose 016-66-8872 Address Alien Number Ho N W 186 ter 26875947 City State MiAMi FL Zip Code 33169 Telephone Number Date of Birth Sex 305 651- 2819 12/1/05 95 I, ROSE Petit authorize Dr. ALMA R. SANJUR (Applicant's Name) (Licensed medical doctor or licensed clinical psychologist) to release all relevant physical and mental health information related to my medical status to the INS for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty of perjury pursuant to Title 28 U.S.C. Section 1746, that the information on the form and any evidence submitted with it is all true and correct. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to civil penalties under 8 U.S.C. Section 1324c. Signature Rose Pecit Date 7-5-2001 Part II. THIS SECTION TO BE COMPLETED BY A LICENSED MEDICAL DOCTOR OR LICENSED CLINICAL PSYCHOLOGIST (see instructions) The individual named above is applying for an exception from the English language and U. S. history and civics tests required of applicants for naturalization. The Immigration and Naturalization Service's regulations require that applicants for an exception based on disability submit this certification form, completed by a licensed medical doctor or licensed clinical psychologist, along with a completed application for naturalization (Form N-400). Please answer the following questions as clearly and completely as possible, using common terminology and complete words and phrases. 1. Date of your most recent examination of the applicant. 7-5 19 2001 2. Is this your first examination of the individual? Yes No If yes, who is the regular attending physician? 3. Based on your examination, describe any findings of a physical or mental disability or impairment which, in your professional medical opinion, would prevent this applicant from demonstrating knowledge of basic English language and/or U.S. history and civics. Describe in detail. If applicant has a mental disability or impairment, please provide DSM diagnosis. who's been a patient for the past 18 monthol Patient Mrs. Petit Rose is a 95 y.o. female has an extensive medical history OF HYPERTENSION. diabetes mellitus and a cerebral vascular accident (stroke) that has diminished her mental capacity Mrs. Rose has developed senile dementia due to the above mentioned medical problems and in my professional medical due opinion, she is unable to demonstrate any knowledge to her incapacitated memory. Form N-648 (06/24/97) Page 3"
}