{
  "anumber": "A26875947",
  "id": "A26875947_0109",
  "page_index": 109,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0109/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, PUBLICATION NUMBER SR-7130, AUGUST, 1983"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Children who may be covered include stepchildren, legally adopted children, foster children, and other children who are financially dependent upon you and live with you in a regular parent-child relationship. If you enroll your family within one month of your first day of active work, or if you enroll your spouse within one month of your marriage, no medical examination is required. If you enroll your dependents after these dates, proof of their good health may be required. Effective Dates If you enroll your dependents within one month of your first day of active work, or if you enroll your spouse within one month of your marriage, their coverage will become effective on your first day of active work or the date of your marriage, providing you have authorized payroll deductions to begin. If you enroll your dependents or spouse after these dates, their coverage will be subject to the consent of the insurance company and will become effective on the day the insurance company accepts their proof of good health. Amount of Coverage For your dependents, the amount of coverage is determined by a multiple of your annual base rate of pay, depending on your spouse's age. Your annual base rate of pay is your basic annual salary or wage, including any sales or executive incen- tive pay, but not including overtime, shift premium, bonuses, or other forms of extra income. If your spouse is under 30, he or she will be covered under the highest benefit amount, or 100% of your annual pay. If your spouse is age 65 or older, he or she will be covered under the lowest benefit amount, or 40% of your annual pay. The maximum amount of coverage for your spouse is $100,000. Each eligible dependent child's amount of coverage will be equal to 25% of your annual base rate of pay. The maximum amount of coverage for each eligible dependent child is $25,000. 2 PUBLICATION NUMBER 59-7130, AUGUST, 1983"
}