{
  "anumber": "A26875947",
  "id": "A26875947_0117",
  "page_index": 117,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0117/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Supplemental Life Insurance Plan, NARA, 8/11/2023"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Effective Dates: Upon enrolling in the Supplemental Life Insurance Plan within one month of your first day of active work, or within one month of becoming married, your coverage will become effective on your first day of active work or the date of your marriage, providing you have authorized payroll deductions to begin. If you enroll late, coverage will become effective on the day the insurance company accepts your proof of good health. Cost Your cost for Supplemental Life Insurance depends upon the type of coverage you choose. If you select High Option coverage, the cost will be .005 (one-half of one percent) of your monthly base rate of pay. Low Option coverage will cost .0025 (one-fourth of one percent) of your monthly base rate of pay. Monthly base rate of pay is your basic monthly salary or wage, including any sales or executive incentive pay, but not including overtime, shift premium, bonuses, or other forms of extra income. LIFE INSURANCE COVERAGE The amount of Supplemental Life Insurance coverage is determined according to the age group you are in and your annual base rate of pay. (To find your coverage, see the table in Amount of Coverage.) The amount of insurance will automatically be adjusted as your pay and age group change. Increases in the amount of insurance will become effective only when you are actively at work. If you continue to work after age 65, your Supplemental Life Insurance will continue in force. (See chart in Amount of Coverage.) If you are a retired employee who is rehired by the company you may reenroll in the Supplemental Life Insurance Plan. The amount of your insurance coverage can also be determined by using the table under Amount of Coverage. 2 PUBLICATION NUMBER 59-7123, JUNE, 1985"
}