{
  "anumber": "A26875947",
  "id": "A26875947_0082",
  "page_index": 82,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0082/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Extended Benefits, 0"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Extended A. Medical care. B. Services to interpret diagnostic x-ray and lab tests. Benefits C. Consultation services by a physician other than the attending physician. D. Radiation therapy and x-ray therapy. continued) For benefits for services of a non-participating physician. see page 13. 5. AS AN OUTPATIENT FOR PARTICIPATING PHYSICIANS SERVICES: You have the right to benefits as follows: BENEFIT SUMMARY CHART Extended Benefits Patient Balance 80% of the routine charge for medical services by a physician. You pay 20% of the routine charge. NOTE: No benefits are available for the treatment of mental disorders. No benefits are available for services related to pregnancy. For benefits for services of a non-participating physician. see page 13. 6. AS AN OUTPATIENT FOR OTHER HEALTH SERVICES AND SUPPLIES: You have the right to benefits as follows (except for mental disorders or pregnancy benefits. see page 11): BENEFIT SUMMARY CHART Extended Benefits Patient Balance 80% of the reasonable charge for the services and supplies You pay the charge in excess of 80° of the reasonable harge described in A. through I. below. for the services and supplies described in A. through I. below. A. Special services for medical care in the outpatient department of a participating general hospital. B. Drugs which require a prescription under the law. C. Diagnostic lab services not covered elsewhere in this contract. D. Oxygen and equipment for its administration E. Physical therapy by a registered physical therapist F. Part-time nursing services and physical therapy from a participating visiting nurse association. G. Services in your home by a participating coordinated home health agency. No benefits are provided for meals. personal comfort items. and housekeeping services. 11. Medical appliances: (1) reasonable purchase price: or (2) the rental charge upto the reasonable purchase price. Benefits Down O are limited to the least expensive and suitable type of appliance. as determined by Blue Cross"
}