{
  "anumber": "A26875947",
  "id": "A26875947_0224",
  "page_index": 224,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0224/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice, Immigration and Naturalization Service, I-485 ( (245)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE Processing Sheet Application or Petition Form No. I-485 (245) File No. 26 875 947 CHECK ONE SUBJECT TO FOREIGN STATE CHARGE EXEMPT FOREIGN STATE CHARGE (IMMEDIATE RELATIVE OR SPECIAL IMMIGRANT) SECTION PRIORITY DATE COUNTRY OF CHARGEABILITY PREFERENCE 203(a) ) NONFREFERENCE 203(3)(8) DOCUMENTS NEEDED MEDICAL & INTERVIEW DISTRIBUTE (If checked) (If Checked) Date Date Mailed B/C Medical Delay Notice M/C Interview I-181 to State Photos Rescheduled G-32SA Sheet #1 Support Medical 2 I-508 Interview 3 I-88 4 5-2-85 Other Consulates: (Location) CATEGORY A Prepare I-486 with date 45 days beyond date G-325A sent. Type I-151, omitting entry date, place and lamination. Insert I-151 in file with 245 packet (I-357; G-153). CATEGORY B- Prepare I-486, oritting date and insert in file. Type I-151, omitting entry date, place and lamination. Insert in file with 245 packet (I-357; C-153), B(+ Citz lifetasis. thet OFFICER'S INSTRUCTIONS: -24.9511 - 2- pet Natz z 3YRS ago son-ii-low reput NO ID usidist Ct - Bos Hoed for Docs B- husb in Heite admits- - but one way redeet DISTRIBUXE (If Checked): says come TOVISH for \"1YR\" neg. NFU prince dane I-101 to State Dept. XXXXXXXXXXXXXX F-601 I-181 to Consulate at I-131 to Sel. Serv. XXXXXXXXXXXXXX E This for may be overprinted or stamped to show instructions, items requested, items received, or other pertinent data which may facilitate processing. Keep this ahool OD top of all material In fila until Initial decision 10 made Form I-458 (Rev. 11-1-70)"
}