{
  "anumber": "A26875947",
  "id": "A26875947_0167",
  "page_index": 167,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0167/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Acte de Notoriété de, 4 4 5383"
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 ALPLH. FUED MARK 20 20 MMM No 45383 Grass. LIBERTY EGALITE REPUBLI U-1 DUNATION Extrait dos minutes du greffe du tribunal de Paix-- de Port-au Prince, Section EST.- Vings Continue de Gourdes Aujourd'vui luridi premier jour du mois d&Octobre mil neuf cent Acte do Notoriété de quatre vingt quatro. An, 18lièmo de l'Independance a dix heures du- matin. Rose Garcon Dito Idora- Par devant nous aoul Saint-Cyr, Juge de Pair do la capi Pierre Paul née a Quartier tale Section EST, assisté du greffier Louis Edner Duverneau.-- Morin---- le ler. décem-- bre 1905 des oeuvres légi- A comparu la Citoyenne Rose Garcon Dite Idora Pierre times dos epour Cersius--- Paul, propriétaire, demeurant ct domiciliée a Port-au-Prince, iden Pierre-Paul et de la dame--- tifiée au No: Loquelle nous a déclaré que sor. acte est- née Jeancilia Pierre, tous-- égaré, que toutes les recherches effectuées dans les end roits-- dewo décédés. désignés par la loi pour le retrouver se sont revelées vaines et- infructueuses; que son acte de naissance lui fait actuellement-- besoin pour s'identificr aux fins de droits.Le comparante confor- ment aur articles 70-71 du code civil a fait convaraitre en notre pretoire trois temoins qui attésteront sous la foi du serment qu' elle est néo a Quartier Morin, le ler. décembre 1905 des oeuvres de epour Cersius Pierre-Paul et de la dame née Jeancilia Pierre, tous dew: décédés.- ON COMPARU: Philippe ind au No:9090-V Gerard Louis ind au No:4343-B Fedner Louis ind au No:4343-3 Tous propriétaires demeurant et domiciliés a Port-cu-Prince.hai-- tiens, majeurs, jouiscant de lours droits civils ot politicuses. April lecture a cu. faite per le greffier do l'emposé ui précide nous- ont déclaré, certifie, attesté connaitre parfeitement bien la nomme Rose Carcon Dite Idora Pierre-Pa et savoi surtout su'elle est- née a Quartier Morin, le ler décembre 1905 dcs epout légitimos dos epout Cersius Pierre-Paul et de la dame nee Jeancilia Piezwe tous dew décédés. De tout quoi avous dressé et clos le présent procis verbal que nous avons signé avec les comparants et le greffier. AITSI SIGNL: Philippe Emmanuel, Gerard Louis, Fedner Louis, Raoul- Saint-Cyr, Juge et Louis dner Duverneau, Graffier. VU:Le Juge de Paix do la capitale POUR EXPEDITION CONFORDED Section EST, pour la légalisation COTZ de la signabus du dit greffier/- greffer, Louis Janex Duverneau."
}