{
  "anumber": "A26875947",
  "id": "A26875947_0089",
  "page_index": 89,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0089/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, Page 16"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 You may cancel your contract for any reason as of your monthly billing date. Your monthly billing date is on your bill This will be your cancellation date. To do so, you must give us notice in writing at least 15 days before the next monthly billing date. That date will be your cancellation date. If your subscription charge is paid for a period beyond your cancellation date, we will refund the subscription charge for that period. B. WE MAY CANCEL YOUR CONTRACT You do not have to worry that we will cancel your contract because you are using benefits or because you will need more benefits in the future. We will cancel your contract only for the following reasons: (1) We may cancel your contract if your subscription charge is not paid within 15 days after it is due. We do not have to give you notice of the cancellation. Cancellation will be effective as of the last date through which the subscription charge was paid. (2) We may cancel your contract without notice if you made some misrepresentation to us, such as an incorrect or incomplete statement on your application card, which led us to believe you were eligible for this coverage when in fact you were not. In such a case, cancellation will be as of your effective date. We will refund the subscription charge you have paid us. We will subtract from the refund any payments made for claims under this contract. If we have paid more for claims under this contract than you have paid us in subscription charges. we have the right to collect the excess from you. (3) We may cancel your contract without notice as of a date approved by the Commissioner of Insurance Your cancellation date in this case will be the date approved by the Commissioner. If your subscription charge is paid for a period beyond your cancellation date, we will refund the subscription charge paid for that period. (4) We may cancel your contract for any reason as of any date. but only if we also cancel all other contracts of this type. In such a case, we will give you not less than 15 days prior written notice of our intention to cancel your contract. Your cancellation date will be the date specified in the notice. If your subscription charge is paid for any period beyond your cancellation date, we will refund the subscription charge paid for that period. 10. BENEFITS AFTER YOUR CANCELLATION If you cancel your contract, no benefits will be provided for services which you receive after your cancellation date. If we cancel your contract for any reason, other than misrepresentation. we will continue to provide benefits ONLY if you are receiving covered inpatient care on your cancellation date and ONLY for services in connection with that inpatient stay. We will provide you with these benefits until you use them up or are discharged. whichever comes first. 11. ADJUSTMENTS OR REFUNDS If you want to ask for an adjustment or refund. send a letter to us. We will mail you any special form that you may need. We will approve adjustments or refunds in accordance with the Underwriting Guidelines which we have on file with the Commissioner of Insurance. We will not approve an adjustment or refund if it is for something that took place more than 2 Page 16 years before we get your letter or if it is for an amount less than $1.00."
}