{
  "anumber": "A26875947",
  "id": "A26875947_0217",
  "page_index": 217,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0217/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service, FORM I-72"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 U.S. Department of Justice I'll #702 FED. BLDG. Immigration and Naturalization Service BOSTON, MA. 02203 101 Request I'130 back NAME OF BENEFICIARY Port gu-Princ from NAME AND ADDRESS OF APPLICANT/PETITIONER Mrs. Rosegarcon I. PETIT c/o Magny 7-987- 48 Fuller St. 3rd F1. DATE Dorchester, MA. 02124 7/8/87 FILE NO. A26 875 947 FORM NO. I-485 T-01 over79t PLEASE COMPLY WITH THE BELOW CHECKED X INSTRUCTIONS. exempt Agency day see 1. The above application/petition and its supporting documents are attached. 0.1.245.2(1)(1) 2. The above application/petition and its supporting documents have been forwarded to your attorney or representative. 3. Please complete the blocks on your enclosed application/petition which are checked in red. 4. Please follow the Instructions on your enclosed application/petition which are checked in red. 5. Furnish the required fee of $ 6. Furnish the birth or baptismal certificate of 7. Furnish the marriage certificate of 8. Furnish proof of death or legal termination of marriage of 9. A foreign document must be accompanied by a translation in English. The translator must certify that he/she is competent to translate and that the translation is accurate. 10. Furnish the date and port of each of your entries into the United States and the name of the ship, plane, or other vehicle on which you traveled. 11. Except for aliens with occupations listed under Schedule A, 20 Code of Federal Regulations, Part 656.10, a certification from the Secretary of Labor must be obtained before your petition or application may be resubmitted to this Service. Further information and Department of Labor forms and instructions may be obtained from the local office of the state employment service agencies. 12. You have indicated that you do not intend to seek employment. You must furnish evidence that you have sufficient funds or other means of maintaining yourself in this country. 13. Furnish two (2) color photographs. These photos must have a white background, photos must be glossy, un- retouched, and not mounted. Dimension of the facial image should be about 1 inch from chin to top of hair or head, shown in 3/4 frontal view of right side of face with right ear visible. Using soft pencil or felt pen, print name (and alien registration receipt number, if known) on the back of each photograph. You should show these instructions to the photographer who takes the pictures. 14. You may now apply for adjustment of status, on the attached forms, for yourself and the below listed persons. 15. Your proof of status documents have been checked and are attached. Your application/petition is being processed and will be completed in the near future. 16. You are granted additional time until to submit a brief in support of your appeal, or to present evidence in rebuttal to the proposed visa petition revocation or denial. 17. Please submit to the above address (along with a copy of this sheet) the following additional documentation on or before AUGUST 14, 1987: (1) Proof from \"Blue Cross & Blue Shield\" that your policy is still in effect; paid (& to what date); that the \"240 day\" waiting period restriction has been lifted; of what \"pre-existing condition\" restriction(s) have been written into your policy (if required, provide your insurance company any necessary privacy release). Than you. *P.S. Furnish a new medical report (I-486 enc.), SINCERELY, as your prior exam is over 1 yr. old. CHARLES T. COBB cc: Esq. district director FORM 1-72 CHECK THIS BOX WHEN COPY MAILED TO ATTORNEY OR REPRESENTATIVE FILE COPY (REV 4-1-831"
}