{
  "anumber": "A26875947",
  "id": "A26875947_0160",
  "page_index": 160,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0160/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screening Form, Screening Unit"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Describe type of Medex (.L. 2 or 3) and what: you pay qutly. Provide copy of premium bill most current. You and your legal representative must complete & sign the enclosed Lien & Accident Report forms. Describe living arrangements (who you live with and cost of living expenses) Complete the Social Data form & have your physician complete SS32 Medical Report. Copy of divorce decree or legal separation papers. Also, sign & have witnessed enclosed AFFIDAVIT OF PARENTAL ABSENCE FORM CA-I and A-30 INTAKE SUPPLEMENT ON CHILD SUPPORT. Are you receiving regular contributions from friends or relatives such as child susport payments, etc. ? If so, supply current copy of check (s) or a written, dated signed statement from that person, noting amount and frequency of payment, and copy of court order, if applicable. To qualify as \"Unemployed Parent\" with a work history, provide complete work history for past 5 years with LETTERS FROM FORMER EMPLOYERS FOR THOSE PERIODS. Proof of any pre-paid burial. Death certificate if parent is deceased. Other: provide Form IF YOU HAVE ANY QUESTIONS, PLEASE CALL ME BETWEEN 9 & 11 a.m. at 227-8320 ext. IF YOU PLAN TO VISIT THIS OFFICE WITH THE REQUESTED VERIFICATIONS, PLEASE CALL IN AD- VANCE FOR AN APPOINTMENT. FAILURE TO SUPPLY REQUESTED VERIFICATIONS IN THE PRESCRIBED TIME WILL RESULT IN THE DENIAL OF YOUR APPLICATION FOR MEDICAID FOLLOWING PROPER NOTIFICATION! Very truly yours, Screening Unit CC:"
}