{
  "anumber": "A26875947",
  "id": "A26875947_0090",
  "page_index": 90,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0090/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Other Contract Provisions"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Other 12. NOTICES Contract A. To You - When we send a notice to you, we will send it by first class mail to the most recent address which we have for you in our files. This applies to your bill for subscription charges as well as to a notice of a change in the subscription Provisions charge or a change in the contract. Once we mail the notice or bill. we are not responsible for its delivery. If your name or mailing address should change. you should send notice of that to us at once. Be sure to give us the old (continued) name and address as well as the new. B. To Us - Any letters that you want to send to us should be sent to Blue Cross and Blue Shield, 100 Summer Street. Boston, Massachusetts 02106. You must always include your name and your Blue Cross and Blue Shield Number which you will find on your Blue Cross and Blue Shield Card. 13. ENROLLMENT AND CONTRACT CHANGES If you want to change the type of your coverage. you may dos according to the Underwriting Guidelines that are in effect at the time that you ask for such a change. All enrollment applications. any additions or changes to a contract are allowed ONLY when they conform to our Underwriting Guidelines which are on file with the Commissioner of Insurance. 14. HOW INPATIENT DAYS ARE COUNTED To count the number of inpatient benefit days you have used Blue Cross will count the day of admission but not the day of discharge. Blue Shield will provide benefits on the day of discharge. 15. WHEN AND HOW BENEFITS ARE PROVIDED Benefits will be provided only for those covered services that are furnished on or after the effective date of this contract. if you are already an inpatient on your effective date, NO BENEFITS are available for that admission under this contract. ONLY THOSE BENEFITS THAT ARE AVAILABLE ON THE DATE OF YOUR ADMISSION WILL BE PROVIDED UNDER THIS CONTRACT In order for you to receive any of the benefits for which you may have a right. you must inform your provider that you are a member and supply him with your Blue Cross and Blue Shield Number and any necessary information needed to file your claim. If you fail to properly inform your provider within 30 days after the services are furnished to you. we will no longer be obliged to provide any benefits for those services. 16. WHEN A BED IS NOT AVAILABLE IN A PARTICIPATING SKILLED NURSING FACILITY If a bed is not available in a participating skilled nursing facility and you require covered inpatient care. you are entitled to receive benefits in a participating general hospital. 17. WE ARE NOT RESPONSIBLE FOR THE ACTS OF PROVIDERS Page 17 We will not interfere with the relationship between providers and their patients. You are free to select or discharge any provider. It is not up to us to find a provider for you. We are not responsible if a provider refuses to furnish services to you."
}