{
  "anumber": "A26875947",
  "id": "A26875947_0092",
  "page_index": 92,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0092/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 5 Filing a Claim, Form Number: 19"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Other 3. If none of the above rules can be applied, the policy which has covered the patient for the longest time is the primary plan. Contract IMPORTANT: NO statement in this section should be interpreted to mean that we will provide any more benefits than Provisions those already described in the benefit section of this contract, on page 6. Remember that under COB the total of the payments made for covered health care services will not be more than the total of the actual charge for those covered services. We WILL NOT provide duplicate benefits for the same services. If you have any questions about COB and your (continued) contract, please contact our Customer Service Office listed at the end of this certificate. RIGHT TO RECOVER OVERPAYMENTS If we pay more than the amount that we should have under COB, then you must refund that amount to us. 20. TIME LIMIT FOR FILING A CLAIM You or your provider must submit claims for benefits under this contract within 2 years of the date that you received the service or supply. We do not have to honor claims submitted after this 2 year period. Part 5 1. WHO RECEIVES PAYMENT Most of the time, we provide benefits under this contract by making payments to the provider. However, there are times when we will reimburse you instead. Within 15 days after we receive notice that you have obtained some service or supply for Filing a which you may be reimbursed, we will mail to you all the forms which you must fill out. Within 45 days after we receive the completed forms from you, we will: (a) send you a check for your claim to the extent of your benefits under this contract. (b) Claim send you a notice in writing of why we are not paying your claim; or (c) send you a notice in writing of what additional information or records we need to decide if we should pay your claim. When we reimburse you. it is up to YOU to pay your provider. 2. WHO FILES A CLAIM A. All Massachusetts providers who have agreements with Blue Cross or Blue Shield will file claims directly to us for the inpatient services described in your contract. Simply give the hospital, physician or other medical provider your Blue Cross and Blue Shield Number. B. You should always file an Extended Benefit claim for the outpatient covered services that are described in your contract. You must file your claim by sending us your itemized bills along with a completed Extended Benefit Claim Form. You can get a form from our Customer Service Office. If you have any questions, contact our Customer Service Office listed at the end of this certificate. Page 19"
}