{
  "anumber": "A26875947",
  "id": "A26875947_0157",
  "page_index": 157,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0157/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, DEportation screening form"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 32 (a) QUELQUOUN A T-IL JAMAIS FAIT UNE REQUETE DE VISA D'IMMIGRATION EN VOTRE NOM? (b) UNE D'EMPLOI AUX ETATS-UNIS A.T-ELLE JAMAIS ETE DEMANDEE PAR VOUS OU EN VOTRE NOM ATTESTATION in AVEI-VOUS L'IMMIGRATION ZN VOTRE VOUS-MEME ou PAR LINTERMEDIAIRE DE QUELQU'UN AGISSANT NOM JAMAIS INDIQUE A UN FONCTIONNAIRE CONSULAIRE OU A UN EMPLOYE DE AMERICANE L'INTENTION D'IMMIGRER AUX ETATS-UNIS? (a) Non Oui (b) Non Oui (c) Non Oui 23. LES PERSONNES SUIVANTES SE TROUVENT-ELLES AUX ETATS-UNIS? (Dans l'affirmative Indiquez on entourant d'un cerole is lian de parenté et ditos ce que fait cette personne aux Etets-Unia c'est-h-dire ai elle étudia. Invellia eta.). FIANCE/FIANCEE FRERE/SOEUR EPOUX/EPOUSE from PERE/MERE FILS/FILLE 34. INDIQUEZ LES PAYS DANS LESQUELS vous AVEZ SEJOURNE PLUS DE SIX MOIS AU COURS DES CING DEPNIBRES ANNEES. HAIR (Payal (Villes) bays (Dates approximatives as AVIS IMPORTANT TOUS LES SOLLICITANTS DOIVENT LIRE LEB QUESTIONS CI-DESSOUS ET REPONDRE Lin visa or peut ètre delivré sux personnes qui tombent dans des catégories précises définies par la loi comme ètasi DOB adminibles BUE Etass-Unis (sauf lorsqu'une dispense est obtenue à l'avance). Des renorignements complets relatifs a ces.catégories peuvent être obtenus à ce bureau et vous permettron les de savair si elles permient susceptibles de vous ètre applicables. En général, elles comprennent personnes Attenates de maladies contagieuses (comme la tuberculose) ou qui ont souffer de troubles mentaux qui graves; our ent arreites DU condamnées pour tout délit ou crime, meme si elles ont fair l'objet d'une grace, d'une amoistic ou de toute autre action juridique semblable que l'on croit Bure des togicomanes ou des trafiquants de stupéfiants; qae ont etc deportées des Etats-Unis au cours de ces cinq dernières années; qui our essayé d'obtenir un visa en faisant de fausses déclarations ou par fraude; qui sent on on ent membres de certaines organisations y compris les organisations communistes celles qui leur sont affiliées que one ordonné, inciti, aide. participé de queique manière que ce soit à la persécution de toutr personne du fair de sa race, de sa religion, de ses origines nationales ou de ses opinions politiques de sous le contrbir direct ou indirect du gouvernement nazi de l'Allemagne ou du gouvernement test pays occupt par ou allie au gouvernement naxi de PAllemagne. L'UNE QUELCONQUE DES RESTRICTIONS SUS-MENTIONNEES S'APPLIQUE-T-ELLE A VOUST Non Oui vous readies personnellement dans nos bureaux Si cela n'est pas possible à present. vous êtes prit Dans l'affirmative the $ vous avez une question quelconque à cet egard, il est recommand# que vous de joindre a to prevente demande une déclaration des faits qui vous concernent 36 to certifie avoir lu et compris toutes les questions formulées dans la presente demande et avoit donné dans be present formulaire des réponses qui sont véridiques et exactes au mieux de thes connaissances Je reconnais que la possession d'un visa n'assure pas à son titulaire l'entrer aux Etats-Unis d'Amérique à son arrivee au port d'entrée s'il est déclare inapte a Mre admis DATE DE LA DEMANDE SIGNATURE DU SOLLICITANT Si la presente demande a èté établie en votre nom et par une agence de voyage ou par une autre personne, le prepost doit indiquer ie nom et l'adresse de l'agence ou de la personne, accompagnés de la signature en bonne et due forme de la personne ayant établi la demande. SIGNATURE DE LA PERSONNE QUI A REMPLI LE FORMULAIRE NE PAS ECRIRE DANS L'ESPACE CI-DESSOUS 191871 31 5221B DEPARTMENT OF STATE"
}