{
  "anumber": "A26875947",
  "id": "A26875947_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF SWORN STATEMENT ( (FINGERPRINTS)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        2023,
        2001
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE RECORD OF SWORN STATEMENT (FINGERPRINTS) APPLICANT NAME: Rose Petit FILE NO A 026 875 947 DATE 8/7/2001 EXECUTED AT Miami CUSA Office, Miami, FL Before the following officer of the U.S. Immigration and Naturalization Service: Dennis Smyth Chere (NAME AND TITLE) in the language. Interpreter used. I, Rose Petit , acknowledge that the above named officer has identified himself/herself to administer oaths and take testimony in connection with the enforcement of the Immigration and Nationality laws of the United States. He/she has informed me that he/she desires to take my sworn statement regarding: He/she has told me that my statement must be made freely and voluntarily. I am willing to make such a statement. I swear that I will tell the truth the whole truth, and nothing but the truth, so help me, God. Being duly sworn, I make the following statement: Q. What is your true, full and complete name? A. Rose Petit Q. What is your place and date of birth? A. Haiti, December 1, 1905 Q. Have you ever been arrested or detained by a law enforcement officer? A. No Q: Have you had your fingerprints taken for any reason by a law enforcement officer? A. No Q. Have you ever been issued a ticket or been taken into custody by a law enforcement officer? A. No Q. Have you ever been ordered by a court to: pay a fine; go to jail; serve a probationary sentence; perform community service; make restitution; or have your wages garnished (e.g., for failure to make child support payments)? A. No Q. Have you ever received an expungement, parole, pardon, or successfully completed a diversion or rehabilitation program? A. No Q. If you have answered \"yes\" to any of the above questions, please explain below: A. N/A I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine Signature of Applicant Rose Petit eligibility for the benefit that I am seeking. 7 day of Mugist . Sworn and Dennis Smith Signature INS Officer subscribed Kattleen before/me: Signature of Witness Sheeray (Rev. 11/1/98)"
}