{
  "anumber": "A26875947",
  "id": "A26875947_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2001,
        1998
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 In connection with your application for naturalization, please answer each of the questions by checking \"Yes\" or \"No\". You should answer these questions the day you are to appear for the citizenship oath ceremony. These questions refer to actions since the date you were first interviewed on your Application for Naturalization They do not refer to anything that happened before that interview. After you have answered every question, sign your name and fill in the date and place of signing, and provide your current address. You must bring this completed questionnaire with you to the oath ceremony, as well as the documents indicated on the front, and give them to the Immigration employee at the oath ceremony. You may be questioned further on your answers at that time. AFTER the date you were first interviewed on your Application for ANSWERS Naturaliztion, Form N-400: 1. Have you married, or been widowed, separated, or divorced? (If \"Yes\" please bring documented proof of marriage, death, separation or divorce.) 1. Yes No 2. Have you traveled outside the United States? 2. Yes No 3. Have you knowingly committed any crime or offense, for which you have not been arrested; or have you been arrested, cited, charged, indicted, convicted, fined, or imprisoned for breaking or violating any law or ordinance, including traffic violations? 3. Yes No 4. Have you joined any organization, including the Communist Party, or become associated or connected therewith in any way? 4. Yes No 5. Yes No 5. Have you claimed exemption from military service? 6. Has there been any change in your willingness to bear arms on behalf of the United States; to perform non-combatant service in the armed forces of the United States; to perform work of national importance under civilian direction, if the law requires it? 6. Yes No 7. Have you practiced polygamy; received income from illegal gambling; been a prostitute, procured anyone for prostitution or been involved in any other unlawful commercialized vice; encouraged or helped any alien to enter the United States illegally; illicitly trafficked in drugs or marihuana; given any false testimony to obtain immigration benefits; or been a habitual drunkard? 7. Yes No I certify that each of the answers shown above were made by me or at my direction, and that they are true and correct. Signed at Miami , FloRida on August 8, 2001 (City and State) (Date) XRose Potit 40 Nw 186 TeRRace (Full Signature) (Full Address and ZIP Code) Authority for collection of the information requested on Form N-445 is contained in Sections 101(f), 316, 332, 335 and 336 of the Immigration and Nationality Act (8 U.S.C. 1101 (f), 1427, 1443, 1446 and 1447). Submission of the information is voluntary. The principal purposes for requesting the information are to enable examiners of the Immigration and Naturalization Service to determine an applicant's eligibility for naturalization. The information requested may, as a matter of routine use, be disclosed to naturalization courts and to other federal, state, local or foreign law enforcement and regulatory agencies, the Department of Defense, including any component thereof, the Selective Service System, the Department of State, the Department of the Treasury, the Department of Transportation, Central Intelligence Agency, Interpol and individuals and organizations in the processing of any application for naturalization, or during the course of investigation to elicit further information required by the Immigration and Naturalization Service to carry out its functions. Information solicited which indicates a violation or potential violation of law, whether civil, criminal, or regulatory in nature, may be referred, as a routine use, to the appropriate agency, whether federal, state, local or foreign, charged with the responsibility of investigating, enforcing or prosecuting such violations. Failure to provide all or any of the requested information may result in a denial of the application for naturalization. Public Reporting burden for this collection of information is estimated to average 5 minutes per response, including the time for reviewing instructions, searching existing data sources, gathering and maintaining the data needed, and completing and reviewing the collection of information. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden to: U.S. Department of Justice, Immigration and Naturalization Service, (Room 5304), Washington, DC 20536; and to the Office of Management and Budget, Paperwork Reduction Project: OMB No. 1115-0052,; Washington, DC 20503. GPO : 1998 - 181-009"
}