{
  "anumber": "A26875947",
  "id": "A26875947_0081",
  "page_index": 81,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0081/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, BENEFIT SUMMARY CHART"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 1. Services for the treatment of mental disorders 1. Radiation therapy and x-ray therapy The benefits described in this section may also be available in a participating skilled nursing facility in But IMPORTANT they are available ONLY when your condition is such that you would otherwise require covered inpatient care .1 participating general hospital. These benefits are NOI available for the treatment of mental disorders. For benefits for services of a non-participating physcian or psychologist. see page 13. 3. AS AN INPATIENT IN A PARTICIPATING OR COOPERATING SKILLED NURSING FACILITY. OR IN COOPERATING SPECIALTY HOSPITAL: You have the right to benefits in a semiprivate room as follows: BENEFIT SUMMARY CHART Patient Balance Extended Benefits ROOMAND BOARD: 800; of the charge each day for up to You pay 20% of the c harge for up to a total of 120 days in each a total of 120 days in each benefit period. benefit period. SPECIAL SERVICES: 80% of the charge for up to a total of You pay 2002 of the charge for upto a total of 120 days in each 120 days in each benefit period. benefit period. You pay all charges for room and board and special services after the 120th day in each benefit period. If you are in a private room. we will only provide benefits for: 809; of the facility's average charge for a semiprivate room: AND 80% of the maximum semiprivate charge for special services. You pay the balance. For benefits in a non-cooperating or non-participating facility, see page 13. 4. AS AN INPATIENT FOR PARTICIPATING PHYSICIANS SERVICES IN A PARTICIPATING OR COOPERATING SKILLED NURSING FACILITY OR IN A COOPERATING SPECIALTY HOSPITAL You have the right to benefits as follows: BENEFIT SUMMARY CHART Patient Balance Extended Benefits 809; of a usual and customary charge for physicians services You pay 20% of a usual and customary charge for up to a described in A. through D. below for up to a total of 120 days total of 120 days in each benefit period for the care described in each benefit period. in A. through D. below. Page 8 You pay all charges after the 120th day in cach benefit period."
}