{
  "anumber": "A26875947",
  "id": "A26875947_0085",
  "page_index": 85,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0085/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 4 Other Contract Provisions Page 12"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 For example: When you are an inpatient in a hospital this means that: You must need a physician`\\ or dentist's daily medical care and immediate nursing care: or You must need the special services or equipment you can get only in the hospital. When you are an inpatient in a skilled nursing facility this means that: You must need a physician's or dentist's active medical care and daily skilled services: and Your condition may be expected to improve or your worsening condition requires skilled services. B. How We Determine What Is Medically Necessary The fact that your physician. or some other provider. has furnished. prescribed. ordered. recommended. or approved a service does not of itself make the service medically necessary that determination will be made by us based on a review of the medical records describing your condition and treatment We will not provide benefits for services furnished by a hospital or other facility as of the date the utilization review organization which reviews the need for care in the facility on our behalf decides that you do not need care in that facility. C. Payment For Services Which Are Not Medically Necessary If you receive a service which is otherwise covered as a Blue Cross and Blue Shield benefit under this contract. but which is not medically necessary for you. you might be charged for the service by the provider. We will defend you from a claim for payment for such a service. unless ou were told. knew or reasonably should have known. before you received the service. that it was not medically necessary 1. Inpatient services furnished by those acute general hospitals, skilled nursing facilities. and specialty institutions which have agreements with Blue Cross not to charge for services which are not medically necessary. and 2. Services by those physicians and psychologists who have agreements with Blue Shield to provide services to you. To obtain the defense by Blue Cross and Blue Shield in this situation. you must notify us not later than 10 daysafter any lawsuit to collect for the services has been started and must cooperate in the defense If it is determined in the action that the services were medically necessary. we will pay for them. 1. IMMEDIATE BENEFITS Part 4 The Blue Cross and Blue Shield benefits described in this contractar NOT available until a member has been covered under a Blue Cross and Blue Shield contract for 240 or more consecutive days. or has been continuously covered under a Blue Other Cross and Blue Shield contract from the date of birth Contract However, Blue Cross and Blue Shield benefits may be provided for covered services that are furnished for conditions that are approved for \"Immediate Benefits\". An Immediate Benefit is provided for the treatment of any of the conditions listed Provisions below when: (1) it is the only condition being treated: (2) it is the first time the condition has been treated: and (3) it is not the result of some underlying disease or defect. Page 12 A. Accidental injuries requiring immediate treatment except for the aggravation of: hernias: ruptured spinal discs: or a pre-existing condition."
}