{
  "anumber": "A26875947",
  "id": "A26875947_0218",
  "page_index": 218,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0218/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United States Department of Justice Immigration and Naturalization Service, Form 1-607"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Boston, MA. 02203 File: A- 26875947 Date: In re: MRS. Rosegarcon I. PETIT APPLICATION(S): Waiver of excludability under the Immigration and Nationality Act pursuant to section 212(h); section 212(i); permission to reapply after deportation or removal pursuant to section 212(a)(16) or (17). The applicant has been found to be excludable under the following paragraph(s) of the Act: DATE AND COUNTRY OF BIRTH: NATIONALITY DATE(S) OF DEPORTATION 12-01-05 Haiti - THE SPECIFIC OFFENSE(S) AND/OR CONDUCT UPON WHICH EXCLUDABILITY IS BASED: (show dates) B-2 VISA FRoud at see I 601 #epared by Exp. t I 485 denial dated 11-885 THE APPLICANT IS THE SPOUSE, PARENT, CHILD, OF: WHO IS(ARE) CITIZEN(S) OR LAWFUL PERMANENT RESIDENT ALIEN(S) OF THE UNITED STATES THE APPLICANT'S EXCLUSION WILL RESULT IN EXTREME/SERIOUS HARDSHIP TO THE NAMED RELATIVE(S) BECAUSE: --- REFORMATION AND REHABILITATION OF THE APPLICANT IS EVIDENCED BY: It is found that the applicant is statutorily eligible for the relief sought and that the admission of the applicant to the United States would not be contrary to the national welfare, safety or security. Accordingly, on the basis of all of the foregoing and in the exercise of discretion, the application(s) will be granted. ORDER: It is ordered that the application(s) for waiver of excludability under the Immigration and Nationality Act be, and hereby is (are) granted pursuant to section 212(h) and/or section 212(i), PROVIDED THAT THE WAIVER(S) SHALL APPLY ONLY TO THE GROUNDS FOR EXCLUSION SHOWN HEREIN. IT IS FURTHER ORDERED that the application for permission to reapply for admission to the United States after deportation or removal be, and hereby is, granted. XX DISTRICT DIRECTOR Form I-607 UNITED STATES DEPARTMENT OF JUSTICE Charles T. COBB (Rev. 2-1-72) Y Immigration and Naturalization Service GPO 925-148"
}