{
  "anumber": "A26875947",
  "id": "A26875947_0162",
  "page_index": 162,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0162/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1946,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "CHAMA Screened by NARA, 8/11/2023 o Cambridge Martian American Association Ins. 106 Windeor Street, Cambridge, Mass. 02139 Tel. (617) 482-6622 A non posts tax stamp No. 4298 B Decl Father BIRTH CERTIFICATE Bloffel Liberty Equality Fraternity Republic of Haiti In the year nineteen hundred forty-six, Year 143 of Independance, and on Friday March first at two o'clock in the afternoon. Before Us, Timolion Vincent, Civil Registrar of the Cap Haitian district, signature below. Appeared mister Granjean Petit, tailor, of legal age, living and domiciled in Cap Haitian. Who presented to us a child of female sex which he declared to us to be his legitimate daughter born on Rue 6 in Cap Haitian on Friday January fourth nineteen hundred forty-six at four-thirty o' clock in the afternoon of the woman, his wife, Idora Pierre-Paul, modiste, born in Quartier Morin, living and domciled in Cap Haitian. To which child he has given the names: MARIE MONA Which was recorded in our office on Rue Dauphine in the presence of mister Marcel Vincent, mechanic, and mister Daniel Pretto, landowner, both of legal age, living and domiciled in Cap Haitian, witnesses chosen and brought by the declarant. After a reading of this certificate we have signed it with the father and the wit- nesses. Reecipt of the General Tax Administration No. 6742 Series X. Signed: signature/registery stamp. left margin: Birth of MARIE MONA PETIT January 4th 1946 at 4:30 in the afternoon Rue 6. Presented by me in the Baptist Church of Cap Haitian on this Sunday March 3d 1946 signature of Pastor I, the undersigned, do. certify that I am competant in reading and understanding both the English and the French languages and that the foregoing is a true and accurate translation of the annexed document. augustu Anthony Augustus, Translator Bonny J. Saintelot, Notary Public My commission expires May 28 1987"
}