{
  "anumber": "A26875947",
  "id": "A26875947_0138",
  "page_index": 138,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0138/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DECISION, I-485"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1905,
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 DECISION On May 1, 1985 you applied for adjustment of status to permanent residence (Form I-485) based on the visa petition of your United States Citizen daughter Mrs. Marie Magny approved on April 1, 1985 under Section 201(b) of the Immigration and Nationality Act. On July 24, 1985 accompanied and assisted by your son-in-law, you were interviewed under oath by an Immigration Examiner as to your eligibility for adjustment of status. Your application will be denied pursaunt to Section 212(a)(15) and (19), respectively referring to excludability due to the likelihood of becoming a public charge and for visa fraud. The record indicates that you are nearly 80 years of age, having been born in Haiti on December 1, 1905 and that you are not now, nor for the last five years have you been employed. To demonstrate financial support you submitted an Affidavit of Support (Form I-134) signed May 17, 1985 by your son-in-law stating that he would support you based on his annual income of $13,500, his savings of $1990 and stocks and bonds worth $7,776. In addition #your daughtersthe petitioner, submitted a job letter stating she was employed full-time in a clerical position, but no salary data was offered. Your daughter and son-in-law also reveal that they must support three minor children of their own. Since you are living with your daughter, the principal financial issue is security against medical expenses. You were asked at the interview to submit proof of comprehensive medical insurance to cover you in the United States. In reply you sent a \"Medicaid Verification Checklist\" dated August 7, 1985 from the Department of Public Welfare, 43 Hawkins Street, Boston, MA 02114 apparently constituting an application on your part for Medicaid assistance from the Commonwealth of Massachusetts. Section 212(a) (15) of the Act provides for the exclusion of aliens from the United States \" who, in the opinion of the consular officer at the time of application for a visa, or in the opinion of the Attorney General at the time of application for admission, are likely at any time to become public charges\". Matter of Harutunian, 14 I&N Dec. 583, a precedent decision binding upon the Immigration Service concludes that: any alien who is incapable of earning a livelihood who does not have sufficient funds in the United States for his support, and has no person in the United States willing and able to assure that he will not need public support is excludable as likely to become a public charge whether or not the public support which will be available to him is reimbursable to the state.\" \" In an analysis right on point the decision goes on to state: \"Everything in the statutes, the legislative comments and the decisions points to one conclusion, that Congress intends that an applicant for a visa be excluded who is without sufficient funds to support himself, who has no one under any obligation to support him and who, being older, has an increasing chance of become dependent, disabled and sick\"."
}