{
  "anumber": "A26875947",
  "id": "A26875947_0146",
  "page_index": 146,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0146/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "2"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE Immigration and Naturalization Service Memorandum of Creation of Record Lawful Permanent Residence, I-181 ( Rev.3-1-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 3 U.S. Government Printing Office: 1985-493-741 U.S. DEPARTMENT OF JUSTICE Memorandum of Creation of Record Immigration and Naturalization Service of Lawful Permanent Residence Place Boston, MA. File No. A26 875 947 Status as a lawful permanent resident of the United States is accorded: Sex 1 Male Date of Birth (Month/Day/Year) Name In Care Of Rosegarcon Idora PET IT 2 Female 12/1/05 Street 48 Fuller St. City of Birth Country of Birth Address 3rd F1. c/o Magny Apt. No. Dorchester, MA. 02124 Country of Nationality Country of Last Residence City, State, Zip Marital Status 1 Single 2 Married Occupation N/I Class at time of Adj. Year Adm. to U.S. or Year of Change to Present NI Class (whichever most recent) 3 Widowed 4 Divorced 5 Separated Priority Date (Month/Day/Year) Preference (If any) Country to Which Chargeable (If any) Section 212 (a) (14) Not Mother's First Name Father's First Name 1 Applicable-Submitted 3 Labor Certification Applicable Last NIV Issued at (U.S. Consulate Post) Date of Issuance of Last NIV Number of Last NIV Classification of Last NIV Under the following provision of law Other law (Specify) Public Law 95-412 Sec. 209 (a) of the I & N Act Sec. 249 of the I & N Act Public Law 96-212 Sec. 209 (b) of the I & N Act Sec. 1 of the Act of 11/2/66 Private Law No. Sec. 244 ( ) ( ) of the T & N Act Sec. 13 of the Act of 9/11/57 of the Congress Session Sec. 245 of the I& N Act Sec. 214 (d) of the I & N Act As of at (Month) (Das) (Year) PORT OF ENTRY FOR PERMANENT RESIDENCE Class of admission (Insert Symbol) REMARKS RECOMMENDED BY: (Immigration Officer Injury RE: basis of G BLS representation (Date) if not indigency) vetoed per SIE DATE OF ACTION DD DISTRICT FOR USE BY VISA CONTROL OFFICE Date Foreign State Preference Category Number Month of Issuance Signed (Visa Office. Dept. of State) CC: Page 2 Master Index copy sent on CC: Page 3 ADIT and Statistical report copy sent on Form I-181 (Rev.3-1-83) N 2. FOR MASTER INDEX REPORT"
}