{
  "anumber": "A26875947",
  "id": "A26875947_0151",
  "page_index": 151,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0151/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR STATUS AS PERMANENT RESIDENT, I-485 ( (Rev. 5-5-83) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1905,
        1948,
        2023,
        1924
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 8/11/2023 Immigration and Naturalization Service OMB No. 1115-0053 Approval Expires 8-85 APPL. TION FOR STATUS AS PERMANENT RESIDENT RECEIVES FEE STAMP File No. COBOS APPLICATION FOR THE BENEFITS OF SECTION: MAY 17 1985 EX Sec. 209(b), I&N Act Sec. 245, I&N Act 30 271.4 U.S. for # Sec. 214(d). I&N Act Sec. 249, I&N Act Immigration & Naturalization 10 Sec. 13, Act of 9/11/57 Bid (DO NOT WRITE ABOVE THIS (SEE INSTRUCTIONS BEFORE FILLING IN APPLICATION IF YOU NEED MORE SPACE TO ANSWER FULLY ANY QUESTION ON THIS FORM. USE A SEPARATE SHEET AND IDENTIFY EACH ANSWER WITH THE NUMBER OF THE CORRESPONDING QUESTION. FILL IN WITH TYPEWRITER OR PRINT IN BLOCK LETTERS IN INK.) 1. I hereby apply for the status of a lawful permanent resident alien on the following basis: (Check one of the boxes below.) A26-875-947 A. As a person granted asylum under Section 207(a) to whom an immigrant visa is immediately available (Section 209(b), I&N Act). (No fee required.) B. As a person who entered the U.S. with a visa issued to me as the fiancee or fiance of a U.S. citizen whom I married within 90 days after my entry, or as a child of such fiancee or fiance (Sec. 214(d). I&N Act). C. As a former government official, or as a member of the immediate family of such official (Section 13, Act of September 11. 1957). D. As a person to whom an immigrant visa is immediately available, other than one described above (Section 245, I&N Act). E. As a person who has resided in the United States continuously since prior to July 1. 1924 (Section 249, I&N Act). F. As a person who has resided in the United States continuously since a date on or after July 1. 1924, but before June 30, 1948 (Section 249, I&N Act). G. As a motion to reopen or to reconsider my case in deportation proceedings before an immigration judge. (The fee for this request is $50.00.) 2. My name is (family in capital letters) (First Given) (Middle) 3. Sex Phone number PEtiT Rosegarcor Flora Male Female (617) 288-6256 4. I reside in the United States at: (c/o) (Apt. No.) (No. and Street) 48 FULLEY st 3rd. Floor (City) (State) (ZIP Code) 5. Have you ever applied before for permanent resident JorchEster MA 02124 status in the U.S.? No Yes 6. My file number is 7. I am a citizen of (Country) 8. Date of Birth (If \"Yes\". give the date and place of filing and final disposition.) 1-26-875-9471 HAITI (Month) (Day) (Year) - 1905 9. Place of Birth (City or Town) (County, Province, or State) (Country) Quartive MOKIN HAITI 10. Name as appears on nonimmigrant document (Form I-94) PETIT Iyora I last arrived in the United States at the port of (City and State) on (Month) (Day) (Year) by (Name of vessel or other means of travel) JFK N.Y 12-30-84 as a (visitor, student. crewman. parolee, etc.) B-2 I was was not inspected. 11. My nonimmigrant visa, number 315221B was issued by the on (Month) (Day) (Year) 12. I am single married United States Consul at (City) (Country) Port AUPRINCE HAITI 12-13-84 divorced widowed 18. I have been married / times, including my present marriage, if now married. (If you are now married give the following:) a. Number of times my husband or wife has been married b. Name of husband or wife (Wife give maiden name) / GRANDJEAN PEtit c. My husband or wife resides with me apart from me at Address (Apt. No.) No. & Street) (Town or City) (Province or State) (Country) TAITI 14. a. I have sons or daughters as follows: (Complete all columns as to each son or daughter; if living with you state \"with me\" in last column; otherwise give city and state or country of son's or daughter's residence). Miami Name Sev Plann of Rinth Name lining at 2vtach FOIA (b)(6) 2 Bus tee list to be would b. The following members of my family are also applying for permanent resident status: OVER Form I-485 (Rev. 5-5-83) N RECEIVED TRANS IN RETD. TRANS OUT COMPLETED"
}