{
  "anumber": "A26875947",
  "id": "A26875947_0221",
  "page_index": 221,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A26875947_0221/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 8/11/2023, Form No. /43-RO39(1)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Haiti",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/11/2023 Form Approved OMB No. 43-RO391 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service APPLICANT FOR WAIVER OF EXCLUDABILITY RNI pc ROG 40.00 District Director Immigration and Naturalization Service 394316 PLEASE FURNISH DATA RELATING TO THE ELIGIBILITY OF THE APPLICANT NAMED BELOW FOR A WAIVER OF THE GROUNDS OF EXCLUDABILITY INDICATED HEREIN. NAME (Family Name in Capital Letters) (First Name) (Middle Name) FILE NUMBER PETIT Rosegarcon A26 875 947 PRESENT ADDRESS (Number and Street) (City or Town) (Country) (Zip Code, if in U.S.) 48 Fuller Street Dorchester, MA 02124 DATE OF BIRTH BIRTHPLACE (City or Town) (Country) 12-0]-05 Quartier Marin Haiti I APPLIED FOR A VISA AT THE AMERICAN CONSULATE AT DATE OF VISA APPLICATION Boston, MA 1-30-85 I WAS DECLARED INADMISSIBLE UNDER SECTION(S) (PLACE AN \"X\" IN THE APPROPRIATE BLOCK(S) 212(a) (1) 212(a) (3) 212(a) (6) 212(a) (9) 212(a) (10) 212(a) (12) 212(a) (19) FOR THE FOLLOWING REASONS (List acts, convictions or physical or mental conditions) (If alien has active or suspected tuberculosis, the reverse of this page must be fully completed.) Material misrepresentation at the time I obtained my B-2 visitor visa. PRINCIPAL RELATIVE IN THE UNITED STATES THROUGH WHOM I CLAIM ELIGIBILITY FOR WAIVER NAME ADDRESS RELATIONSHIP IMMIGRATION STATUS Marie Magny 48 Fuller St. , Dor, MA daughter U.S.C. I ALSOHAVE THE FOLLOWING RELATIVES WHO ARE CITIZENSOR LAWFUL PERMANENT RESIDENTS OF THE UNITEDSTATES: NAME ADDRESS RELATIONSHIP IMMIGRATION STATUS None I WAS PREVIOUSLY IN THE UNITED STATES AT: STREET ADDRESS CITY AND STATE FROM (DATE) TO (DATE) IMMIGRATION STATUS Never ADDITIONAL INFORMATION AND INSTRUCTIONS Rose garcon Petit 3=1987 REQUESTING OFFICER TITLE DATE ADDRESS THIS OFFICE WILL MAINTAIN ONLY A FOLDER RELATING TO THE APPLICANT PURSUANT TO A.M. 2712.01 Form I-601A (Rev. 6-20-80) N"
}