{
  "anumber": "A28068003",
  "id": "A28068003_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0048/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Aliens Seeking Adjustment of Status, INS A-File"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 U.S. Department of Justice OMB #1115-0134 Immigration and Naturalization Service Medical Examination of Aliens Seeking Adjustment of Status (Please type or print clearly) 3. File number (A number) / certify that on the date shown / examined: 1. Name (Last in CAPS) 4. Sex HERSI Male Female (First) (Middle Initial) 5. Date of birth (Month/Day/Year) HAWA NMN 1-1-1915 2. Address (Street number and name) (Apt. number) 6. Country of birth 1102 Co. BRADDOCK Road Somelia (City) (State) (ZIP Code) 7. Date of examination (Month/Day/Year) AlexAndRiA , UA. 22302 12/7/87 General Physical Examination: I examined specifically for evidence of the conditions listed below. My examination revealed; No apparent defect, disease, or disability. The conditions listed below were found (check all boxes that apply). Class A Conditions Chancroid Hansen's disease, infectious Mental defect Psychopathic personality Chronic alcoholism HIV infection Mental retardation Sexual deviation Gonorrhea Insanity Narcotic drug addiction Syphilis, infectious Granuloma inguinale Lymphogranuloma venereum Previous occurrence of one Tuberculosis, active or more attacks of insanity Class B Conditions Other physical defect, disease or disability (specify below). Hansen's disease, not infectious Tuberculosis, not active Examination for Tuberculosis - Tuberculin Skin Test Examination for Tuberculosis - Chest X-Ray Report Reaction mm No reaction Not done Abnormal Normal Not done Doctor's name (please print) Date read Doctor's name (please print) Date read SITIRADO 12/7/87 Serologic Test for Syphilis Serologic Test for HIV Antibody Peactive Titer (confirmatory test performed) Nonreactive Positive (confirmed by Western blot) Negative Test Type Test Type R.P.R. HTLUTT Doctor's name (please print) Date read Doctor's name (please print) Date read SITIRADO 12/7/87 S. TiRADO 12/9/87 Immunization Determination (DTP. OPV, MMR, Td-Refer to PHS Guidelines for recommendations.) Applicant is current for recommended age-specific immunizations Applicant is not current for recommended age-specific immunizations and I have encouraged that appropriate immunizations be obtained. REMARKS: D-T 0.5cc no clinical evidence of AIDs Civil Surgeon Referral for Follow-up of Medical Condition The alien named above has applied for adjustment of status. A medical examination conducted by me identified the conditions above which require resolution before medical clearance is granted or for which the alien may seek medical advice. Please provide follow-up services or refer the alien to an appropriate health care provider. The actions necessary for medical clearance are detailed on the reverse of this form. Follow-up Information: The alien named above has complied with the recommended health follow-up. Doctor's name and address (please type or print clearly) Doctor's signature Date Applicant Certification: I certify that I understand the purpose of the medical examination, I authorize the required tests to be completed, and the information on this form refers to me. Signature XasWoo Xers Date 12/9/87 Civil Surgeon Certification: My examination showed the applicant to have met the medical examination and health follow-up requirements for adjustment of status. Doctor's name and address (please type or print clearly) Doctor's signature Date Sandia Tuads 12/9/87 The Immigration and Naturalization Service is authorized to collect this information under the provisions of the Immigration and Nationality Act and the Immigration Reform and Control Act of 1986, Public Law 99-603. 0 Form I-693 (Rev. 09/01/87) N ORIGINAL: INS A-FILE"
}