{
  "anumber": "A28068003",
  "id": "A28068003_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0027/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form N-648, Medical Certification for Disability Exceptions, Department of Homeland Security U.S. Citizenship and Immigration Services"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2009,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 OMB No. 1615-0060; Expires 10/31/10 Department of Homeland Security Form N-648, Medical Certification for U.S. Citizenship and Immigration Services Disability Exceptions ATTENTION: ALL parts of this form (except for the \"APPLICANT ATTESTATION\" below) must be completed by a licensed medical doctor, licensed doctor of osteopathy, or licensed clinical psychologist. (See instructions) RECEIVED Part I. BIOGRAPHICAL INFORMATION (Type or print clearly in black ink) USCIS USE ONLY Information About The Applicant (Patient). I certify that I have examined: ZUUY NOV 27 AID 5? This N-648 1s Applicant Last Name First Name Middle Name Alien Registration Number HERSI HAWA A 280/6003 Sufficient Address U. S. Social Security Number Insufficient 3709 S. George Meson Dr. #1314E 228-47-2391 Continued/RFE City State Fells Church Zip Code VA 22041 Bid Reviewer Telephone Number E-Mail Address Date of Birth Gender (703)569-6495 2/22/10 1/1/1915 Male Female Location & Date Information About The Medical Professional Last Name First Name Middle Name Reed James Business Address City, State, Zip Code Telephone Number 5510 Alm lave Invingfield, UA (703)642-5550 License Number Licensing State E-Mail Address (if any) C101647046 Vc Reminder about Eligibility Requirements This definition of disability may be different from definitions used This form is intended for applicants for U.S. citizenship who seek an by the U.S. Social Security Administration and U.S. Department of exception to the English and civics testing requirements for Veterans Affairs or used in worker's compensation claims; however, naturalization \"because of physical or developmental disability or such disability determinations may be considered as evidence. mental impairment.\" In general, applicants for naturalization are Preparation of the Certification required to learn and demonstrate knowledge of the English language, including an ability to read, write, and speak words in All questions must be answered fully and accurately, using common ordinary usage in the English language, as well as demonstrate terminology that a person without medical training can understand, with knowledge and understanding of the fundamentals of the history, no abbreviations. Copies of relevant medical reports/records may be principles, and form of government of the United States (civics). attached to support the claim indicated. However, a supplemental report is not acceptable as a substitute for any of the responses. Definition of Disability or Impairment: USCIS recommends that the certifying medical professional The disability or impairment rendering the individual incapable of complete the fillable electronic Form N-648 provided on the USCIS meeting the testing requirements must be long-term; result from Web site (\"Immigration Forms\" link www.uscis.gov). If typed or anatomical, physiological, or psychological abnormalities (which can completed manually, print legibly in black ink. be supported by medically acceptable techniques); and result in If you need more space, attach additional pages, indicating item, functioning so impaired as to render an individual completely unable applicant's name, and your signature on each. (See instructions for to learn and demonstrate the required knowledge. further details). Applicant (Patient) Attestation/Release of Information I, HAWA HERSI , authorize Dr. JAMES REED (Applicant's Name) (Licensed medical doctor, doctor of osteopathy, or clinical psychologist) to release to U.S. Citizenship and Immigration Services (USCIS) all relevant physical and mental health information related to my medical status for the purpose of applying for an exception from the English language and U.S. civics requiremente of perjury, pursuant to Title 28 U.S.C. Section 1746, that the information on aware that the knowing placement of false information on Form N-648 and 1 11/27/2009 40323 324c. I understand that if this form is not completely filled out or if I fail MAILROOM e requested disability exception. Has any United States or State government agency mac orm? Yes No NOTE: If you answered \"Yes,\" 40323 Signature of Applicant (or Applicant's authorized representative) HAWA HERSI Date 11/13/2009 ACTION COMPLETED Form N-648 (Rev. 07/01/09) Y APPROVED FOR FILING Initials:RB Date 220 FCO/WAS Unit: exam"
}