{
  "anumber": "A28068003",
  "id": "A28068003_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0049/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Clearance Requirements for Aliens Seeking Adjustment of Status"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Medical Clearance Requirements for Aliens Seeking Adjustment of Status Medical Estimated Time Action Condition For Clearance Required *Suspected 5 - 30 Days The applicant must provide to a civil surgeon a psychological or Mental psychiatric evaluation from a specialist or medical facility for final Conditions classification and clearance. Tuberculin Immediate The applicant should be encouraged to seek further medical evalua- Skin Test Reaction tion for possible preventive treatment. and Normal Chest X-Ray Tuberculin 10 - 30 Days The applicant should be referred to a physician or local health Skin Test Reaction department for further evaluation. Medical clearance may not be and Abnormal Chest X-Ray granted until the applicant returns to the civil surgeon with documenta- or Abnormal Chest X-Ray tion of medical evaluation for tuberculosis. (Inactive/Class B) Tuberculin 10 - 300 Days The applicant should obtain an appointment with physician or local Skin Test Reaction health department. If treatment for active disease is started, it must be and Abnormal Chest X-Ray completed (usually 9 months) before a medical clearance may be or Abnormal Chect X-Ray granted. At the completion of treatment, the applicant must present to (Active or Suspected the civil surgeon documentation of completion. If treatment is not Active/Class A) started, the applicant must present to the civil surgeon documentation of medical evaluation for tuberculosis. Hansen's 30 - 210 Days Obtain an evaluation from a specialist or Hansen's disease clinic. If the Disease disease is indeterminate or Tuberculoid, the applicant must present to the civil surgeon documentation of medical evaluation. If disease is Lepromotous or Borderline (dimorphous) and treatment is started, the applicant must complete at least 6 months and present documentation to the civil surgeon showing adequate supervision, treatment, and clinical response before a medical clearance is granted. **Venereal 1 - 30 Days Obtain an appointment with a physician or local public health Diseases department. An applicant with a reactive serologic test for syphilis must provide to the civil surgeon documentation of evaluation for treatment. If any of the venereal diseases are infectious, the applicant must present to the civil surgeon documentation of completion of treatment. Immunizations Immediate Immunizations are not required, but the applicant should be encouraged Incomplete to go to physician or local health department for appropriate immunizations. HIV Immediate Post-test counseling is not required, but the applicant should be Infection encouraged to seek appropriate post-test counseling. * Mental retardation; insanity; previous attack of insanity; psychopathic personality, sexual deviation or mental defect; narcotic drug addition; and chronic alcoholism. Chancroid; gonorrhea; granuloma inguinale; lymphogranuloma venereum; and syphilis. Form I-693 (Rev. 09/01/87) N"
}