{
  "anumber": "A28068003",
  "id": "A28068003_0009",
  "page_index": 9,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0009/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 4/24023, Form I-458, Application to Register Permanent Residence or Adjust Status."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Please save this notice for your records. Please enclose a copy if you have to write us or a U.S. Consulate about this case, or if you file another application based on this decision. You will be notified separately about any other applications or petitions you have filed. Additional Information GENERAL. APPROVAL OF AN IMMIGRANT PETITION. The filing of an application or petition does not in itself allow Approval of an immigrant petition does not convey any right a person to enter the United States and does not confer any or status. The approved petition simply establishes a basis other right or benefit. upon which the person you filed for can apply for an immigrant or fiance(e) visa or for adjustment of status. A person is not guaranteed issuance of a visa or a grant of INQUIRIES. adjustment simply because this petition is approved. Those You should contact the office listed on the reverse side of this processes look at additional criteria. notice if you have questions about the notice, or questions about the status of your application or petition. We recommend If this notice indicates we have approved the immigrant you call. However, if you write us, please enclose a copy of petition you filed, and have forwarded it to the Department this notice with your letter. of State Immigrant Visa Processing Center, that office will contact the person you filed the petition for directly with information about visa issuance. APPROVAL OF NONIMMIGRANT PETITION. In addition to the information on the reverse of this notice, Approval of a nonimmigrant petition means that the person for the instructions for the petition you filed provide additional whom it was filed has been found eligible for the requested information about processing after approval of the petition. classification. If this notice indicated we are notifying a U.S. Consulate about the approval for the purpose of visa issuance, For more information about whether a person who is already and you or the person you filed for have questions about visa in the U.S. can apply for adjustment of status, please see issuance, please contact the appropriate U.S. Consulate Form I-485, Application to Register Permanent Residence or directly. Adjust Status."
}