{
  "anumber": "A28068003",
  "id": "A28068003_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 10. Additional questions. ( (Continued.), Form N-4 (00 ( (Rev. 10/15/07) Y Page 7"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1933,
        1945
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 10. Additional questions. (Continued.) Write your USCIS \"A\"- number here: A 28068003 B. Affiliations. 8. a Have you ever been a member of or associated with any organization, association, fund Yes No foundation, party, club, society or similar group in the United States or in any other place? b. If you answered \"Yes,\" list the name of each group below. If you need more space, attach the names of the other group(s) on a separate sheet(s) of paper. Name of Group Name of Group 1. 6. 2. 7. 3. 8. 4. 9. 5. 10. 9. Have you ever been a member of or in any way associated (either directly or indirectly) with: a. The Communist Party? Yes No b. Any other totalitarian party? Yes No c. A terrorist organization? Yes No 10. Have you ever advocated (either directly or indirectly) the overthrow of any government by force or violence? Yes No 11. Have you ever persecuted (either directly or indirectly) any person because of race, religion, national origin, membership in a particular social group or political opinion? Yes No 12. Between March 23, 1933 and May 8, 1945, did you work for or associate in any way (either directly or indirectly) with: a. The Nazi government of Germany? Yes No b. Any government in any area (1) occupied by, (2) allied with, or (3) established with the help of the Nazi government of Germany? Yes No c. Any German, Nazi, or S.S. military unit, paramilitary unit, self-defense unit, vigilante unit, citizen unit, police unit, government agency or office, extermination camp, concentration camp, prisoner of war camp, prison, labor camp or transit camp? Yes No C. Continuous Residence. Since becoming a Lawful Permanent Resident of the United States: 13. Have you ever called yourself a \"nonresident\" on a Federal, state or local tax return? Yes No 14. Have you ever failed to file a Federal, state or local tax return because you considered yourself to be a \"nonresident\"? Yes No Form N-400 (Rev. 10/15/07) Y Page 7"
}