{
  "anumber": "A28068003",
  "id": "A28068003_0008",
  "page_index": 8,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0008/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Action, I-797CC"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2009,
        2023,
        2008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Department of Homeland Security U.S. Citizenship and Immigration Se es I-797C, Notice of Action STATES NOTICE DATE Request for Applicant to Appear for Naturalization Initial Interview October 02, 2009 CASE TYPE USCIS A# N400 Application For Naturalization A 028 068 003 APPLICATION NUMBER RECEIVED DATE PRIORITY DATE PAGE NBC*000004499 December 08, 2008 December 08, 2008 1 of 1 APPLICANT NAME AND MAILING ADDRESS Please come to: HAWA HERSI USCIS # 1314E 2675 PROSPERITY AVENUE 3709 SOUTH GEORGE MASON DRIVE 2ND FLOOR FALLS CHURCH VA 22041 ROOM 200 FAIRFAX VA 20598 On (Date): Monday, November 09, 2009 At (Time): 08:00 AM You are hereby notified to appear for an interview on your Application for Naturalization at the date, time, and place indicated above. Waiting room capacity is limited. Please do not arrive any earlier than 30 minutes before your scheduled appointment time. The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this letter immediately to the USCIS office address listed below with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. If you are applying for citizenship for yourself, you will be tested on your knowledge of the government and history of the United States. You will also be tested on reading, writing, and speaking English, unless on the day you filed your application, you have been living in the United States for a total of at least 20 years as a lawful permanent resident and are over 50 years old, or you have been living in the United States for a total of 15 years as a lawful permanent resident and are over 55 years old, or unless you have a medically determinable disability (you must have filed form N648 Medical Certification for Disability Exception, with your N400 Application for Naturalization). You MUST BRING the following with you to the interview: This letter. Your Alien Registration Card (green card), Any evidence of Selective Service Registration. Your passport and/or any other documents you used in connection with any entries into the United States. Those items noted below which are applicable to you: If applying for NATURALIZATION AS THE SPOUSE of a United States Citizen; Your marriage certificate. Proof of death or divorce for each prior marriage of yourself or spouse, Your spouse's birth or naturalization certificate or certificate of citizenship. If applying for NATURALIZATION as a member of the United States Armed Forces; Your discharge certificate, or form DD 214. If copies of a document were submitted as evidence with your N400 application, the originals of those documents should be brought to the interview. PLEASE keep this appointment, even if you do not have all the items indicated above. If you have any questions or comments regarding this notice or the status of your case, please contact our office at the below address or customer service number. You will be notified separately about any other cases you may have filed. USCIS has a free booklet to help you study for the naturalization test. Ask about 'Learn About the United States: Quick Civics Lessons' when you go to have your fingerprints taken at the Application Support Center. USCIS Office Address: USCIS Customer Service Number: U.S. CITIZENSHIP AND IMMIGRATION SERVICES (800) 375-5283 2ND FLOOR 2675 PROSPERITY AVENUE APPLICANT COPY FAIRFAX VA 20598- Form I-797C (Rev. 01/31/05) N"
}