{
  "anumber": "A28068003",
  "id": "A28068003_0022",
  "page_index": 22,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0022/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application,"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 11. Your signature. Write your USCIS \"A\"- number here: A 28068003 I certify, under penalty of perjury under the laws of the United States of America, that this application, and the evidence submitted with it, are all true and correct. I authorize the release of any information that the USCIS needs to determine my eligibility for naturalization. Your Signature Date (mm/dd/yyyy) 11-19-2008 Part 12. Signature of person who prepared this application for you. (If applicable.) I declare under penalty of perjury that I prepared this application at the request of the above person. The answers provided are based on information of which I have personal knowledge and/or were provided to me by the above named person in response to the exact question! contained on this form. Preparer's Printed Name Preparer's FOIA (b)(6) FOIA (b)(6) Date (mm/dd/yyyy) Preparer's Firm or Organization Name (If applicable) Preparer's Daytime Phone Number 11/19/2008 N/A FOIA (b)(6) Preparer's Address - Street Number and Name City State Zip Code FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) FOIA (b)(6) NOTE: Do not complete Parts 13 and 14 until a USCIS Officer instructs you to do so. Part 13. Signature at interview. I swear (affirm) and certify under penalty of perjury under the laws of the United States of America that I know that the contents of this application for naturalization subscribed by me, including corrections numbered 1 through and the evidence submitted by me numbered pages 1 through , are true and correct to the best of my knowledge and belief. Subscribed to and sworn to (affirmed) before me Officer's Printed Name or Stamp Date (mm/dd/yyyy) Complete Signature of Applicant Officer's Signature Part 14. Oath of Allegiance. If your application is approved, you will be scheduled for a public oath ceremony at which time you will be required to take the following oath of allegiance immediately prior to becoming a naturalized citizen. By signing, you acknowledge your willingness and ability to take this oath: I hereby declare, on oath, that I absolutely and entirely renounce and abjure all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty, of whom or which I have heretofore been a subject or citizen; that I will support and defend the Constitution and laws of the United States of America against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I will bear arms on behalf of the United States when required by the law; that I will perform noncombatant service in the Armed Forces of the United States when required by the law; that I will perform work of national importance under civilian direction when required by the law; and that I take this obligation freely, without any mental reservation or purpose of evasion; so help me God. Printed Name of Applicant Complete Signature of Applicant Hawa Hersi Form N-400 (Rev. 10/15/07) Y Page 10"
}