{
  "anumber": "A28068003",
  "id": "A28068003_0018",
  "page_index": 18,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0018/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "misc"
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 9. Information about your children. Write your USCIS \"A\"- number here: A 28068003 A. How many sons and daughters have you had? For more information on which sons and 8 daughters you should include and how to complete this section, see the Instructions. B. Provide the following information about all of your sons and daughters. If you need more space, use a separate sheet(s) of paper. Full Name of Date of Birth USCIS \"A\"- number Current Address Son or Daughter (mm/dd/yyyy) Country of Birth (if child has one) (Street, City, State and Country) Saida Hagi Dirie Austin, Texas, USA 12/20/1943 U.S. Citizen Somalia A Ahmed Hagi Dirie Dead 01/01/1940 A N/A Somalia Shamsa Hagi Dirie Bayreuth, Germany 09/12/1945 N/A Somalia A FOIA (b)(6) Add Children Go to continuation page Part 10. Additional questions. Please answer Questions 1 through 14. If you answer \"Yes\" to any of these questions, include a written explanation with this form. Your written explanation should (1) explain why your answer was \"Yes\" and (2) provide any additional information that helps to explain your answer. A. General Questions. 1. Have you ever claimed to be a U.S. citizen (in writing or any other way)? Yes No 2. Have you ever registered to vote in any Federal, state or local election in the United States? Yes No 3. Have you ever voted in any Federal, state or local election in the United States? Yes No 4. Since becoming a Lawful Permanent Resident, have you ever failed to file a required Federal state or local tax return? Yes No 5. Do you owe any Federal, state or local taxes that are overdue? Yes No 6. Do you have any title of nobility in any foreign country? Yes No 7. Have you ever been declared legally incompetent or been confined to a mental institution within the last five years? Yes No Form N-400 (Rev. 10/15/07) Y Page 6"
}