{
  "anumber": "A28068003",
  "id": "A28068003_0088",
  "page_index": 88,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0088/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Action, I-797"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2010,
        2023,
        2008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Department of Homeland Security Screened by NARA, 4/24/2023 U.S. Citizenship and Immigration Ser I-797, Notice of Action NOTICE DATE Request for Applicant to Appear for Naturalization Re-Interview February 12, 2010 CASE TYPE USCIS A# N400 Application For Naturalization A 028 068 003 APPLICATION NUMBER RECEIVED DATE PRIORITY DATE PAGE NBC*000004499 December 08, 2008 December 08, 2008 1 of 1 APPLICANT NAME AND MAILING ADDRESS Please come to: HAWA HERSI USCIS # 1314E 2675 PROSPERITY AVENUE 3709 SOUTH GEORGE MASON DRIVE 2ND FLOOR FALLS CHURCH VA 22041 ROOM 200 FAIRFAX VA 20598 On (Date): Monday, February 22, 2010 At (Time): 10:40 AM You are hereby notified to appear for an interview at the date, time and place indicated above, for the following reason(s): Naturalization Re-Interview FLB22 10:32AM Waiting room capacity is limited. Please do not arrive any earlier than 30 minutes before your scheduled appointment time. If for any reason you cannot keep this appointment, return this letter immediately to the USCIS office address listed below with your explanation and a request for a new appointment; otherwise, no further action will be taken on your application. You MUST BRING the following with you to the interview: This letter. Your Alien Registration Card (green card). Your driver's license or State I.D. Your passport and/or any other documents you used in connection with any entries into the United States. PLEASE keep this appointment, even if you do not have all the items indicated above. If you have any questions or comments regarding this notice or the status of your case, please contact our office at the below address or customer service number. You will be notified separately about any other cases you may have filed. USCIS Office Address: USCIS Customer Service Number: U.S. CITIZENSHIP AND IMMIGRATION SERVICES (800) 375-5283 2ND FLOOR 2675 PROSPERITY AVENUE APPLICANT COPY FAIRFAX VA 20598- Form I-797 (Rev. 01/31/05) N"
}