{
  "anumber": "A28068003",
  "id": "A28068003_0034",
  "page_index": 34,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0034/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Department of Homeland Security, U.S. Citizenship and Immigration Services"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 OMB No. 1615-0060; Expires 08/31/08 Department of Homeland Security N-648, Medical Certification U.S. Citizenship and Immigration Services for Disability Exceptions Part I. This section to be completed by applicant. (Please print or type information in black ink) Last Name First Name Middle Name Alien Registration Number HERSI HAWA Address APT13/46 A028068003 Social Security Number 3709 South George Mason Drive 228-47-2391 City State Zip Code Falls Church Virginia 22041 Telephone Number Date of Birth (mm/dd/yyyy) Gender I, HAWA HERSI authorize JAMES REED (Applicant's Name) (Licensed medical doctor, doctor of osteopathy or clinical psychologist) To release all relevant physical and mental health information related to my medical status to the U.S. Citizenship and Immigration Services (USCIS) for the purpose of applying for an exception from the English language and U.S. civics testing requirements for naturalization. I certify under penalty of perjury, pursuant to Title 28 U.S.C. Section 1746, that the information on this form and any evidence submitted with it are all true and correct. I am aware that the knowing placement of false information on the Form N-648 and related documents may also subject me to civil penalties under8 U.S.C. 1324c. I Signature Date 10-10-2008 Part II. This section to be completed by a licensed medical doctor, doctor of osteopathy or licensed clinical psychologist. (See Instructions.) Purpose of This Form: The individual named above is applying to become a U.S. citizen. Applicants for naturalization are required to learn and/or demonstrate knowledge of the English language, including an ability to read, write and speak words in ordinary usage in the English language, as well as knowledge and understanding of the fundamentals of the history, and of the principles and form of government of the United States. Individuals who are unable, because of a disability and/or impairment(s) to learn and/or demonstrate this required knowledge may apply for a waiver. The purpose of this form is to help determine whether your patient is eligible for this waiver. Definition of Disability and/or Impairment(s): An individual is eligible for this waiver if he or she is unable to learn and/or demonstrate knowledge of English and/or U.S. history and civics because of a physical or developmental disability, or mental impairment (or a combination of impairments). These disability and/or impairment(s) must result from anatomical, physiological or psychological abnormalities, which can be shown by medically acceptable clinical and laboratory diagnostic techniques. The disability and/or impairment(s) must result in functioning so impaired as to render an individual unable to demonstrate the required knowledge. NOTE: This definition of disability is different from the definition used by the Social Security Administration, Department of Veterans Affairs or worker's compensation we will require the applicant to submit a revised or second Form N-648 with the appropriate information. Provide all of the following required information, using common terminology that a person without medical training can understand, with no abbreviations. Type or print clearly in black ink. Illegible and incomplete forms will be returned. If you need additional space to provide your answers, attach additional pages. Nature and duration of disability and/or impairment(s). 1. (a) Based on your examination of the applicant, the applicant's symptoms, previous medical records, clinical findings or tests, does the applicant have any disability and/or impairment(s) that affect his or her ability to learn and/or demonstrate knowledge? Yes No NOTE: If you answer \"No,\" applicant is ineligible for a waiver; please continue with Part II. 6. (b) Has the applicant's disability and/or impairment(s) lasted or do you expect it to last 12 months or longer? Yes No NOTE: If you answer \"No,\" applicant is ineligible for a waiver; please continue with Part II. 6. (c) Is the applicant's disability and/or impairment(s) the direct effect of the illegal use of drugs? Yes No NOTE: If you answer \"Yes,\" applicant is ineligible for a waiver; please continue with Part II. 6. Form N-648 (Rev. 01/13/06)Y"
}