{
  "anumber": "A28068003",
  "id": "A28068003_0071",
  "page_index": 71,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0071/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "WASHINGTON DISTRICT OFFICE - EXTERNAL OUTING SHEET"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Thailand",
        "Mexico",
        "India",
        "Panama",
        "Kenya",
        "Germany",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2010,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 WASHINGTON DIS CT OFFICE - EXTERNAL OUTING SHEET Please Charge All Outgoing Files to RC 121 KB0264 B ABQ - Albuquerque, NM HNT - Huntsville Hearing POO - Portland, OR AGA - Agana, GUQ HOU - Houston, TX PRO - Providence, RI 20 ALB - Alba IMP- Imperial, CA RAL - Raleigh/Durham, NC ANC - Anchorage, AK INP - Indianapolis, IN RDF - Records Digitization 307 ATL - Atlanta, GA JAC - Jacksonville, FL REN - Reno, NV BAL - Baltimore, MD KAN - Kansas City, MO RIT, Rome Italy BKK, Bangkok Thailand KND - Kendall, FL SAA - Santa Ana, CA BOI - Boise, ID LAW- Lawrence, MA SAC - Sacramento, CA BOS - Boston, MA LDN, London U. Kingdom SAJ - San Juan, PR BUF - Buffalo, NY LOS - Los Angeles, CA SEK, - Seoul Korea 28068003 SEA Seattle, WA CHA - Charlotte Amalie LOU - Louisville, KY CHI - Chicago, IL LSC - Law Enf. Support SFR - -San Francisco, CA CHL - Charleston, NC LVG - Las Vegas, NV SLC - Salt Lake City, UT CIN - Cincinnati, OH MEM - Memphis, TN SNA - San Antonio, TX CLE - Cleveland, OH MEX, Mexico City Mexico SND - San Diego, CA CLM - Columbus, NJ MIA - Miami, FL SNJ - San Jose, CA CLT - Charlotte, NC MIL - Milwaukee, WI SPM - St. Paul, MN CNJ - Cherry Hill, NJ MPH, Manila Philippines SPO - Spokane, WA COW - HQ, Washington DC NBC - National Benefit Center SSC, Southern Service Center DAL - Dallas, TX NBO, Nairobi, Kenya STA - St. Albans, VT DEN - Denver, CO NDI, New Delhi India STL - St. Louis, MO DET - Detroit, MI NEW - Newark, NJ TAM - Tampa, FL DSM - Des Moines, IA NOL - New Orleans, LA TUC - Tucson, AZ ELP - El Paso, TX NOR - Norfolk, VA VNA, Vienna Austria ESC, Vermont Service Center NRC, National Record Center WPB - West Palm Bch, FL FKG - Frankfurt, Germany NSC, Nebraska Service Center WSC, Western Service Center FLO - Florence Process NYC - New York, NY YAK - Yakima, WA FRE - Fresno, CA OAK - Oakdale, LA ZAR, Arlington, VA FSA - Fort Smith, AR OKC - -Oklahoma City, OK ZCH, Chicago, IL GCU - Garden City, NY OKL-Oakland Park, FL ZHN - Houston, TX HAR - Hartford, CT OMA - Omaha, NE ZLA, Los Angeles, CA HBG, Harrisonburg VA PHI - Philadelphia, PA ZMI, Miami, FL HEL - Helena, MT PHO - Phoenix, AZ ZNK, Newark, NJ HIA- Hialeah, FL PIT - Pittsburgh, PA ZNY - New York, NY HHW - Honolulu, HI PNM, Panama City Panama ZSF, San Francisco, CA HLG - Harlingen, TX POM - Portland, ME If you do not see the FCO listed above please indicate the FCO you need in the blank space above **Note: All sites listed above are File Control Offices according to NFTS. If you need a file to be sent to another location not listed, the file MUST be sent to the District Office for that jurisdiction. (Information per Records Operating Handbook) Live Application: I-485 Family Based I-485 Employment Based I-485 Asylum I-485 Refugee I-485 Other I-130 Imm. Relative I-130 Pref. Based I-751 Joint N-400 N-400 Military Other Shipping Information Account #: Service Type: UPS USPS (Regular Mail) FED EX FROM (FCO, Dept Name): WAS Exms/sh PHONE: NFTS CODE: DATE: 3/8/2010 DUE DATE: 54536 561951"
}