{
  "anumber": "A28068003",
  "id": "A28068003_0020",
  "page_index": 20,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0020/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: Part 10. Additional questions. ( (Continued.), Form number: Form N-4 ("
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 10. Additional questions. (Continued.) Write your USCIS \"A\"- number here: A 28068003 D. Good Moral Character. For the purposes of this application, you must answer \"Yes\" to the following questions, if applicable, even if your records were sealed or otherwise cleared or if anyone, including a judge, law enforcement officer or attorney, told you that you no longer have a record. 15. Have you ever committed a crime or offense for which you were not arrested? Yes No 16. Have you ever been arrested, cited or detained by any law enforcement officer (including USCIS or former INS and military officers) for any reason? Yes No 17. Have you ever been charged with committing any crime or offense? Yes No 18. Have you ever been convicted of a crime or offense? Yes No 19. Have you ever been placed in an alternative sentencing or a rehabilitative program (for example: diversion, deferred prosecution, withheld adjudication, deferred adjudication)? Yes No 20. Have you ever received a suspended sentence, been placed on probation or been paroled? Yes No 21. Have you ever been in jail or prison? Yes No If you answered \"Yes\" to any of Questions 15 through 21, complete the following table. If you need more space, use a separate sheet (s) of paper to give the same information. Why were you arrested, cited, Date arrested, cited, Where were you arrested, Outcome or disposition of the detained or charged? detained or charged? cited, detained or charged? arrest, citation, detention or charge (mm/dd/yyyy) (City, State, Country) (No charges filed, charges dismissed, jail, probation, etc.) Answer Questions 22 through 33. If you answer \"Yes\" to any of these questions, attach (1) your written explanation why your answer was \"Yes\" and (2) any additional information or documentation that helps explain your answer. 22. Have you ever: a. Been a habitual drunkard? Yes No b. Been a prostitute, or procured anyone for prostitution? Yes No c. Sold or smuggled controlled substances, illegal drugs or narcotics? Yes No d. Been married to more than one person at the same time? Yes No e. Helped anyone enter or try to enter the United States illegally? Yes No f. Gambled illegally or received income from illegal gambling? Yes No g. Failed to support your dependents or to pay alimony? Yes No 23. Have you ever given false or misleading information to any U.S. government official while applying for any immigration benefit or to prevent deportation, exclusion or removal? Yes No 24. Have you ever lied to any U.S. government official to gain entry or admission into the United States? Yes No Form N-400 (Rev. 10/15/07) Y Page 8"
}