{
  "anumber": "A28068003",
  "id": "A28068003_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Decision on Application for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2010,
        2009,
        2023,
        2008
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 U.S. Department of Homeland Security 2675 Prosperity Avenue Fairfax, Virginia 20598 DEPARTMENT U.S. Citizenship HOMELAND and Immigration SECURITY Services Decision on Application for Naturalization Refer to this File Number: A028 068 003 Date: Februay23 2010 Hawa Hersi 3709 South George Mason Drive Falls Church, VA 22041 This notice is in reference to the N-400 (Application for Naturalization) that you filed on December 8, 2008, 2008, pursuant to Section 316(a) of the Immigration and Nationality Act (INA), 8 U.S.C ยง 1427. On November 9, 2009, and February 22, 2010, you appeared for an interview on your N-400. Pursuant to the investigation and examination of your application, it is deemed that you are ineligible for naturalization because you have not met the English and/or history requirements as set forth in Section 312 of the INA, 8 U.S.C. ยง 1423. Section 312 of the INA, 8 U.S.C. $1423, states, in pertinent part: (a) No person except as otherwise provided in this title shall hereafter be naturalized as a citizen of the United States upon his own application who cannot demonstrate - (1) an understanding of the English language, including an ability to read, write, and speak words in ordinary usage in the English language: Provided, That the requirements of this paragraph relating to ability to read and write shall be met if the applicant can read or write simple words and phrases to the end that a reasonable test of his literacy shall be made and that no extraordinary or unreasonable conditions shall be imposed upon the applicant; and (2) a knowledge and understanding of the fundamentals of the history, and of the principles and form of government, of the United States. (b) (1) The requirements of subsection (a) shall not apply to any person who is unable because of physical or developmental disability or mental impairment to comply therewith. Title 8, Code of Federal Regulations, ยง 312.1, states, in pertinent part: (a) General. Except as otherwise provided in paragraph (b) of this section, no person shall be naturalized as a citizen of the United States upon his or her own application unless that person can demonstrate an understanding of the English language, including an ability to read, write, and speak words in ordinary usage in the English language. (b) Exceptions. The following persons need not demonstrate an ability to read, write and speak words in ordinary usage in the English language:"
}