{
  "anumber": "A28068003",
  "id": "A28068003_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0010/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 OMB No. 1615-0052; Expires 10/31/08 Department of Homeland Security N-400 Application U.S Citizenship and Immigration Services for Naturalization Print clearly or type your answers using CAPITAL letters. Failure to print clearly may delay your application. Use black ink. Part 1. Your Name. (The person applying for naturalization.) Write your USCIS \"A\"- number here: A 28068003 A. Your current legal name. Family Name (Last Name) For USCIS Use Only Hersi Bar Code Date Stamp Given Name (First Name) Full Middle Name (If applicable) Hawa B. Your name exactly as it appears on your Permanent Resident Card. Family Name (Last Name) Remarks Hersi Given Name (First Name) Full Middle Name (If applicable) Hawa C. If you have ever used other names, provide them below. Family Name (Last Name) Given Name (First Name) Middle Name D. Name change (optional) Please read the Instructions before you decide whether to change your name. 1. Would you like to legally change your name? Yes No 2. If \"Yes,\" print the new name you would like to use. Do not use initials or abbreviations when writing your new name. Action Block Family Name (Last Name) Given Name (First Name) Full Middle Name Part 2. Information about your eligibility. (Check only one.) I am at least 18 years old AND A. I have been a Lawful Permanent Resident of the United States for at least five years. B. I have been a Lawful Permanent Resident of the United States for at least three years, and I have been married to and living with the same U.S. citizen for the last three years, and my spouse has been a U.S. citizen for the last three years. C. I am applying on the basis of qualifying military service. D. Other (Please explain) Form N-400 (Rev. 10/15/07) Y"
}