{
  "anumber": "A28068003",
  "id": "A28068003_0045",
  "page_index": 45,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0045/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Biographic Information Form G-325A, GPO: 1987 - 177-4424"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 H. Have you been involved in assisting any other aliens to enter the United States in violation of the law? Yes No I. Have you applied for exemption or discharge from training or service in the Armed Forces of the United States on the ground of alienage and have you been relieved or discharged from that training or service? Yes No J. Are you mentally retarded, insane, or have you suffered one or more attacks of insanity? Yes No K. Are you afflicted with psychopathic personality sexual deviation. mental defect, narcotic drug addiction, chronic alcoholism. or any dangerous contagious disease? Yes No L. Do you have a physical defect, disease, or disability affecting your ability to earn a living? Yes No M. Are you a pauper, professional beggar, or vagrant? Yes No N. Are you likely to become a public charge? Yes No O. Are you a polygamist or do you advocate polygamy? Yes No P. Have you been excluded from the United States within the past year, or have you at any time been deported from the United States. or have you at any time been removed from the United States at government expense? Yes No Q Have you procured or have you attempted to procure a visa by fraud or misrepresentation? Yes No R. Are you a former exchange visitor who is subject to, but has not complied with, the two-year foreign residence requirement? Yes No S. Are you a medical graduate coming principally to work as a member of the medical profession, without passing Parts I and II of the National Board of Medical Examiners Examination (or an equivalent examination)? Yes No T. Have you left the United States to avoid military service in time of war or national emergency? Yes No U. Have you committed or have you been convicted of a crime involving moral turpitude? Yes No If you answered Yes to any question above, explain fully (Attach a continuation sheet if necessary): 27. Completed Form G-325A (Biographic Information) is signed, dated Completed form G-325A (Biographic Information) is not and attached as part of this application. Print or type so that all attached because applicant is under 14 or over 79 years of age. copies are legible. Penalties: You may, by law, be fined up to $10,000, imprisoned up to five years, or both, for knowingly and willfully falsifying or concealing a material fact or using any false document in submitting this application. Your Certification I certify, under penalty of perjury under the laws of the United States of America, that the above information is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking. Signature Date Phone Number Signature of Person Preparing Form if Other than Above I declare that I prepared this document at the request of the person above and that it is based on all information of which I have any knowledge. FOIA (b)(6) G-28 ID Number Volag Number Stop Here (Applicant is not to sign the application below until he or she appears before an officer of the Immigration and Naturalization Service for examination) You HAWA HERSI swear (affirm) that I know the contents of this application that I am signing including the attached documents. that they are true to the best of my knowledge, and that corrections numbered ) to ) were made by or at CL me my request. and that I signed this application with my full, true name: and sworn to before me by the above-named applicant at Public KA (Complete and true signature of applicant) Signed on 222287 (Year) (Signature and title (Month) of officer) It (Day) GPO : 1987 - 177-424"
}