{
  "anumber": "A28068003",
  "id": "A28068003_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Part 3. Information about you., NARA, 4/24023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1988,
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 3. Information about you. Write your USCIS \"A\"- number here: A 28068003 A. U.S. Social Security Number B. Date of Birth (mm/dd/yyyy) C. Date You Became a Permanent Resident (mm/dd/yyyy) 228-47-2391 01/01/1915 03/02/1988 D. Country of Birth E. Country of Nationality Somalia Somalia F. Are either of your parents U.S. citizens? (If yes, see instructions.) Yes No G. What is your current marital status? Single, Never Married Married Divorced Widowed Marriage Annulled or Other (Explain) H. Are you requesting a waiver of the English and/or U.S. History and Government requirements based on a disability or impairment and attaching a Form N-648 with Yes No your application? I. Are you requesting an accommodation to the naturalization process because of a disability or impairment? (See Instructions for some examples of accommodations.) Yes No If you answered \"Yes,\" check the box below that applies: I am deaf or hearing impaired and need a sign language interpreter who uses the following language: I use a wheelchair. I am blind or sight impaired. I will need another type of accommodation. Please explain: Part 4. Addresses and telephone numbers. A. Home Address - Street Number and Name (Do not write a P.O. Box in this space.) Apartment Number 3709 South George Mason Drive 1314E City County State ZIP Code Country Falls Church Fairfax Virginia 22041 USA B. Care of Mailing Address - Street Number and Name (If different from home address) Apartment Number City State ZIP Code Country C. Daytime Phone Number (If any) Evening Phone Number (If any) E-mail Address (If any) ( 703 ) 569-6495 ( 703 ) 569-6495 dirie@us.ibm.com Have all 240-398-8570 Form N-400 (Rev. 10/15/07) Y Page 2"
}