{
  "anumber": "A28068003",
  "id": "A28068003_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Department of Homeland Security U.S. Citizenship and Immigration Services"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1997,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 OMB No. 1615-0060; Expires 08/31/08 Department of Homeland Security N-648,Medical Certification U.S. Citizenship and Immigration Services for Disability Exceptions Instructions What Is the Purpose of This Form? What Experience Must a Medical Professional Have? The laws governing naturalization of immigrants require that USCIS requires that the medical professional completing the applicants for naturalization demonstrate: form have general experience in the area of the applicant's Knowledge of the English language (including an ability to disability, and be qualified to diagnose the applicant's disability read, write and speak words in ordinary usage in the English and/or impairment(s). language); and A doctor who is a general practitioner and not a specialist may complete the form if his or her experience or other qualifications Knowledge and understanding of the fundamentals of the permit him or her to make a disability and/or impairment(s) history, and of the principles and form of government, of the assessment. United States. What If Additional Space Is Needed To implement this law, U.S. Citizenship and Immigration to Furnish the Required Information? Services (USCIS) requires applicants to demonstrate an ability to The medical professional must use the available space on the read, write and speak basic English and to answer basic questions form to type or print the required information clearly in black about the history and government of the United States (civics). ink. If extra space is needed to answer any item, the medical The person asking you to complete this form is seeking a waiver professional may attach additional sheet(s) of paper. On each of the English and/or civics requirements based on a physical or additional sheet include the name and Alien Registration developmental disability or mental impairment. The applicant Number (A#) of the applicant, the Part II item number to which willsubmit this certification form to USCIS, which will the attachment refers, and the complete name of the medical determine if the applicant is eligible for a waiver. professional. Who Is Authorized to Complete This Form? The medical professional may also submit additional medical reports. On each report include the name and A# of the The applicant, or applicant's authorized representative, must applicant and the complete name of the medical professional. complete and sign Part I of this form. However, a supplemental report is not acceptable as a substitute A licensed medical doctor, doctor of osteopathy or licensed for any of the responses required in Part II of this form. clinical psychologist (hereinafter referred to as \"medical What Are Acceptable Responses professional\") must complete Part II of this form. An employee under the direct supervision of a medical professional may fill in to Part II. 2(a) and 3 of the Form? the form based on information directly provided by the treating Part II. 2 (a) requires the medical professional to provide a medical professional. However, the medical professional must clinical diagnosis and description of the applicant's disability sign the form. and/or impairments(s). Part II. 3 requires the medical professional to provide What Is Required for a Waiver? detailed information on the connection between the disability The medical professional completing this form must provide an and/or impairment(s) and the applicant's inability to learn and/or accurate assessment of the applicant's disability and/or demonstrate knowledge of English and/or U.S. history and impairment(s) so that USCIS can determine whether to grant civics. Examples of insufficient and sufficient responses include: the waiver. The medical professional must provide: Example 1: A clinical diagnosis and description of the applicant's Insufficient Response: disability and/or impairment(s) and any applicable DSM-IV codes for each mental impairment (Part II. 2); Part II. 2(a)- The patient is a 75-year-old female who has hypertension and heart disease. She has suffered at least two An explanation of the connection between the impairment(s) heart attacks, one in 1996 and the other in 1997. Last year and the applicant's inability to learn and/or demonstrate she had a cerebral vascular accident (i.e. stroke) with knowledge of English and/or civics (Part II. 3); and paralysis on the left side. Part II. 3- She is unable to learn English and basic U.S. A professional certified opinion whether the applicant is history and civics. (NOTE: The medical practitioner failed unable to learn and/or demonstrate knowledge of English to articulate how any of the conditions listed affect, for and/or civics (Part II. 4 and 5). example, the patient's memory, ability to learn new tasks, If the medical professional does not provide all the required ability to concentrate or ability to perform basic mental information, USCIS cannot grant the waiver unless the applicant activities. The medical practitioner therefore failed to show submits a revised or second Form N-468 with the appropriate that the applicant's condition has so impaired her information. functioning that she is unable to learn or demonstrate knowledge of English and/or U.S. history or civics.) Form N-648 Instructions (Rev. 01/13/06)Y"
}