{
  "anumber": "A28068003",
  "id": "A28068003_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28068003_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: Additional questions. ( (Continued.), Form number: NARA, 4/24023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 4/24/2023 Part 10. Additional questions. (Continued.) Write your USCIS \"A\"- number here: A 28068003 E. Removal, Exclusion and Deportation Proceedings. 25. Are removal, exclusion, rescission or deportation proceedings pending against you? Yes No 26. Have you ever been removed, excluded or deported from the United States? Yes No 27. Have you ever been ordered to be removed, excluded or deported from the United States? Yes No 28. Have you ever applied for any kind of relief from removal, exclusion or deportation? Yes No F. Military Service. 29. Have you ever served in the U.S. Armed Forces? Yes No 30. Have you ever left the United States to avoid being drafted into the U.S. Armed Forces? Yes No 31. Have you ever applied for any kind of exemption from military service in the U.S. Armed Forces? Yes No 32. Have you ever deserted from the U.S. Armed Forces? Yes No G. Selective Service Registration. 33. Are you a male who lived in the United States at any time between your 18th and 26th birthdays Yes No in any status except as a lawful nonimmigrant? If you answered \"NO,\" go on to question 34. If you answered \"YES,\" provide the information below. If you answered \"YES,\" but you did not register with the Selective Service System and are still under 26 years of age, you must register before you apply for naturalization, so that you can complete the information below: Date Registered (mm/dd/yyyy) Selective Service Number If you answered \"YES,\" but you did not register with the Selective Service and you are now 26 years old or older, attach a statement explaining why you did not register. H. Oath Requirements. (See Part 14 for the Text of the Oath.) Answer Questions 34 through 39. If you answer \"No\" to any of these questions, attach (1) your written explanation why the answer was \"No\" and (2) any additional information or documentation that helps to explain your answer. 34. Do you support the Constitution and form of government of the United States? Yes No 35. Do you understand the full Oath of Allegiance to the United States? Yes No 36. Are you willing to take the full Oath of Allegiance to the United States? Yes No 37. If the law requires it, are you willing to bear arms on behalf of the United States? Yes No 38. If the law requires it, are you willing to perform noncombatant services in the U.S. Armed Forces? Yes No 39. If the law requires it, are you willing to perform work of national importance under civilian Yes No direction? Form N-400 (Rev. 10/15/07) Y Page 9"
}