{
  "anumber": "A28754751",
  "id": "A28754751_0001",
  "page_index": 1,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0001/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE, A28 754 751"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1969,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 (Ecc) U.S. DEPARTMENT OF JUSTICE WILL RESIDE: 1959 BAILEY STREET, LOS ANGELES, CALIF. 90033 IMMIGRATION AND NATURALIZATION SERVICE IMMIGRATION BOND File No. A28 754 751 FOIA (b)(6) If this bond is executed by a surety company the following: Rate of premium: Amount of premium $ The name and address of the person who executed a written instrument with the surety company requesting it to post the bond is: B. Name of alien for whom this bond is furnished: (If there is more than one alien, separate schedule showing name of each alien, date and country of his/her birth and arrival data, signed and sealed by the obligor and made part hereof, is attached.) Name: Date and country of birth of alien: DE LEON-Torres, Prudencio 4/28/15 El Salvador Date, port, and means of arrival in United States: Nationality of alien: 8/24/87 near San Ysidro, Calif., without inspection El Salvador C. In consideration of the facts recited in paragraph or paragraphs herein numbered TWO (2) and captioned BOND CONDITIONED FOR THE DELIVERY OF AN ALIEN (and in any rider or riders lettered and captioned attached hereto and made part hereof) the obligor above named, by subscribing hereto, hereby declares that he/she is firmly bound unto the United States in the sum of TWO THOUSAND & NO/ 100 dollars ($ 2000 ) (except that insofar as the bond is that the alien shall not become a public charge the obligor declares himself/herself bound in such amount or successive amounts as are prescribed in paragraph (3) herein) as liquidated damages and not as a penalty, which sum is to be paid to the United States immediately upon failure to comply with the terms set forth in any such paragraph or rider. The obligor further agrees that any notice to him/her in connection with this bond may be accomplished by mail directed to him/her at the above address. If bond is furnished for more than one alien, the obligor agrees that any references herein to alien in the singular sense shall be construed in the plural sense. The obligor acknowledges receipt of a copy of this executed bond and any attached rider or riders specified above. The burden of establishing compliance with the terms of the bond rests on the obligor. If this bond has been executed in consideration of the facts recited in paragraph (1) captioned \"Bond for Maintenance of Status and Departure of Non-immigrant Alien\" and has been furnished for more than one alien, the amount due for each alien who fails to comply with the terms thereof shall be dollars ($ ), not to exceed the total sum of dollars ($ ). D. Signed and sealed in the presence of Name B. Mining Date A, 1987 Name Elezebeck Durand 300 No. Los Angeles St 300 No LOS Angeles St Address Address Los Angeless California Los Ange California (SEAL) (Obligor) E. PLEDGE AND POWER OF ATTORNEY FOR USE WHEN UNITED STATES BONDS OR WOTES ARE DEPOSITED SECURITY The United States Bonds/Notes described in the following schedule are hereby pledged as security the performance and fulfillment of the foregoing undertaking in accordance with 6 U.S.C. 15, 31 CFR Part 225, and Treasury Department Circular 154 (Rewsed) Nated October 31, 1969, and I the obligor named in this bond do hereby appoint the Attorney General of the United States as my attorney for me name toxcollect or to sell, assign and transfer said United States bond or notes and I agree that in case of any default in the performance of any of the conditions hereitta which I have subscribed, my said attorney shall have the power to collect said bonds/notes or any part hereof or to sell, assign, and transfer said bonds/notes or part thereof, without notice, at public or private sale, free from equity of redemption and without appraisement or valuation, notice and right to redeem being waived and to apply the proceeds in whole or in part to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best. COUPONS FACE INTEREST INTEREST TITLE OF BONDS/NOTES ATTACHED VALUE RATE SERIAL NO. DATES PLEDGE AND POWER OF ATTORNEY FOR USE WHEN CASH IS DEPOSITED AS SECURITY The amount of TWO THOUSAND & NO/100 ($ 2000 ), cash money of the United States, is hereby pledged as security for the per- formance and fulfillment of the foregoing undertaking, and I, the obligor named in this bond, hereby appoint the Attorney General of the United States as my attorney for me and in my name to collect or to assign and transfer the said sum of money, and I agree that, in case of default in the performance of any of the conditions herein to which I have subscribed, my said attorney shall have full power to collect said sum of money or any part thereof or to assign and transfer said sum or any part thereof, without notice and to apply said sum or any part thereof to the satisfaction of any damages, demands, or deficiencies arising by reason of such default, as my said attorney may deem best. I further empower my said attorney, in the event all the conditions herein to which I have subscrib- ed have been complied with and the bond is canceled, to deliver the said sum of money plus any interest accrued thereon, to me at my risk and expense by such means as he/she shall select. 4th day Sentember 10 87 IN WITNESS WHEREOF, I have hereunto set my hand and seal this LOS ANGELES Conez FOIA Before me, within the county of in the Stat (b)(6) (or the District of Columbia), personally appeared the above named Teresa de! Carmen Gomez and 1110 of the foregoing power of attorney. 87 Elizabeth Witnessmy hand this (Signature) Ath day of September Durand 19 Deportation Aide (Title) F. Bond approved and accepted Los Angeles California September 4 19 87 (City) (State) (District Director) 1-352 (Rev. 6-1-84)N"
}