{
  "anumber": "A28754751",
  "id": "A28754751_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. DEPARTMENT OF JUSTICE, IMMIGRATION AND NATURALIZATION SERVICE, A28 754 751"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1999
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. DEPARTMENT OF JUSTICE WILL 1999 DATLET STREET, LUS IMMIGRATION AND NATURALIZATION SERVICE I M MSCOCReAbT File No. A28 754 751 FOIA (b)(6) If this bond is executed by a surety company the following: Rate of premium: Amount of premium $ . The name and address of the person who executed a written instrument with the surety company requesting it to post the bond is: B. Name of alien for whom this bond is furnished: (If there is more than one alien, separate schedule showing name of each alien, date and country of his/her birth and arrival data, signed and sealed by the obligor and made part hereof, is attached.) Name: Date and country of birth of alien: DE LEON-Torres, Prudencio 4/28/15 EI Salvador Date, port, and means of arrival in United States: Nationality of alien: 8/24/87 near San Ysidro, Calif., without inspection El Salvador SPECIAL INSTRUCTIONS FOR OBLIGOR TO SPEED ACTION ON DISPOSITION OF \"MAINTENANCE OF STATUS AND DEPARTURE BOND\" WHEN ALIEN DEPARTS OBLIGOR: If this bond was furnished to assure maintenance of status and departure in behalf of one individual alien, as soon as the alien departs from the United States, in accordance with the terms of the bond, complete the block immediately below and mail the form to the office of Immigration and Naturalization Service at which the bond was ac- cepted or other office of the Service if you have been notified that the bond has been transferred to such other office. This will help expedite action on the bond. If this bond was furnished by a surety company, the company should arrange in advance to obtain the desired information from the person who requested it to post the bond. DEPARTURE INFORMATION FURNISHED BY OBLIGOR ON \"MAINTENANCE OF STATUS AND DEPARTURE BOND\" The above named alien departed from the United States: Date of departure Port of departure Name of vessel or airline or other means of departure (Signature of obligor) (Date) F. Los Angeles California September 5 19 98 Bond approved and accepted (City) (State) (District Director) 1-352 (Rev. 6-1-84)N THIS COPY FOR OBLIGATOR ON M/S & DEPARTURE BOND Form Approved OMB No. 1115-0085 EXPIRES 1/87"
}