{
  "anumber": "A28754751",
  "id": "A28754751_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE TO RESPONDENT, I-618"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 NOTICE TO RESPONDENT ANY STATEMENT YOU MAKE MAY BE USED AGAINST YOU IN DEPORTATION PROCEEDINGS THE COPY OF THIS ORDER SERVED UPON YOU IS EVIDENCE OF YOUR ALIEN REGISTRATION WHILE YOU ARE UNDER DEPORTATION PROCEEDINGS, THE LAW REQUIRES THAT IT BE CARRIED WITH YOU AT ALL TIMES If you so choose, you may be represented in this proceeding, at no expense to the Government, by an attorney or other individual authorized and qualified to represent persons before the Immigration and Naturalization Service. You should bring with you any affidavits or other documents which you desire to have considered in connection with your case. If any document is in a foreign language, you should bring the original and certified translation thereof. If you wish to have the testimony of any witness considered, you should arrange to have such witnesses present at the hearing. At your hearing you will be given the opportunity to admit or deny any or all of the allegations in the Order to Show Cause and that you are deportable on the charge set forth therein. You will have an opportunity to present evidence on your own behalf, to examine any evidence presented by the Government, to object, on proper legal grounds, to the receipt of evidence and to cross examine any witnesses presented by the Government. Failure to attend the hearing at the time and place designated hereon may result in a determination being made by the Immigration Judge in your absence. You will be advised by the Immigration Judge, before whom you appear, of any relief from deportation for which you may appear eligible. You will be given a reasonable opportunity to make any such application to the Immigration Judge. NOTICE OF CUSTODY DETERMINATION Pursuant to the authority of Part 242.2, Title 8, Code of Federal Regulations, the authorized officer has determined that pending a final determination of deportability in your case, and, in the event you are ordered deported, until your departure from the United States is effected, but not to exceed six months from the date of the final order of deportation under administrative processes, or from the date of the final order of the court, if judicial review is had, you shall be: Detained in the custody of this Service. Released on recognizance. Released under bond in the amount of $ 2,000 . You may request the Immigration Judge to redetermine this decision. do do not request a redetermination by an Immigration Judge of the custody decision. August 29, 1987 (signature of respondent) (date) REQUEST FOR PROMPT HEARING To expedite determination of my case, I request an immediate hearing, and waive any right I may have to more extended notice. August 29, 1987 (signature of respondent) (date) CERTIFICATE OF SERVICE Served by meat San Diego, California on August 29, 1987 19 Above advisement read to the respondent in the Spanish language Gatzi m. Form I-618 served Legal Services notice served Mutur. kyuna PPA (signature and title of employee or officer)"
}