{
  "anumber": "A28754751",
  "id": "A28754751_0053",
  "page_index": 53,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0053/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 524"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 524 EL SALVADOR against other officers. Also, intimidation of judges and juries by members of the Armed Forces frequently overcomes prosecution efforts made by the Attorney General's Office. No military officer has been successfully prosecuted for human rights violations in recent years. An ongoing prosecution, however, is that of Captain Eduardo Avila in connection with the murder of a Salvadoran labor leader and two U.S. advisors in January 1981. The Attorney General plans to present additional evidence implicating Avila before the courts to supplement that which was presented in June 1985. A lower court and an appeals court determined that the initial evidence was insufficient to warrant prosecution of Avila. f. Arbitrary Interference with Privacy, Family, Home, or Correspondence The Government does not arbitrarily interfere in the personal lives of Salvadoran citizens except in matters it considers related to the armed conflict. Both the Government and the guerrillas use networks of informers. Phone numbers for making accusations to the Armed Forces have been publicized (although little used), and the police rely on informers and anonymous tips about alleged criminal and subversive activities. There is no effort to coorco the public into acting as informants. Members of the Security Forces use forced entry to carry out civilians to leave conflictivo areas. In April the Army arrests and investigations. Government troops have compelled removed over 200 civilian supporters of the guerrillas from around the Guazapa volcano, a guerrilla stronghold. The constitutional provision protecting the inviolability of Postal officials have the legal authority to inspect correspondence is suspended under the state of emergency. correspondence, but there is no government policy to do so, and it is not believed to occur frequently. Section 2 Respect for Civil Rights, Including: a. Freedom of speech and Press Freedom of speech and the press is respected by the Government even though these rights are technically surponded under state of emergency decrees. The only instance during 1985 when the Government formally asked the mass media not to publish information was during the negotiations for the release of the President's daughter, kidnaped by the PMLN. Print and broadcast media did not universally honor the request. but the Government the imposed no sanctions against media coverage during violent is reprinal from the extremes of the political spectrum, negotiations. Self-censorship, sometimes our of fear of the primary constraint on free expression in E1 Salvador. Newspapers have published communiques\" from extremist groups out of fear of reprisal. The leading daily newspapers in the capital are conservative, only response from the Government has been to reduce paid and frequently and vigorously criticize the Government. The"
}