{
  "anumber": "A28754751",
  "id": "A28754751_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Department of Justice Immigration and Naturalization Service Aviso y Petición de Disposición"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 U.S. Department of Justice Immigration and Naturalization Service Aviso y Peticion de Disposicion LEON TORRES, PRUDENCIO A-28754 751 Nombre del extranjero sbbloasq Aviso Usted esta detenido por un oficial del Servicio de Inmigration y Naturalization porque Usted es un extranjero que esta en los Estados Unidos ilegalmente. Este aviso describe las opciones que usted tiene a su disposición. Es necesario que firme abajo para mostrar que Usted ha recibido una copia de este aviso y que lo comprende. Favor de leer el aviso cuidadosamente antes de decidir lo que desea hacer. 1. Derecho a una Audiencia de Deportation Usted tiene el derecho de tener una audiencia de deportación para determinar si Usted puede permanecer en los Estados Unidos. Si pide una audiencia de deportacion, Usted puede ser representado en la audiencia por consejero sin coste al Gobierno de Los Estados Unidos. Para asegurar su presencia a la audiencia, Usted puede ser detenido a menos que pueda poner una cantidad de dinero que perdera si no se presenta. Si se presenta a todas las audiencias necesarias, se le devolvera todo el dinero. 2. Oportunidad de Salida Voluntaria Si desea regresar a su país, puede pedir que le permitan salir en el primer modo de transporte. Si le conceden su peticion, Usted renuncia la oportunidad de tener una audiencia de deportación y su oportunidad de solicitar otro beneficio. Si desea cambiar su decision en cualquier momento antes de partir para su país, se le concedera una audiencia de deportación. 3. Representación por Consejero Usted puede ser representado pro un consejero de su preferencia sin coste al Gobierno de Los Estados Unidos. Si desea consejo legal y no tiene los medios para pagarle a un consejero, puede pedir una lista de servicios legales gratis al publico. Usted puede comunicarse con su consejero ahora o en cualquier momento antes de su salida de los Estados Unidos. 4. Comunicacion con el Consul Usted puede hablar con los oficiales del consulado y oficiales dipiomáticos de su país o nacionalidad. yedness Peticion de Disposición Reconozco que he recibido una copia del aviso antenombrado y que lo comprendo. Comprendo mis derechos y solicito una de las siguientes disposiciones en mi caso. Comprendo que si el gobierno paga por mi viaje de salida de los Estados Unidos, no podré regresar por cinco años a menos que primero obtenga permiso del Procurador General. 1. Deseo pedir una audiencia ante el Juez de Inmigracion para determinar si puedo permanecer en los Estados Unidos o ser deportado. pe dineu Fecha y hora: Aon Aon Firma Testigo 2. Admito que estoy en los Estados Unidos ilegalmente. Deseo renunciar mi derecho a una audiencia ante el Juez de Inmigración y regresar a mi pais en el primer modo de transporte disponible. Comprendo que puedo estar detenido hasta el momento de mi partida. Fecha y hora: 8-25-87 2315 Presidence Firma Testigo El aviso se le fue leido al extranjero por el oficial. El aviso fue leido por el extranjero. Remove at expense of: Government - Cost $ Request for voluntary departure approved: Alien - Cost - $ Signature and Title Date Bednesp Form I-274 (06/27/84)"
}