{
  "anumber": "A28754751",
  "id": "A28754751_0070",
  "page_index": 70,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0070/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 Ut ED STATES DEPARTMENT OF JUSTIC Immigration and Naturalj zatio Service P. 0. Box 2917 El Centro, CA 92244-2917 UNDER DOCKET CONTROL AT SND Prudencio DE LEON-Torres File No: A28 754 751 1959 Baile St. Los Angeles, CA 90033 Date: September 4, 1987 Obligor Receipt #LOS27101 FOIA (b)(6) Dear Sir/Madam: Your case has been transferred to the Office of the Immigration Judge whose address is shown below. That office will mail notice of your hearing date to your address as shown above. You must keep that office advised of any change in your address. If you do not appear for hearing when noticed to do so, three actions may be taken: (1) hearing will be held in your absence; (2) the money paid for your bond will be kept by the Service; (3) a warrant for your arrest shall be issued. Date 9/4/87 144 Very truly yours BY PERSONAL SERVICE ON RESPONDENT Deportation officer Kanth El Centro, California FOR: Detention Officer James B. Turnage, Jr. District Director San Djego, California Place of hearing: U. S. Immigration and Naturalization Office 880 Front St., , Room 5N44 San Diego, CA 92188 Date and hour of hearing: To Be set by the Immigration Court in San Diego, CA. NOTE: You may be represented in this proceeding, at no expense to the Government, by an attorney or other individual authorized and qualified to represent persons before the Immigration and Natural- ization Service. If you wish to be so represented, your attorney or representative should appear with you at the hearing. Released on $ 2,000 cash bond posted at: LOS/Alice on: 9/4/87 mm:hn MESSAGE: WAIT TO BE PICKED UP"
}