{
  "anumber": "A28754751",
  "id": "A28754751_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DECLARATION OF PRUDENCIO DE LEON-TORRES, NARA, 5/5/2023"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 DECLARATION OF PRUDENCIO DE LEON-TORRES My name is Prudencio de Leon-Torres. I was born on April 28, 19/5 in a place called Soyapango, Department of San Salvador, El Salvador. I was raised there also. I used to work as a gardener for the IVU (Instituto de Vivienda Urbana), the Institute of Urban Housing. I worked for this institute for 25 years. I retired in 1985. Groups of guerrillas used to come right on the propery of the IVU to do military training. They regularly conducted training and exercises there, including the explosion of small bombs they threw. Guerrillas came to hide at this place very often whenever there was a confrontation. The IVU workers were afraid to tell the police because the guerrillas had threatened to kill us if we did. Someone finally told them and since 1985 the Civil Defense began coming to guard the institute. Guerrillas came to the major stores in Colonia Guadalupe, Soyapango to steal food, money and whatever they could find. I was a member of the volunteer Civilian Patrols for 25 years. The guerrillas have threatened to kill Civilian Patrol volunteers. Many current and former members of the Civilian Patrols have been killed by the FMLN guerrillas in El Salvador. One friend of mine, Santos Navidad, with whom I served on the Patrulla Civil, was killed by the guerrillas a few years ago, dragged out of his home and murdered. Others were killed too, although I don't remember their names. I declare under penalty of perjury that the above said is true and correct to the best of my knowledge. X Pruder cio 6 Seas"
}