{
  "anumber": "A28754751",
  "id": "A28754751_0014",
  "page_index": 14,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0014/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEportation Case Check Sheet, 170"
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 DEPORTATION CASE CHECK SHEET File: A- 2875475 ATTORNEY OR ALIEN: REPRESENTATIVE: ADDRESS: ADDRESS: Com- ACTIONS TO BE COMPLETED pleted Initials Com- ACTIONS TO BE COMPLETED (Date) pleted Initials (Date) I-94 I-95 Stamped 252(b) CASES M-125 Decket Control Tape I-99 Notice of Revocation and Penalty I-210 Voluntary Departure Notice I-259 Notice to Detain and Deport I-205 Warrant of Deportation ARRANGING TRANSPORTATION I-229 Warning of Six-month Limit - 242(e) I-288 Notice to Transportation Line I-217 Information=Travel I-217A Document Application I-380 Record of Billable Expense I-141 Medical Certificate I-340 Demand for Surrender I-294 Nouce of Dep'n Destination Under Bond and Penalty for Recentry I-166 Notice to Surrender for Deportation I-323 I-391 Bond Breach Cancellation G-391 Detail of Det. Off. I-241 T.D. Request Country Designated by Alien I-216 Record of Person & Property Transferred T.D. (C-N) Request Country of Nationality I=164 Document Envelope Passport Noted - O.I. 242.10(g) DETAINED CASES CLOSING ACTIONS I-286 Notice of Detention or Release Conditions I-157 Notice of Deportation I-200 G-189 Warrant for Arrest of Alien G-174 Statistical Punch Card I-203 Order to Detain or Release Alien G-143 Lookout Notice declared Worksheet Departure Verified G-589 Property Receipt Disposition Notice - FBI ac. G-590 Property Envelope Disposition-Notice - RCMP CO 12/23/88 I-43 Statement of Detained Alien Baggage & Personal Effects Deportation Elpense Billed to FBI I-284 Notice re Decention and prepared I-94 Deportation Expenses I-95 Stamped Forwarded and 143 to R.O. Closed Tape Placed 99,File 161/1-154 closed I-247 Notice of Detainer Closed File Stamped To Stocistics\" 1-151/0-554) VAIDER Rec. Adm. Re MAR 15 1989 I-154 Closed CODED DOCKET CLEARED Disposition Information furnished the following: Alien (is)(is not) detained and is ready for deportation to at the expense of . (Name of SS Co. . Government) Alien's condition is: Able Mental CINS Physically Incap. Date Deportation Officer Remarks: Form 10170 (Rev. 9-15-78)N United Stores Department of Justice, Immigration and Naturalization Service"
}