{
  "anumber": "A28754751",
  "id": "A28754751_0059",
  "page_index": 59,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0059/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 530"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1979,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 530 EL SALVADOR The the CDH receives complaints of human rights violations by both jails government forces and the FMLN. CDH representatives visit its and prisons to look for persons reported missings and validity of complaints of human rights abuse. To make itself staff physicians examine arrestees to determine the more accessible to the public, the CDH has opened field Ana, and San Miguel. The CDH has been successful in offices in the departmental capitals of San Vicente, Santa governmental institutions. representing individual interests before military and civilian Tutela Legal's small staff carries out some on-site the investigations, takes testimony from individuals, and primarily on newspaper reporting, supplemented by other press as a major source. The other organizations uses rely testimony, CDHES Socorro Juridico refuses to name its sources. sources such as announcements by guerrilla groups and personal broadcast Government and echo allegations of human rights violations the and some other groups consistently and vocally criticize kidnaping of mayors as legitimate military targets and have the on guerrilla radio. They have also justified repeated the false guerrilla claims that some of the victims of. PRTC murder of 13 people in June were killed in harmed One was briefly taken into custody on charges \"cross-fire.\" However, no member of such groups has a been unrelated to her activity in these groups. The Government has with arrested and charged two other members of these organizations Their membership in and active support for guerrilla groups cases are before the Decree 50 courts. Amnesty 1984, International Report 1985, which covers events during prolonged and detention without trial, torture, disappearances, expressed continued concern about arbitrary arrest and \"partly free.\" extrajudicial executions. Freedom House rates E1 Salvador ECONOMIC, SOCIAL, AND CULTURAL SITUATION El Salvador had an estimated population of 5 million in mid-1985 emigration. with a growth rate of 2.5 percent annually, excluding $650. The estimated per capita GDP for 1985 is about The GDP grow by 1.5 percent in real terms in has Adjusted for population growth, the decline following 1983. & cumulative decline of 25 percent between 1984 1979 and cotton, 25 percent and industry for 17 percent of GDP. Coffee, about not yet been arrested. In 1984, agriculture accounted probably for exports. sugar, and shrimp comprise the bulk of E1 Salvador's Adding to the adverse economic effects of six of world internal violence, E1 Salvador's economy has suffered years from the exports, recession, declining prices for the country's main prompted American Common Market (CACM). The violence partners in the Central and sharply reduced demand from its trading private large-scale capital, flight, precipitous reduction been slow appears to have been largely halted, investment has decline investment and increased unemployment. Although this in large to resume and the economy remains troubled a inflation, and an unbalanced budget. balance-of-payments deficit, external debt, rising by A Salvador dramatic shift in the ownership of nearly 25 reform agricultural land brought about under percent the of E1 The program has affected E1 Salvador's social agrarian transfer sweeping social and economic reform is designed structure. in landholders ownership to those of who farmlands worked from the land. the small number of part large to"
}