{
  "anumber": "A28754751",
  "id": "A28754751_0050",
  "page_index": 50,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0050/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 521 EL SALVADOR occur their and that prisoners are sometimes not permitted to read confessions before signing them. According an additional to government figures, 215 guerrilla and themselves 153 guerrilla supporters voluntarily combatants turned debriefing, destination such persons are transported by the After in between January and October 25. general, of their choice. Captured guerrillas CDH to the guerrilla permitted to perform surgery on doctors were received adequate treatment. For example, have, foreign in hand. leader Nidia Diaz to improve movement captured in her injured There 1985. were The no complaints of torture in the penitentiaries and conjugal guards are not abusive and prisoners receive family in water, and include maager food rations, scarcity of penal potable institutions visits. Although problems at the larger gainful overcrowding, there are some opportunities give political are permitted their own internal organization charged with and subversion employment by the prisoners. Inmatos for themselves. classes which they organize and are rarely used. Punishment cells are primitive, but teach reportedly psychological The FMLN claims that it respects the \"physical many credible integrity\" of its captivos. However, and are killed by reports of civilians being kidnaped there later Forces and to the guerrillas. Fiftoon members of after surrendering guerrillas and of soldiers being executed and The guerrillas guerrillas between January 1 and October kidnaped and killed by one member of the Civil Defense were the Armed town administrator denied medical treatment to Antonio 25, 1985. Morazan, abandoned him on the bank for the Torola April. The guerrillas prior to his kidnaping, in late been in an accident of San Simon, Morazan, who had Hernandez, injured and where death. soldiers found him on September 26, unconscious River in near d. Arbitrary Arrest, Detention, or Exile The Constitution provides for the suspension guarantees 50) in times of emergency. Special of civil politically-mocivatus and treason, judicial handling rebellion, crimes such as provides for separate procedures and legislation (Decree of the overthrow Participation in organized sabotage, political violence the Government, without actively political views opposed to of the Government by force. groups Holding dedicated to arrest. against the Government, is noc supporting a basis for Under made by present the state of emergency legislation, upon denunciation Security Forces without a warrant arrests and can made be disposition by an accuser who remains anonymous. can be The Various magistrate who, like trial by an instructional of arrested persons is determined release levels of the judicial process, may magistrates decide at or continued detention of a suspect for additional on the"
}