{
  "anumber": "A28754751",
  "id": "A28754751_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0015/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 1. ALIEN'S NAME OFFICE FILE NUMBER 2. COUNTRY DESIGNATED BY ALIEN DATE APPLIED FOR DENIED DATE CONSUL EMBASSY HOME AUTHORITIES 3. COUNTRY OF WHICH A CITIZEN DATE APPLIED FOR DENIED DATE CONSUL EMBASSY HOME AUTHORITIES 4. COUNTRY OF WHICH A NATIONAL OR SUBJECT DATE APPLIED FOR DENIED DATE CONSUL EMBASSY HOME AUTHORITIES 5. COUNTRY OF WHICH LAST A RESIDENT BEFORE DATE APPLIED FOR DENIED DATE ENTERING U.S. CONSUL EMBASSY HOME AUTHORITIES 6. COUNTRY FROM WHICH ALIEN LAST ENTERED U.S. DATE APPLIED FOR DATE DENIED 7. COUNTRY OF FOREIGN PORT FROM WHICH EMBARKED FOR U.S. OR FOREIGN CONTIGUOUS TERRITORY DATE APPLIED FOR DATE DENIED B. COUNTRY WHERE BORN DATE APPLIED FOR DATE DENIED 9. COUNTRY WHERE PLACE OF BIRTH NOW SITUATED DATE APPLIED FOR DATE DENIED 10. COUNTRY WHERE ALIEN RESIDED PRIOR TO ENTERING COUNTRY FROM WHICH HE ENTERED U.S. DATE APPLIED FOR DATE DENIED 11. COUNTRY WHICH HAD SOVEREIGNTY OVER BIRTHPLACE AT TIME OF BIRTH DATE APPLIED FOR DATE DENIED 12. OTHER COUNTRY APPLIED TO DATE APPLIED FOR DATE DENIED 13. OTHER COUNTRY APPLIED TO DATE APPLIED FOR DATE DENIED 14. STATE DEPARTMENT ASSISTANCE REQUESTED ON: RESULTS 15. ASSISTANCE OF SERVICE OFFICER ABROAD RESULTS REQUESTED OFFICE DATE 16. TO REGIONAL COMMISSIONER REGARDING RESULTS 243(g) ACTION COUNTRY DATE 17. REASONS FOR NOT APPLYING ELSEWHERE 18. FINAL DETERMINATION MADE THAT, UNDER EXIST- SIGNATURE TITLE ING CONDITIONS, A TRAVEL DOC. TO EFFECT DATE DEPORTATION IS NOT AVAILABLE RECORD OF MEASURES TAKEN TO OBTAIN TRAVEL DOCUMENT FOR DEPORTATION GPO 933-364"
}