{
  "anumber": "A28754751",
  "id": "A28754751_0051",
  "page_index": 51,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0051/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 522"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 522 EL SALVADOR investigation before charges are brought or trial begins. In practice, it is impossible to say how many arrests are not based on reasonable cause, as even dismissal of charges at the investigative level often reflects ineffective investigation or is a matter of convenience in an overburdened judicial system. Salvadoran arrest procedures require prisoners to be taken directly to the brigade or police headquarters and registered. For the most part, the police and Armed Forces have complied with this regulation. However, there continue to be some charges of prisoners being taken to unofficial interrogation sites before entering a penal institution. Once registered in a detention center, arrestoos can be held for eight days before they can be visited by the ICRC, CDH, and Tutela Legal. Under Decree 50, arrestoos must be released or consigned to a military investigative\" judge within 15 days of arrest. Many prisoners are released during this initial phase, after preliminary interrogation and investigation. If consigned to a judge, arrestees must be informed of the charges against them within 15 days of consignment. Once they are so informed they have a right to legal counsel. The investigative judge must reach a decision within 60 days of receiving the case. If the case has merit, he sends it to the military judge of the First Instance (the actual trial judge) Decree 50 requires the First Instance judge to hand down is decision within 43 days of receiving the caso. In practice, few cases are handled so quickly; Decree 50 cases usually stay on schedule until they reach the First Instance court, and remain at that stage for an indefinite period. Processing of Decree 50 cases was halted in May 1985, when guerrillas assassinated the sole First Instance Judge handling those cases. The judge was replaced in July and adjudication of cases resumed. As of the and of September, about 500 persons held under Decree 50 were awaiting trial, about the same number as a year previously. Between January and November of 1985, 30 persons were convicted under Decree 50 and seven were acquitted. Charges were dismissed in 113 other cases. In cases of common crime, police may detain a suspect up to 72 hours before presenting him to an investigative judge for release or detention for further investigation. In theory, the investigational phase may not last more than 87 days, subject to extension for investigation. In practice, those time limitations are not always followed; the backlog of cases in the system is the major reason for delay. There are no legal provisions for exile, or for the revocation of citizenship. The Government prohibits forced labor. However, leftist guerrillas have subjected kidneped Salvadoran peasants to forced labor. Victime state that they were forced to travel with the guerrillas and cook, do laundry. and perform other chores."
}