{
  "anumber": "A28754751",
  "id": "A28754751_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "INMIGRATION BOND FOR MAINTENANCE OF STATUS AND DEPARTURE OF NONIMMIGRANT ALIEN, FOIA ((b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 G. 1) BOND FOR MAINTENANCE OF STATUS AND DEPARTURE OF NONIMMIGRANT ALIEN In consideration of the granting of the application of the aforenamed alien for permission to enter or remain temporarily in the United States as a nonimmigrant under section 101(a)(15) of the Immigration and Nationality Act, provided there is furnished a suitable bond, the obligor hereby furnishes such bond with the following conditions: If said alien is admitted to the United States for temporary period as a nonimmigrant, or is granted an extension of temporary admission, or is granted a change in nonimmtgrant classification, and if said alien shall comply with all the conditions of each specific nonimmigrant status which he/she is accorded while classified in such status, in cluding the condition that unauthorized employment shall not be accepted, and actually departs from the United States without expense thereto on or before the date to which he/she is authorized to remain in the United States or such subsequent date as may be authorized in extension of his/her lawful temporary stay beyond such date, without notice to the obligor: then this obligation shall be void; otherwise it shall immediately become due and payable, and provided further, that no adjustment of the immigration status of said alien shall be construed to impair or diminish this obligation. It is further understood and agreed that if the said alien from time to time visits foreign territory contiguous to the United States and is permitted after inspection by a United States Immigration Officer to return to the United States prior to final departure as required by this obligation, such absence shall not be construed to discharge or in any manner relieve the obligor from the conditions, liabilities and obligations of this bond. (2) BOND CONDITIONED FOR THE DELIVERY OF AN ALIEN In consideration of the granting of the application of the above alien for release from custody under a warrant of arrest issued by the Attorney General charging that he/she is unlawfully in the United States, provided there is furnished a suitable bond as authorized by sec- tion 242 of the Immigration and Nationality Act, the obligor hereby furnishes such bond with the following conditions: if said alien is released from custody and if the above mentioned obligor shall cause the said alien to be produced or to produce himself/herself to an immigration officer of the United States upon each and every request of such officer until deportation proceedings in his/her case are finally terminated or until the said alien is actually accepted by such immigration officer for detention or deportation, then this obligation shall be void; otherwise it shall immediately become due and payable; Provided, that it is hereby specifically agreed by the obligor that no order issued by or under the authority of the Attorney General by virtue of which issuance or execution of any order of deportation is or may be deferred, or by virtue of which the said alien is or may be permitted to depart from the United States, shall be in any manner con- strued to impair or render void this obligation or any part thereof. (3) BOND THAT ALIEN SHALL NOT BECOME A PUBLIC CHARGE In consideration of the granting of the application of the above alien for permission to enter the United States, provided there is fur- nished a suitable bond that he/she will not become a public charge, the obligor hereby furnishes such bond with the following conditions: If said alien is admitted to the United States and within five years of admission is supported at public expense, whatever the cause may be and whether it arises prior to or subsequent to arrival of said alien in the United States, the obligor shall pay to the United States, or to any State, Territory, county, town, municipality, or district thereof, by whom said alien shall have been supported, any or all charges or ex- penses arising therefrom. The obligor is not relieved from this undertaking if the public authority supporting the alien is not authorized to accept reimbursement or fails to make a demand therefor; the obligor agrees that in such event he/she promptly will pay the actual ex- penses to the Immigration and Naturalization Service. If the obligor fails, within thirty (30) days after notice to him/her by the public authority which has supported the alien at public expense, or within thirty (30) days after notice to him/her by the Service that the alien has been supported at public expense, to pay all charges or expenses as aforesaid, then this obligation shall immediately become due and payable in the total sum of such charges or expenses plus five hundred dollars ($500), provided that in no event shall the liability of the obligor exceed the total amount of the bond. Any such amounts collected by the Service which are not turned over to the public authority supporting the alien will be deposited in the Treasury of the United States. Notwithstanding any violation of this bond and any payment made pursuant to the terms thereof, this obligation shall remain in full force and effect as to the remainder of the liability of this obligation until the bond may be cancelled or until such time as the alien may depart permanently from the United States or become a naturalized citizen thereof or until 5 years following his/her admission have passed; and it is further agreed that suit to enforce any of the conditions of this bond may be instituted for and on behalf and in the name of the United States and to the use of any interested State, Territory, county, town, municipality, or district thereof. (4) BOND FOR RELEASE OF ALIEN UNDER EXCLUSION PROCEEDINGS In consideration of the granting of the application of the above named alien for release from custody subsequent to his/her exclu- sion from admission to the United States or pending the final disposition of his/her application for admission to the United States, provid- ed there is furnished a suitable bond that he/she will deliver himself/herself into the custody of an immigration officer on demand, the obligor hereby furnishes such bond with the following conditions: If said alien is released from custody and if the above obligor shall cause the said alien, as frequently as required, to be delivered to an immigration officer, until such time as said alien is finally admitted to or finally departs from the United States and proof satisfactory to the immigration officer of such departure is made, or such alien is final- ly accepted by such officer for detention of deportation, then this obligation shall be void; otherwise it shall immediately become due and payable, provided, that no order issued under the authority of the Attorney Genera! by virtue of which the said alien is or may be granted additional time to comply with terms of his/her release, or by virtue of which execution of an order of deportation is or may be deferred, or by virtue of which the said alien is or may be permitted to depart voluntarily from the United States, shall be in any manner construed to impair or render void this obligaiton or any part thereof. However, if it is ordered that said alien be admitted temporarily to the United States as a nonimmigrant under section 101(a)(15) of the Immigration and Nationality Act on the condition that there be furnished a suitable bond in the same sum as specified in block (C), the obligor agrees that in such event he/she shall be bound in accordance with the conditions set forth in paragraph No. (1) captioned \"Bond for Maintenance of Status and Departure of Nonimmigrant Alien\" H. SUBSTITUTION OF SECURITY The obligor hereby deposits security of equal value, described hereunder, in substitution for the security hereinbefore pledged. It is agreed that the pledge and power of attorney previously executed applies to the new security completely, even as to a default which may have antedated this substitution. DESCRIPTION OF SECURITY: Signed and sealed in the presence of- Date Name Name Address Address (Witness) (Witness) (AFFIX SEAL) Approved and accepted 19 (Citv) (State) FOIA (b)(6)"
}