{
  "anumber": "A28703181",
  "id": "A28703181_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28703181_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "ESTADO LIBRE Y SOBERANO DE ZACATECAS, RECUBIACION DE RENTAS, PAPEL ESPECIAL PARA CERTIFICADOS DE LAS ACTAS"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1957
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/9/2023 GENERAL UNITED ULT ESTADO LIBRE TAFATEFAS, ZAC. RECAUSACION DE RENTAS UNIDOS DE EXACATION SECURITY DEPARTMENT PAPEL ESPECIAL PARA CERTIFICADOS DE LAS ACTAS DEL REGISTRO CIVIL Ano demil novecientos En nombre de. la Republica de Mexicoy comos Iuez del Estado civil deeste. lugar hago saber a los que la presente vieren, y certifico ser cierto, queenellibros número del registro civil que es amicargoaia foja se.encuentra asentada una Actudeltenor siguienta del- CIUDADAN 0 Jesús Medrano Jefe Departamento de Archivo General del Estado, CERTIFICA Que en el libro de copias de actas de Nacimientos, per- teneciente al Registro Civil del Municipio de Tlattenango de-us Zac., y que corresponde al primer semestre del año de 1957 mil- novecientos cincuenta y siete, a fojas ocho aparece una partida del tenor siguiente: AL MARGEN -Número 18 dieciocho Ernesto Ruiz. -9/0.-AL CEN - TRO .-En Tlaltenango de Sánchez Roman, Zac., a las 13.15 trece - ESTADO LIBRE horas quince minutos del día 9 hueve de enero de 1957 mil nove-- cientos cincuenta y siete, ante m1 Antonio Salinas, Presidente-- Municipal encargado del Registro Civil de esta ciudad, compare-- ció el señor Manuel Ruiz, mexicano, casado agricultor de 42 cua- renta y dos anos, vecino de esta ciudad presentó para su regis-- tro un niño vivo que nació el día 27 veintisiete de diciembre -- próximo pasado a las 7 siete horas en la casa número 20 veinte- ARCHIVO GENERA de la calle Obregon y a quien lepone el nombre de Ephesto, hijo- DEL ESTADO legítimo-del exponente y de su esposa Dolores R mirez de 41 cua- renta y un años; abuelos paternos Cesareo Ruiz y Epigmenia Ortiz finados: maternos Pablo Ramirez y María Castro, esta finada. Fue ron testigos los señores Felipe Orozco y Francisco Castro, mexi- canos, solteros mayores de edad y vecinos de esta ciudad. Leida- la presente firmóel que supo. -Antonio Salinas Felipe Orozco. --- Francisco Castro. Rubricas. Es copia fielmente sacada del libro antes citado que se ex- pide a solicitud del interesado, para los us os legales que al -- mismo convengan, en la ciudad de Zacatecas, Zac., a veintinueve- de julio de mil novecien setenta y dos. Jesús Medran Avalos."
}