{
  "anumber": "A28754751",
  "id": "A28754751_0072",
  "page_index": 72,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0072/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RECORD OF DEPORTABLE ALIEN"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        2030,
        1986
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 RECORD OF DEPORTABLE ALIEN (See A.M. - 2790.31 34 for Instructions) Family Name (Capital Letters) Given Name Middle Name Sex Hair Eyes Complexion DE LEON-Torres, Prudencio M GRY BRO MED Country of Citizenship Passport Number and Country of Issue File Number Height Weight Occupation EL SALVADOR 128 754 751 64 130 LABORER U.S. Address (Residence) (Number) (Street) (City) (State) (Zip Code) Scars or Marks NEARLY BLIND Date, Place, Time, Manner of Last Entry Passenger Boarded At F.B.I. No. Marital Status Widow(er) 8-24-87 NR POE SYS EWI AFOOT Single Married Separated Divorced Number, Street, City, Province (State) and Country of Permanent Residence EL SALVADOR Method of Location/Apprehension COL, SUYAYA AV. LETONA #3 RIS. SOYAOANGO, SAN SALVADOR BP TC Birthdate Date of Action Location Code (At/Near) Date & Hour 4-28-15 (72) 8-25-87 SDC SCM SCM 8-25-87 2030 City, Province (State) and Country of Birth AR Form: (Type & No.) Lifted By SOYAPANGO, SAN SALVADOR, EL SALVADO Not Lifted GALLAGHER, PEREZ, HARRIS Visa Issued At-NIV No. Social Security Account Name Status at Entry Status When Found EWI TRVL Date Visa Issued Social Security No. Send C.O. Rec. Check Length of Time Illegally in U.S. To: 2ND W/72 Immigration Record Criminal Record CLAIMS NONE CLAIMS NONE Name, Address, and Nationality of Spouse (Maiden Name, if appropriate) Number & Nationality of minor Children LUCIA CARMEN SFA DEC'C EL SALVADOR Father's Name, and Nationality and Address, if Known Mother's Present and Maiden Names, Nationality, and Address, if Known JUAN DE LEON SFA DEC'D CORNELIA TORRES SFA DEC'C Monies Due/Property in U.S. Not in Immediate Fingerprinted Lookout Book Checked Deportation Charge(s) (Code Words) Possession None Claimed See Form 1-43 Yes No Not Listed Listed, Code ROTEN Name and Address of (Last) (Current) U.S. Employer Type of Employment Salary From: To: $ hr. Narrative (Outline particulars under which alien located/apprehended Include details, not shown above, re time, place, manner of last entry, and elements which establish ad- ministrative and/or criminal violation Indicate means and route of travel to interior) Alien has been advised of communication privileges pursuant to 8 CFR 242.2(e). Initial Date 8-25-87 FUNDS:NONE BAGS: NONE 8908 0482 SUBJECT WAS APPREHENDED AT THE SAN CLEMENTEDCHECKPOINT AND WAS DETERMINED TO RE AN UNDO CUMENTED CITIZEN OF EL SALVADOR. SUBJECT STATES THAT HE ENTERED THE UNITED STATES AS PER THE ABOVE ENTRY DATA at A PLACE OTHER THAN A DESIGNATED PORT OF Entry. SUBJECT WAS ADVISED OF HIS EL SALVADOR RIGHTS AND HIS I-274 RIGHTS FORM AND REQUESTED A VOLUNTARY RETURN TO EL SALVADOR. SUBJECT DOES NOT QU LIFY UNDER THE IMMIGRATION REFORM ACT OF 1986 or theIRCA PROVISIONS. COSTA QUESTIONS: 1. SUBJECT STATES THAT HE WAS TRAVELING WITH HIS GRANDDAUGHTER AND GREAT GRANDSON. 2. SUBJECT STATES THAT HE WAS NOT TRAVELING TO MEET WITH OTHER FAMILY MEMBERS. 3. SUBJECT STATES THAT HE WAS REING SMUGGLED INTO THE UNITED STATES. 4. SUPJECT STATES THAT HIS FINAL DESTINATION WAS TO LOS ANGELES SEARCHED 9% any 186L (If space insufficient, show \"continued\" and continue on reverse, from bottom up): Charlese Fruitley (Signature and Title) BPA DISTRIBUTION Received (subject and documents) (report of interview) from C. FRUTCHEY Recent Officer: 8-25-87 19 at ( ). M. Disposition HOLD/DEP unclose 8/29/87 lto (Receiving Officer) By Form 1-213 (Rev. 4-16-79)Y UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service"
}