{
  "anumber": "A28754751",
  "id": "A28754751_0055",
  "page_index": 55,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0055/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 526"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 526 EL SALVADOR Employees institutions of private businesses or autonomous associations have a constitutional right government bargain or labor unions to defend employee to form professional to joining public institutions are barred employees from non-autonomous collectively, and to strike. Although interests, of recognized unions, these employees in fact have by law proposal which and strike. The Government is bargain collectively, associations which act as unions, legally peasant labor would extend collective bargaining studying a their own associations. Salvadoran labor rights to recognition statutes and elect their own officers. groups Government draw up group. There is no government-sponsored political considerations. of these groups is nor based on campaigns. have worked on behalf of parties parties, in political some unions Unions are independent of political labor though Unions International may join national and international The the World Confederation of Free Trade federations affiliates. Confederation of Labor (WCL) have Unions (ICFTU) and The Government World Federation of Trade links with Communist-dominated Some Salvadoran unions have loose Salvadoran the Labor Organization and unions maintain ties with the Unions International (WFTU). (ILO). The request Labor of Ministry the routinely mediates labor disputes to instances binding in which interested labor and parties. management In 1985 there were at three the the political arbitration by the Labor Ministry. voluntarily submitted across for which its Forces ban on a June 4 labor freely. In spite of an Armed spectrum domonstrate openly and Groups demonstration organizers took place without had not obtained incident. a permit, demonstration the Duarte's Only one June complaint has been made to the ILO occupation by 1984 inauguration, arising from since the President illegal Institute (ISSS) strikers of the central Social many social non-striking Hospital Salvadoran in May workers 1985. During Security the occupation, entitled. security medical treatment to which were unable to obtain the during the Also, strike the number of hospital patients they were who patients leaders being treated was greater was smaller than normal than though the died number of guerrilla made radio no stations, attempt to disavow support usual, they The received strike's from death threats made against nor the to ISSS separate Director themselves from General. procedures On May 27, prescribed a labor judge by the ruled labor the ISSS strike illegal because by ignored the union the prior to calling the strike. code had not been followed police entered judget's order to return to work. The On strikers then withdrew the from illegal occupation of a \"public two union leaders for directing the hospital, arrested June 2, and killed four the hospital. The police building, and no of deaths the or injuries policemen of hospital during the workers operation, mistakenly but there shot were leaders security forces' actions. The or patients because management well while in police stated they had been were treated released June 5: they publicly two arrusted labor June 6. finally reached agreement and custody. the strike Labor ended and"
}