{
  "anumber": "A28703181",
  "id": "A28703181_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28703181_0002/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition to Screened by NARA, 5/9/2023, FORM I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1914,
        1977,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/9/2023 UNITED STATES DEPARTMENT OF JUSTICE Form App oved Immigration and Naturalization Service OMB NO. 43-RO 401 PETITION TO Fee Stamp PLEASE NOTE CLASSIFY STATUS OF YOU ARE THE PETITIONER ALIEN RELATIVE FOR AND YOUR RELATIVE REC'D T/C SEP 15 1977 ISSUANCE OF IS THE IMMIGRANT VISA BENEFICIARY FOIA (b)(6) A28 703181 1. Name of benefic APS) (First) (Middle) 2. DotNot Write in This Space 3. Names, birthdates and countries of birth of FOIA (b)(6) NMP beneficiary's children. 4 Other names used including maiden name if married) R2002/20/8 NONE FOIA (b)( (6) uor 5 Country 6 Date nt beneficiary's birth (Month, day, year) FOIA (b)(6) FOIA (b)(6) 7. My name is: (Last, in CAPS) (First) (Middle) 8. My phone number is: 77:97 RUIZ MARIA DOLORES 936-3488 9. Other names used: (including maiden name if married woman) 10. Relationship of beneficiary to myself MARIA DOLORES RAMIREZ (DE RUIZ) FOIA (b)(6) any 11. ! was born: (Month) (Day) (Year) in: (Town or city) (State or Province) (Country) 7/20/1914 TLALTENANGO, ZAC., MEXICO FOLA (b) If you are a citizen of the United States, give the following: a. Citizenship was acquired: (Check one) through birth in the U.S. through parents through naturalization through marriage (1) If acquired through naturalization, give name under which naturalized, number of naturalization certificate, and date and place of naturalization: NOT APPLICABLE. (2) If acquired through parentage or marriage, have you obtained a certificate of citizenship in your own name? (a) If so, give number of certificate and date and place of issuance: (b) If no submit evidence of citizenship. in accordance with instruction 3 a (2) If you are a lawful permanent resident alien of the United States. give the following: a. Alien Registration Number b. Date, place, and means of admission for lawful permanent residence A-FOIA (b)(6) FOIA (b)(6) Beneficiary arital status: 15. Name of beneficiary's spouse, if married, and date and country of birth (Omit this item if petition is for your spouse) Married Widowed Divorced Single NOT APPLICABLE. Full address beneficiary's spouse and children. if any (Omit this item if petition is for your spouse) NONE. If this petition is for your spouse or child. give the following: a. Date and.place of your present marriage Names of my prior spouses Names of beneficiary's prior spouses 9/30/33 ZAC., MEXICO Has this beneficiary ever been in the U. S.? -0- YES NO OFFICIAL SEAL Are beneficiary and petitioner related by adoption? EDILIA ESPINOZA YES NO NOTARY PUBLIC - CALIFORNIA LOS ANGELES COUNTY (CONTINUE WITH ITEM 20 ON REVERSE) OATH OR AFFIRMATION OF PETITIONER My comm. expires FEB 7. 1980 I swear (affirm at I know the contents of this petition signed by me and that the statements herein are true and correct, 22 Pennsylvania Ave., Los Andeles CA 90033 Signature of petitioner (See Instruction No. 5) Maria Poloris Subscribed and sworn to (affirmed) before me this 13 day of A.D 19 at Cenzele (SEAL) My commission expires 2/7/80 Augustram Mcdon (TITL Putlic Bill (SIGNATURE OF OFFICER ADMINISTERING OATH) SIGNATURE OF PERSON PREPARING FORM IF OTHER THAN PETITIONER I declare that this document was prepared by me at the request of the petitioner and is based on all information of which I have any knowledge. Enyune (SIGNATURE) a magaen 958 SOUTH (ADDRESS) FLOWER ST. L.A. CAL. , 8/13/1977 (DATE) FORM 130 RECEIVED TRANS. IN RET'D TRANS. OUT COMPLETED (REV. 1-1-77) N"
}