{
  "anumber": "A28754751",
  "id": "A28754751_0048",
  "page_index": 48,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0048/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 519"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 519 EL SALVADOR Untrained been and undisciplined local Civil Defense members July in May. A Civil Defense commander was of civilian cited in for human rights abuses, including the killing have they did San Vicente Department for threatening residents arrested if in Government not enlist in the Civil Defense program. and human is addressing the problem by offering both The harsh Armed Forces troops, in some instances, reports have that regular rights training. There are credible military who provide treatment to masas, the guerrillas civilian meted our maintain much of the logistical infrastructure necessary supporters to priests, their operations in the field. A of human meet regularly with military units to lecture Commission (CDH), as well as the official Human Rights group 13 in the rights field. and discuss problems which soldiers may confront. about Charges practices made by guerrillas that the Salvadoran Air evidence. indiscriminate bombing are not supported Force by hard Most of those reports querrilla-controlled guerrilla accusations originate testimony employ taken in media or in from Salvadoran of Government abuses for their political masas. These regularly fabricated bombing pilots generally follow the strict impact. In few regulations designed to prevent civilian government killed a instances, however, civilians have been injured casualties. or while on April 15, three members of a family San Jose Guayabal, by bombing as the result of error. In helicopter hiding in is granary, apparently by a rocket were killed attack in support of National Guardsmen who fired from a bombed were killed in E1 Ocotal, when an Air Force two of children by the guerrillan. In August, a woman and were under her small a marking round that had mistakenly plane neither settlement survivors. identified In the mistake as the target. The Air Force acknowledged the and paid compensation to the case were civilians the intended targets. b. Disappearance The November number of press-reported civilian disappearances Legal persons abducted by guerrillas. By comparison, were 303 runaway children and criminal cases. There disappearances also such as 1985 was 129, including non-political through reported 23 casos of disappearance after 1 Tutola presumably the querrillas, by government forces, and 21 cases of detention, by civilian accounts often describe \"heavily Newspaper mon in eyewitness from January-October 1985. abduction and clothing\" as perpotrators of the seizures. armed unacknowledged reappear in detention by Armed or Security Forces, held in Some of the \"disappeared\" are found to have been declined the criminal justice system. This only has to with the implementation of detention problem requiring ICRC, Tutela prompt notification of the arrest to procedures the family, the Legal, and the CDH. particularly difficult Disappearances how to the to track as many cases are are reported disappearances press. Also, it is impossible to tell not or enlistment into are guerrilla actually desertions ranks. of family, many emigration,"
}