{
  "anumber": "A28754751",
  "id": "A28754751_0063",
  "page_index": 63,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0063/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "United Nations High Commissioner for Refugees, CH-1211 Geneva 10"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Canada",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        2023,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 NATIONS UNIE UNITED NATIONS HAUT COMMISSARIAT .HIGH COMMISSIONER POUR LES ACFUCIES F 0 ARMEFUGEES JUN 15 1981 Telegrammes HICOMREF Polals was Nollons Telex: 22.212 on 22.544 CW/S/LA C11-1211 BELIVE 10. 366011 510211 29 May 1981 Dear Mr. Cram, It was indeed a great pleasure to meet you and your colleagues in Ceneva and to have had this valuable opportunity of further strengthening our cooperation. One of the topica we discussed related to the present situation of Salvadorians. As you are aware, in situations of large- scale influx it is frequently impracticable to resort TO an indivi- dual determination of refugee status due to the large numbers involved and also to the frequent necessity to provide assistance and protection on an emergency basis. In order 10 overcome these various difficulties, recourse has frequently been had TO what is known as \"prima facic group determination\". This is based on the assumption that in view 01 the conditions prevailing in the country of origin, all members of the group should, in the absence of clear indications to the contrary, be regarded as refugees. As regards persons who have left Salvador after the outbreak of the Civil War early in 1980, we considered that the above-mentioned conditions are indeed fulfilled. Concerning Salvadorians who have left their country prior to the outbreak of the Civil War, it is possible that a number of them may be exposed to serious danger in the event of their returning to their country of origin, 2 matter which would need to be examined in the light of the circumstances of the particular case. Ag far as resettlement is concerned, we were happy to meet Mr. W.K. Bell last month who estimated that Canada would be able 20 receive several hundred Salvadorean refugees this year not including Mr. C. Cram Chairman, Standing Conference of Canadian Organizations Concerned for Refugees 600 Jarvia St."
}