{
  "anumber": "A28754751",
  "id": "A28754751_0075",
  "page_index": 75,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0075/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AVISO DE DERECHOS A EL SALVADORENOS, 8-2587"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 AVISO DE DERECHOS A EL SALVADORENOS El Servicio de Inmigracion y Naturalizacion esta requerido a proveérle a usted este Aviso que describe sus derechos. Usted tiene que firmar abajo para mostrar que usted ha recibido una copia de este Aviso. No firme ninguna otra cosa hasta que usted haya leido este Aviso y entienda sus derechos. 1. EL DERECHO PARA SER REPRESENTADO POR UN ABOGADO. Usted tiene el derecho de ser representado por un abogado de su preferencia y su gasto. Si usted desea consejo legal y no puede emplear a un abogado, usted puede ponerse en contacto con uno de los abogados apuntado en la pagina juntada quienes proveen servicios legales gratis. 2. EL DERECHO A UNA AUDIENCIA DE DEPORTACION. Usted tiene el derecho a una audiencia de deportacion para determinar si usted esta en los Estados Unidos ilegalmente antes de que usted pueda ser deportado. Si usted solicita una audiencia de deportacion, usted puede ser representado en la audiencia por un abogado a su propio gasto. Usted puede ser eligible para que le pongan en libertad, bajo fianza, hasta el tiempo de la audiencia de deportación. 3. EL DERECHO PARA APLICAR PARA ASILO POLITICO. Usted puede ser eligible para asilo politico si usted tiene razon para pensar que usted seria prosecuciado a causa de su raza, religion, nacionalidad,, O por ser miembro de un grupo social particular o opiniones politicas, si usted fuera regresado a El Salvador. Si usted desea aplicar para asilo politico, usted debe informarle al Agente del Servicio de Inmigración y Naturalizacion que le dio este Aviso a usted. 4. EL DERECHO PARA PEDIR SALIDA VOLUNTARIA. Si usted quiere regresar inmediatamente a El Salvador, usted puede pedir que le permitan salir voluntariamente. Estando de acuerdo a, salir voluntariamente, usted abandona el derecho para una audiencia de deportacion y su derecho para aplicar para asilo politico. YO RECONOZCO QUE YO HE RECIBIDO UNA COPIA DEL AVISO SUSODICHO. FECHA: 8.25.87 FIRMA: desire Forders Exhibit B"
}