{
  "anumber": "A28754751",
  "id": "A28754751_0049",
  "page_index": 49,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0049/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 520"
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 520 EL SALVADOR The trafficking Government has recently recognized the adoptive in children, some kidnaped for problem virtual of order to kidnap victims generally try to avoid the families in of such stage kidnapings for ransom Because gangs and guerrillas frequently parents abroad. Common criminal sale to receive little negotiate public the notice. captives release, these publicity kidnapings The guerrillas, most spectacular in cases of kidnapings carried out mayors and 1985 were the kidnapings of 27 by the held the President Duarte's daughter. September 10 kidnaping a number of of other town officials and elected the town: were finally captive President's for as long daughter as six for months. 11 days: some The of guerrillas the mayors exchange turned them over to the Government The guerrillas mayor and the country of 101 wounded prisons the departure for 25 from captured guerrillas in government on October 24 in and announced that December 30, the FMLN clandestine. released in the exchange. eight On other town officials were not guerrillas. One officials from the mayor and an unspecified number radio station abduction Cacaopera had been executed of other that a town in official July 1984 for cooperating with on the the day of their of government and the FMLN pludged not to kidnap in December 1983. Although from Uluazapa had been killed Government and officials remain military officials in the future, family members Force colonel targets. The Civil Aviation government Air early November. serving in a civilian post, was Director, abducted in an C. Torture or Punishment and Cruel, Inhuman, or Degrading Treatment The and Security effort to enforce the code of procedures of notification forces has had a positive effect. the Armed state and CDH that has decreased of arrests the to number family of and abuses. the ICBC, Tutela The timely Legal, prisoners must physical be abuse or intimidation are The procedures All entrance into examined by a physician prohibited. These in need of medical treatment they for have been abused or are a jail to determine whether immediately upon document Public Security, General Vides Minister of Defense procedures and were strengthened when the any reason. inhumano treatment on March 27 which reomphasized the Casanova, issued is confessions under Father they sign. of prisoners The CDH and and their the right illegality to read of the Armed disseminated Forces F. and Delgado police now on a give regular human basic. rights military classes chaplains to the human rights positive values. effort. to educate the military and in June police is on another \"Handbook on Human Rights,\" issued A widely prisoners, The CDH, ICRC, and Tutela Legal, who work Most abuses are although at a lower level than other in forms of abuse continue, say that complaints of torture directly and with reported past years. while The capture interrogation: most and common range being complaints from ;forced threats to are occur to of of stand during death prolonged for to the physical and initial continuous torture. hours of that forced blindfolded; confussions and sleep still deprivation long There periods, are reports often"
}