{
  "anumber": "A28754751",
  "id": "A28754751_0054",
  "page_index": 54,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0054/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 526"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 525 EL SALVADOR views advertising of by government agencies in one of the The the four which appear regularly in at least paid advertisements, the radical left continue to be expressed papers. in University Salvadoran dailies and in articles published three of Controamericanos\" (ECA) and its biweckly newspaper \"Estudios \"Proceso. of Central America's bimonthly journal in the printed Radio news usually covers a wider variety of stories than the society leaders than either newspapers or television news. FDR media and is more broadly diffused in Salvadoran and at least are regularly interviewed on local radio news Salvador. organizations which are operating openly in San front one local station offers air time to those programs FMLN broadcast Local radio stations frequently repeat information by clandestine guerrilla radio stations. The and Government two owns no newspapers. It owns one radio station stations. There are four privately owned television one informational. television stations, one educational and A communiques six-year old decree forbidding publication of Government by the media. When it has been violated, the observed and statements remains in effect and anonymous is largely has taken no action against the reporting media. broadly Academic freedom is guaranteed by the Constitution university interpreted. As in many Latin American and is no jurisdiction authorities routinely assert that local countries, have violent University clashes of El Salvador, closed for four years the National on campus. The main Campus of police early 1984. between students and the army, following in arrests do Though students are not immune from reopened press. or Two for violations of limits on freedom of student status not appear to be made on the basis of arrest, in October instructors were shot on two university speech and motives are 1985; not evident the killings in either remain caso. unsolved, but political campuses b. Freedom of Peaceful Assembly and Association purposes. E1 Salvador permits any association not formed for criminal political Social, labor, professional, religious, groups associations operate freely, including and demonstrations advertisements \"Committee interference. groups marches place critical of the Government. The leftist paid in the newspapers and hold subversion an association of those inmates being Salvador\" held (COPPES), of the Political Prisoners of E1 Even free of government and the prisons of against the state, is permitted to operate for in the advertisements. The Information Secretary political 'of the country and to publish organization, and charged with membership in a was non-governmental in November Human Rights Commission (CDHES) the arrested was unrelated Police have stated that his employment (FARN) The National the Armed Forces of National Liberation guerrilla for six years prior to his to arrest; hiu arrest. Mr. Cacores had worked by for CDHES CDHES.."
}