{
  "anumber": "A28754751",
  "id": "A28754751_0057",
  "page_index": 57,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0057/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 528"
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        1977,
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 528 EL SALVADOR elections will take place in 1989. The legislature is unicameral and is made of 60 deputies who serve for three year terms. Like the president, they are directly elected. Nine political parties, ranging from the moderate left to the conservative right, participated in the March 31, 1985 legislative and municipal council elections. Five political parties gained representation in the legislature. The Christian Democratic Party (PDC) of President Jose Napoleon Duarte won 52 percent of the vote and captured 33 of the 60 seats in the Legislative Assembly: The National Republican Alliance (ARENA) and the National Conciliation Party (PCN) captured 30 percent and 8 percent of the vote, respectively, and earned 13 seats and 12 seats in the assembly, divided according to a coalition agreement between them. The remaining two seats in the assembly were. won by two smaller parties. The PDC won in.153 of the 262 municipalities; the ARENA-PCN coalition in all but one of the others. Mayors and municipal councils were also elected directly in the March elections for the first time since 1977. Though the PDC has a plurality in the Legislative Assembly, debate in the Assembly is vigorous. The Assembly has altered bills submitted. by the President before passing them, and the President has veteed bills passed with the support of his party' deputies. The Constitution requires the legal recognition of all political parties that do not advocate armed opposition, provided they are able to meet the required minimum membership standards of 3,000 followers. Several small political parties, while not represented in the legislature or municipal councils, do have legal status and freely organize and publish their views. The right to membership in any legally recognized political party is unrestricted. Two opposition parties of the left, the National Revolutionary Movement (MNR) led by Guillermo Ungo. and the communist National Democratic Union (UDN), are Legally recognized but have chosen not to participate in legitimate political activity. The MNR and UDN, together with the Popular Social Christian Movement (MPSC), make up the Democratic Revolutionary Front (FDR), the political front which, in alliance with the FMLN, is waging the insurgency. The Government and the majority of the constitutional opposition have expressed support for the integration of the armed leftist groups into the system as peaceful, legal political parties. As in previous years, the guerrillas sought to disrupt the vote during the elections held in 1985. In the weeks prior to the elections, the guerrillas burned more than 25 municipal buildings. They proclaimed a national traffic stoppage three days before the elections in an attempt to prevent citizens from traveling to vote. On election eve, they mined several rural roads in Chalatenange Department, killing or injuring several civilians on their way to the polls. In spite of these efforts, approximately 1.2 million voters went to the polls, representing more than 65 percent of the electorate. Elections were carried out on site in all but 20 of the 262 municipalities in E1 Salvador. Elections in those 20"
}