{
  "anumber": "A28754751",
  "id": "A28754751_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REQUEST FOR ASYLUM IN THE UNITED STATES, Form 1-589"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1915
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 5/5/2023 Form Approved Immigration and Naturalization Service OMB No. 1115-0086 REQUEST FOR ASYLUM IN THE UNITED STATES INS Office: Date: 1. Family Name First Middle Name 2. A number (if any or known) De Leon-Torres, Prudencio A28 754 751 All other names used at any time (include maiden name if married) 3. Sex 4. Marital status Male None Single Divorced Female Married Widowed I was born: (Month) (Day) (Year) in (Town or City) (State or Province) (Country) 04 - 28 - 1915 Soyapango, San Salvador, El Salvador Nationality - at birth At present Other nationalities Salvadoran Same none 5. If stateless, how did you become stateless? N/A 6. Ethnic group 7. Religion 8. Languages spoken Hispanic Catholic Spanish 9. Address in United States (In care of, C/O, if appropriate) 10. Telephone number (Number and street) (Apt. No.) (City or town) (State) (Zip Code) (include area code) 420 N. Benton Way, Los Angeles, CA 90026 (213) 487-5977 11. Address abroad prior to coming to the United States (Number and street) (City) (Province) (Country) / Cononia Suyapan, Soyapango, San Salvador, El Salvador 12. My last arrival in the U.S. occurred on: (Mo/Day/Yr) As a Visitor Student Stowaway Crewman 09/ /87 Other (Specify) EWI At the port of (City/State) Means of arrival (Name of vessel or airline and flight number, etc.) SYS By foot I was was not inspected Date authorized stay expires (Mo/Day/Yr) N/A 13. My nonimmigrant visa number is none it was issued by the U.S. Consul on (If none, state \"none\") (Mo/Day/Yr) at (City, County) 14. Name and location of schools attended Type of school From To Highest grade Title of degree or Mo/Yr Mo/Yr completed certification Escuela Suyapan, El Salvador primary 2/27 10/27 certification 1st 15. What specific skills do you have? 16. Social Security No. (if any) Gardener. none 17. Name of husband or wife (wife's maiden name) Lucia Carbajal 18. My husband or wife resides with me apart from me (if apart, explain why) We separated approximately 22 years ago. Address (Apt. No.) (No. and street) (Town or city) (Province or state) (Country) Soyapango, San Salvador, El Salvador Form I-589 (OVER) (Rev. 3-1-81) N RECEIVED TRANS IN RET'D TRANS OUT COMPLETED Page 1"
}