{
  "anumber": "A28754751",
  "id": "A28754751_0074",
  "page_index": 74,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0074/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice and Request for Disposition"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 U.S. Department of Justice Immigration and Naturalization Service Notice and Request for Disposition A- Name of Alien Notice You are being detained by an Officer of the Immigration and Naturalization Service, because you are an alien who is in the United States illegally. This notice describes those options available to you. You must sign below to show that you have received a copy of this notice and understand it. Please read this notice carefully before deciding what you wish to do. 1. Right to a Deportation Hearing You have the right to a deportation hearing to determine whether you may remain in the United States. If you request a deportation hearing, you may be represented at the hearing by counsel at no expense to the government of the United States. To insure your presence at your hearing you may be detained unless you are able to post a sum of money which you will lose if you do not appear. If you appear at all required hearings and other requests for appearance, your money will be returned. 2. Opportunity for Voluntary Departure If you want to return to your home country, you may ask to be allowed to depart on the first available transportation. If your request is granted you will give up your opportunity for a deportation hearing and your opportunity to apply for other relief. If you change your mind at any time before you actually go home you will be given a deportation hearing. 3. Representation by Counsel You may be represented by counsel of your choice at no expense to the Government of the United States. If you wish legal advice and cannot afford it, you may ask for a list of available free legal services. You may contact counsel at this time or at any time prior to your departure from the United States. 4. Communication with Consul You may talk to the consular or diplomatic officers of your country or nationality. Request for Disposition I acknowledge that I have received a copy of the above notice and understand it. I understand my options and I request one of the following dispositions of my case. I understand that if the Government pays for my transportation out of the United States, I cannot return for five years unless I first obtain permission from the Attorney General. 1. I wish to request a hearing before an Immigration Judge to determine whether I may remain in, or will be deported from the United States. Date and Time: Signature Witness 2. admit that I am in the United States Illegally. I wish to give up my right to a hearing before an an Immigration Judge and return to my home country on the first availabe transportation. understand that I may be held in detention until my departure. Date and Time: Signature Witness Form read to alien by officer. Form read by alien. Remove at expense of: Government - Cost $ Request for voluntary departure approved: Alien Cost $ Signature and Title Date Form 1-274 (06/27/84)Y"
}