{
  "anumber": "A28754751",
  "id": "A28754751_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0000/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE-IMMIGRATION BOND C  A L C S T E D, Form -139 ( (Rev. 2-14-75)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1989,
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 UNITED STATES DEPARTMENT OF JUSTICE IMMIGRATION AND NATURALIZATION SERVICE File Number A 28 754 751 Date NOTICE-MMIGRATION BOND CANCELLED APR 10 1989 SUBJECT: C IMMIGRATION BONC ! FOIA (b)(6) Receipt Number LOS 27-105 Date September 4, 1987 G Amount $2,000.00 Alien's Name O DE LEON-TORRES, PRUDENCIO The conditions of the above=described immigration bond have been fulfilled as to the above-carred alien and you are 20 longer liable under succ bond for this allen. The nature of the security accepted on the board is checked below. If the security was in the form of U.S. Bonds or Noces or cash please comply with the pertinent instructions for the return of the security. SURETY BOND. UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY. The United Scaces Bonds or Noces accepted on the above-described immigration boad, and 2 check for any undistributed incer- est paid thereon, will be made available for return 9 you when the office shown below is informed of your preference for its delivery. Accordingly, would you please check the appropriate items below, sign, and return this form. IT WILL NOT BE NEC- ESSARY FOR YOU TO APPEAR AT THIS OFFICE AT THIS TIME. YOU MAY MAIL THIS FORM TO THE BELOW ADDRESS I prefer to receive my securities at the office shows below on a regular business day between the hours of 9 1.5. and 4 p.m. I understand that these securities will not be available in that office until after ten iays from the date on which : mail this form. I understand also that it is necessary for me to surrencer my \"Receipt of Immigration Officer-United States Bonds or Notes. or Cash. Accepted as Security on immigration Bond\" (Form I-300 or Form [-305) before my securities may be released. It would be more convenient for = to receive my securities at the Immigration and Naturalization Service office located at: (Street Address) (City or Town State) (Zip Code) I prefer to receive cry securities by express (collect). and hereby authorize delivery in that manner. : understand that : is necessary for me to surrender BY \"Receipt of Immigration Officer-United States Bonds or Notes. or Cash. Accepted as Security on Immigration Boad\" (Form I-300 or Form I-305) before my securities may be released and accordingly this receipt is enclosed herewith. My address shown above is incorrect. The address to which the express company should deliver my securities is: (Street Address) (City or Town Stace) (Zip Cxts) Signature of Colligor Date UNITED STATES BONDS OR NOTES ACCEPTED AS SECURITY, REDEEMED. The United Scares Bonds or Notes accepted on the above-described immigration bond were redeemed as macurity, or upon cail, and converted to casa. Arrangement will be made for the return to you of the cash. pins any undiscributed interest paid thereon. when the office shown below receives your \"Receipt of Immigration Officer-United Scaces Boads or Notes, or Cash. Accepted as Security on Immigration 3ood\" (Form I-300 or Form 1-305). Accordingly, please mail (Certified or Registered Maii is suggested) the above-mentioned receipt or bring is to that office on 3 regular business day between the hours of 9:00A.M. and 4:00P.M. Your security will be returned by a check which will be mailed to you 15 soon 13 possible after your receipt arrives. This notice will serve 13 your temporary receipt pending delivery of your check. CASH ACCEPTED AS SECURITY. Arrangement will be made for the return to you of the 2754 accepted on the above-iescribed immigration boad. when the office she below receives your \"Receipt of Immigracion Officer-United Scaces Bonds or Notes, or Cash. Accepted as Security on Immigration 3ond\" (Form I-300 or Form [-305). Accordingiy, please mail (Certified or Registered Mail is suggested) the above-mentioned receipt or bring it to that office on 3 regular business day between the hours of 9:00AM. and 4:00P.M. Your security will be returned by 1 check which will be mailed to you 13 5000 as possible liter your receive arrives. Tais notice will serve 13 your temporary receipt pending delivery of your check DEMIGRATION AND NATURALIZATION SERVICE crinest E Gustafson Please see attached instructions Title District Director Form 1-39 C-14-7778 bjk"
}