{
  "anumber": "A28754751",
  "id": "A28754751_0019",
  "page_index": 19,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0019/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEportation Case Check Sheet,  Form 1-70"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1987
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 DEPORTATION CASE CHECK SHEET File: A- ATTORNEY OR ALIEN: REPRESENTATIVE: ADDRESS: ADDRESS: Com- ACTIONS TO BE COMPLETED Com- pleted Initials ACTIONS TO BE COMPLETED pleted Initials (Date) (Date) I-94 I-95 Stamped SEP 252(b) CASES Notice of Revocation M-125 Docket Control Tape I-99 and Penalty I-210 Voluntary Departure Notice Notice to Detain I-259 and Deport I-205 Warrant of Deportation ARRANGING TRANSPORTATION I-229 Warning of Six-month I-238 Notice to Limit - 242(e) - Transportation Line I-217 Information-Travel I-217A Document Application I-380 Record of Billable Expense I-141 Medical Certificate I-340 Demand for Surrender Under Bond I-294 Notice of Dep'n Destination and Penalty for Reentry I-166 Notice to Surrender for Deportation I-323 Breach Bond I-391 G-391 Cancellation Detail of Det. Off. I-241 T.D. Request Country Record of Person & Designated by Alien I-216 Property Transferred T.D. (C-N) Request Country of Nationality SEP 03 1987 I-164 Document Envelope Passport Noted - O.I. 247.10(g) DETAINED CASES CLOSING ACTIONS Notice of Detention I-286 or Release Conditions I-157 Notice of Deportation G-189 I-200 Warrant for Arrest of Alien G-174 Statistical Punch Card I-203 Order to Detain or Release Alien G-143 Lookout Notice Worksheet G-589 Property Receipt Disposition Notice - FBI G-590 Property Envelope Disposition Notice - RCMP I-43 Statement of Detained Alien Baggage & Personal Effects Deportation Expense Billed Notice re Detention and I-284 I-94 Stamped and Deportation Expenses I-95 Forwarded \"Closed\" Tape Placed on File I-247 Notice of Detainer File To Rec. Adm. Re I-151 (I=551) Stamped \"Statistics\" I-154 Closed Disposition Information furnished the following: SEP 04 1987 Alien (is)(is not) detained and is ready for deportation to at the expense of . Alien's condition is: Able (Name of SS Co. . Government) Mental CINS Physically Incap. - Date Deportation Officer Remarks: Form I-170 (Rev. 9-15-73)N United States Department of Justice, Immigration and Naturalization Service"
}