{
  "anumber": "A28754751",
  "id": "A28754751_0046",
  "page_index": 46,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0046/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "RESPECT FOR HUMAN RIGHTS, 517 EL SALVADOR"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 517 EL SALVADOR RESPECT FOR HUMAN RIGHTS Section 1 Respect for the Integrity of the Person, Including Freedom from: a. Political Killing The number of politically-motivated killings continues to decline from the levels of previous years. In 1983, according to reports in the San Salvador press, there was an average of 140 politically motivated deaths a month; in 1984 the average was 64; from January to November of 1985 it was 29 per month. One legacy of E1 Salvador's history of political killing is that criminal deaths are often disguised to appear politically motivated in order to avoid correct attribution. Often it is impossible to determine the real motive. While many unexplained deaths are undoubtedly politically motivated, others are the result of criminal or personal motivations. By some estimates, the FMLN-FDR was responsible for approximately 55 percent of the political killings from January through November. Figures for the 318 political deaths during this period, as taken from the local press and other sources, show 145 deaths (45.6 percent) by guerrillas and another 31 possibly by guerrillas, 12 possibly by the extreme right, three by the civil defense, nine by security forces/army, 77 by unknown assailants, and 41 civilians killed in action. During 1985, FMLN-affiliated terrorist groups stepped up individual and collective assassinations, especially in urban areas. For example, the Clara Elizabeth Ramirez Front (CERF), a dissident group of the FMLN, publicly claimed responsibility for four murders in the first two weeks of January. On February 28, guerrillas attacked the residence of the President of the Central Elections Council, killing two of his bodyguards, a street vendor, and a passerby. In March, the Popular Revolutionary Army (ERP) of the FMLN claimed responsibility for a rocket attack on National Police Headquarters in San Salvador which killed one civilian and wounded eight others. The CERF assassinated the Armed Forces press spokesman on March 7. On April 8, 20 residents of Santa Cruz Loma, La Paz department were killed by guerrillas. The victims included six members of one family, three of them children, who burned to death when the attackers doused their house with kerosene and set it afire. Thirteen unarmed members of the Civil Defense forces were assassinated during this raid. Leaflets left at the scene claimed responsibility for the massacre on behalf of the Popular Liberation Forces (FPL) of the FMLN. In May, the FMLN killed the Mayor of San Jorge San Miguel, while attempting to kidnap him. On May 16, the FMLN also assassinated the military judge handling the cases of those accused of subversion, sabotage, and attempting to overthrow the Government. On June 19, the Revolutionary Workers' Party of Central America (PRTC) of the FMLN opened fire on a crowded sidewalk restaurant in San Salvador, killing 13 and wounding 12. Among those killed were four unarmed U.S. Embassy Marine"
}