{
  "anumber": "A28754751",
  "id": "A28754751_0044",
  "page_index": 44,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0044/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Cuba",
        "El Salvador",
        "Nicaragua"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        1984,
        1982,
        1980,
        2023,
        1983
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 515 EL SALVADOR With the March 31, 1985 election of legislative deputies and of town mayors, the people of El Salvador completed the structure election of a Constitutional Assembly in 1982 and continued popularly elected government which was initiated with the with the writing of a new Constitution in 1983 and presidential elections in 1984. Nine political parties honest contested the March elections, which were pronounced open and The military safeguarded the electoral process and remained by international observers who witnessed the voting. neutral throughout the campaign. For six years E1 Salvador has faced 4 Communist-backed insurgency from which has ties to, and obtains material support Cuba and the Soviet Union through Nicaragua. In addition it suffers from a weak economy, a history of violence, and weakness in public administration and in the administration of the insurgent forces were held in late 1984 to sook justice. Two rounds of discussions between the Government and negotiated solution to the conflict, but the guerrillas' a letter intransigence prevented a third round in 1985 In a pastoral called for a negotiated resolution of the war and stressed the issued by El Salvador's bishops on August 8, the Church legitimacy which the Government had gained through the electoral the process. Despite the country's ongoing conflict and unions state of emergency, political and economic life continue, others organize and strike, demonstrations by students and and opposed to policies of the Government are unhindered, published and broadcast over radio and television. views critical of the Government are openly and freely E1 Salvador's economy is mixed. Banking and marketing of major crops are nationalized and the price of food grains is There are few regulations on other economic activities, and subsidized. The land reform program begun in 1980 continues. the individuals are free to open and conduct business both within value country and in trade with other nations. The declining the of the national currency against the dollar has raised price of imports and contributed to inflation, an by the guerrilla forces additional burden on an economy strained by war and sabotage Marti Some five to seven thousand armed guerrillas of the Parabundo overthrow the elected Government by force of time. The National Liberation Front (FMLN) are accompting to querrillds, having suffered reverses on the battlefield, sabotage, and traffic stoppages, use of land mines, accassination, increasingly resorted to terrorist tactics, including economic have kidnaping were the seizures of 27 elected mayors and President kidnapping. The most spectacular cases of guerrilla Duarte's daughter. Respect for human rights' by the Government of E1 Salvador during nation's 1985 continued to be strongly influenced by the order able civil conflict. The establishment of & stable public disrupted, by military operations of both guerrilla and to protect individual rights continues to be Government forces, acts of revenge, fear, and is prevailing"
}