{
  "anumber": "A28754751",
  "id": "A28754751_0058",
  "page_index": 58,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A28754751_0058/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "EL SALVADOR, 529"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "El Salvador"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/5/2023 529 EL SALVADOR municipalities, representing less than six percent of the electorate, were held in neighboring towns. In El Salvador voting is no longer obligatory. The Government invited representatives of more than 50 nations and international organizations to observe the March 31 elections. Almost universally, the 130 international observers declared the elections to be open, honest, and a valid demonstration of the popular will. A pastoral letter issued by the Salvadoran bishops on August 8 described the Government as \"a constitutional government, the fruit of a democratic process, sanctioned by the massive turnout at the polls in four successive elections. Section 4 Governmental Attitude Regarding International and Nongovernmental Investigation of Alleged Violations of Human Rights: The Government maintains an open door policy toward human rights delegations. Key members of the Government, including high-ranking members of the military, have demonstrated their willingness to brief human rights groups and to be interviewed by them. Among those groups which have sent delegations to E1 Salvador are: American Watch, the Faculty for Human Rights in E1 Salvador - Contral America (FHRES), the Lawyers' Committee for Human Rights, U.S. congressional delegations, and various church and labor groups. Physicians from \"Medical Aid for E1 Salvador\" were given access to guerrilla leader Maria Valladares de Lemus (Nidia Diaz), to evaluate her condition and performed an operation on her injured arm. In March, Americas Watch assigned a representative to E1 Salvador who does not permanently reside in the country but does make extended visits. The Government has welcomed the frequent visits of the representatives of the ICRC and human rights groups to prisoners at brigade headquarters and penal institutions. The U.N. General Assembly's Special Rapporteur on Human Rights in E1 Salvador made his fifth annual visit to the country in September and received from each ministry and autonomous agency of the Governent a report on human rights within its area of responsibility. During his visit, the rapporteur interviewed government officials, visited prisoners hold by the Government on charges of subversion, and spoke with representatives of official and nonofficial human rights organizations. In his report to the U.N. General Assembly on November 5, 1985, the rapporteur noted that, \"As in previous years the cooperation by the Government of E1 Salvador was and full and open.\" There are several domestic human rights organizations which are active in E1 Salvador, The official Human Rights Commission (CDH) in un autonomous government agency which investigates complaints of human rights abuse. Tutela Legal is the legal assistance office of the Archdiocese. Other organizations which report on violence include Christian Legal Aid (Socorro Juridico Cristiano), and the non-official Human Rights Commission of El Salvador (CDHES)."
}