{
  "anumber": "A29372667",
  "id": "A29372667_0016",
  "page_index": 16,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372667_0016/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOTICE TO PERSONS FOR SPOUSES FILING MARRIED LESS THAN TWO YEARS, I-751, Joint Petition to Remove Conditional Basis of Alien’s Permanent Resident Status"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 NOTICE TO PERSONS FILING FOR SPOUSES IF MARRIED LESS THAN TWO YEARS Pursuant to section 216 of the Immigration and Nationality Act, your alien spouse may be granted conditional permanent resident status in the United States as of the date he or she is admitted or adjusted to conditional status by an officer of the Immigration and Naturalization Service. Both you and your conditional permanent resident spouse are required to file a petition, Form I-751, Joint Petition to Remove Conditional Basis of Alien's Permanent Resident Status, during the ninety day period immediately before the second anniversary of the date your alien spouse was granted conditional permanent residence. Otherwise, the rights, privileges, responsibilities and duties which apply to all other permanent residents apply equally to a conditional permanent resident. A conditional permanent resident is not limited to the right to apply for naturalization, to file petitions in behalf of qualifying relatives, or to reside permanently in the United States as an immigrant in accordance with the immigra- tion laws. Failure to file Form I-751, Joint Petition to Remove the Conditional Basis of Alien's Permanent Resident Status, will result in termination of permanent residence status and initiation of deportation proceedings. NOTE: You must complete Items 1 through 6 to assure that petition approval is recorded. Do not write in the section below item 6. CHECKLIST Have you answered each 1. Name of relative (Family name in CAPS) (First) (Middle) question? Have you signed the petition? 2. Other names used by relative (Including maiden name) Have you enclosed: 3. Country of relative's birth 4. Date of relative's birth (Month/Day/Year) The filing fee for each petition? Proof of your citizenship or lawful 5. Your name (Last name in CAPS) (First) (Middle) 6. Your phone number permanent residence? All required supporting documents for each petition? Action Stamp SECTION DATE PETITION FILED 201 (b)(spouse) If you are filing for your husband 201 (b)(child) or wife have you included: 201 (b)(parent) 203 (a)(1) Your picture? STATESIDE 203 (a)(2) CRITERIA GRANTED His or her picture? 203 (a)(4) Your G-325A? 203 (a)(5) SENT TO CONSUL AT: His or her G-325A? Relative Petition Card Form I-130A (Rev. 02-28-87) N"
}