{
  "anumber": "A29372667",
  "id": "A29372667_0002",
  "page_index": 2,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372667_0002/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Permanent Residence, 1115-0053"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1907,
        1990,
        2023,
        1982
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "A2/212667 Screened by NARA /31/2023 nA# U.S. Department of Justice Immigration and Naturalization Service (INS) Application for Permanent Residence OMB # 1115-0053 DO NOT WRITE IN THIS BLOCK Case ID# Action Stamp Fee Stamp MIA A# 29-312-667 60.00 FEE PAID No 90151A2,3. APPROVED Immigration & Naturalization Service G-28 or Volag# LILS DISTRICT DIRECTOR Miami, Florida Date 510-90 Verified By us Section of Law N9YU Eligibility Under Sec. 245 Sec. 209(b), INA Approved Visa Petition Sec. 214(d), INA Dependent of Principal Alien Sec. 13, Act of 9/11/57 Special Immigrant Sec. 245, INA MIA Other Sec. 249, INA Country Chargeable Preference A. Reason for this application I am applying for lawful permanent residence for the following reason: (check the box that applies) PER COMPUTER 1. An immigrant visa number is immediately available to me because NRX FCO A visa petition has already been approved for me (approval notice is attached) A visa petition is being filed with this application JUN 15 1990 2. I entered as the flance(e) of a U.S. citizen and married within 90 days (approval notice and marriage certificate are 3. Tam an asylee eligible for adjustment 4. Other: My son, Aldo MARRA, is a citizen of the U.S.A. mached) RE kood B. Information about you 1. Name (Family name in CAPS) (First) (Middle) 11. On what date did you last enter the U.S.? MARRA Elvira N/A 8-9-1982 2. Address (Number and Street) (Apartment Number) 12. Where did you last enter the U.S.? (City and State) 1941 Washington St. I Miami , Florida (Town or City) (State/Country) (ZIP/Postal Code) 13. What means of travel did you use? (Plane, car, etc.) Hollywood , Florida, 33020 Plane 3. Place of Birth (Town or City) (State/Country) 14. Were you inspected by a U.S. immigration officer? Cap Haitien, HATTL.(W.I.) Yes No 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) 15. In what status did you last enter the U.S.? Male Married Single (Visitor, student, exchange alien, crewman, temporary worker 10-16-1907 without inspection, etc.) Female Widowed Divorced Visitor (multiple entry visa) 7. Social Security Number 8. Alien Registration Number (if any) 16. Give your name EXACTLY as it appears on your Arrival/Departure N/A N/AA 29-372-667 Record (Form I-94). 9. Country of Citizenship Elvira MARRA ITALY 17. Arrival/Departure Record (I-94) Number 18. Visa Number 10. Have you ever applied for permanent resident status in the U.S.? N/A Yes No 002289 (If Yes, give the date and place of filing and final disposition) 19. At what Consulate was your nonimmigrant visa issued? Date Port all - -Prince HAiTI - (Mo/Day/Yr) 9-24-81 20. Have you ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) Alfonso MARRA (deceased) ITALY My husband died on 2-9-90 21. Has your husband/wife ever been married before? Yes No If Yes, (Names of prior husbands/wives) (Country of citizenship) (Date marriage ended) INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned JUL 09 1990 FORM I-485 (REV. 2-27-87)N 122190 PAW"
}