{
  "anumber": "A29372667",
  "id": "A29372667_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A29372667_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 7/31/2023, NARA Form Number: 850-046"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1903,
        1945,
        1938,
        2023,
        1931,
        1933
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 7/31/2023 22. List your present husband/wife, all of your sons and daughters, all of your brothers and sisters (If you have none write \"N/A\") Name Relationship Place of Birth Country of Date of Birth Applying Residence With You? Alfonso MARRA Husband ITALY 4 - 23 - 1903 HATTI Yes No (deceased) Yes No Josephine MANGIUST Daughter HAITI 5-2-1931 ITALY Yes No Gabriel MARRA Son HATTI 4/28-1938 U.S.A Yes No Aldo MARRA Son HATTI 6-15-1945 U.S.A Yes No Yes No Yes No Yes No Yes No Yes No 23. List your present and past membership in or affiliation with every organization, association, fund, foundation, party, club, society or similar group in the United States or in any other country or place, and your foreign military service (If this does not apply, write \"N/A\") A N/A 19 to 19 B. 19 to 19 C. 19 to 19 D 19 to 19 E. 19 to 19 F. 19 to 19 G. 19 to 19 24. Have you ever, in or outside the United States: a) knowingly committed any crime for which you have not been arrested? Yes No b) been arrested, cited. charged. indicted. convicted, fined, or imprisoned for breaking or violating any law or ordinance, including traffic regulations? Yes No c) been the beneficiary of a pardon, amnesty, rehabilitation decree. other act of clemency or similar action? Yes No If you answered Yes to (a). (b), or (c) give the following information about .each incident: Date Place (City) (State/Country) Nature of offense Outcome of case if any 1) 2) 3) 4) 5) 25. Have you ever received public assistance from any source, including the U.S. Government or any state, county, city or municipality? Yes No (If Yes, explain including the name(s) and Social Security number(s) you used.) 26. Do any of the following relate to you? (Answer Yes or No to each) A Have you been treated for a mental disorder, drug addiction or alcoholism? Yes No B. Have you engaged in, or do you intend to engage in, any commercialized sexual activity? Yes No C. Are you or have you at any time been an anarchist, or a member of or affiliated with any Communist or other totalitarian party. including any subdivision or affiliate? Yes No D. Have you advocated or taught, by personal utterance, by written or printed matter. or through affiliation with an organization: 1) opposition to organized government Yes No 2) the overthrow of government by force or violence Yes No 3) the assaulting or killing of government officials because of their officialio haracte Yes No 4) the unlawful destruction of property Yes No 5) sabotage Yes No 6) the doctrines of world communism, or the establishmen of a totalitarian dictatorship in the United States? Yes No E. Have you engaged or do you intend to engage in prejudicial activities or unlawful activities of a subversive nature? Yes No F. During the period beginning March 23. 1933, and ending May 8. 1945, did you order. incite, assist. or otherwise participate in persecuting any person because of race, religion, national origin, or political opinion under the direction.of or in association with any of the following 1) the Nazi government in Germany Yes No 2) any government in any area occupied by the military forces of the Nazi government in Germany LEE BAD Yes No 3) any government established with the assistance or cooperation of the Nazi government of Germany Yes No 4) any government that was an ally of the Nazi government of Germany Yes No G. Have you been convicted of a violation of any law or regulation relating to narcotic drugs or marijuana, or have you been an illicit trafficker in narcotic drugs or marijuana? Yes No"
}