{
  "anumber": "A34190657",
  "id": "A34190657_0109",
  "page_index": 109,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0109/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "DEPARTMENT OF STATE MEDICAL EXAMINATION OF VISA APPLICANTS, NARA-398"
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1966
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 PLACE DEPARTMENT OF STAT FOREIGN SERVICE OF THE UNITED STATES OF AMERICA Country Hospital MEDICAL EXAMINATION OF VISA APPLICANTS DATE OF EXAMINATION Mar. 13, 1973 CITY COUNTRY At the request of the American Consul at Taipei Taiwan, Republic of China NAME AGE SEX I certify that on the above date I examined Chiang Shu-Tung 62 M I examined specifically for evidence of any of the following conditions: CLASS A: DANGEROUS CONTAGIOUS DISEASES: Actinomycosis Granuloma Inguinale Ringworm of scalp Amebiasis Keratoconjunctivitis, infectious Schistosomiasis Blastomycosis Leishmaniasis Syphilis, infectious stage Chancroid Leprosy (Hansen's Disease) Trachoma Favus Lymphogranuloma Venereum Trypanosomiasis Filariasis Mycetoma Tuberculosis (pulmonary or extrapulmonary) Gonorrhea Paragonimiasis Yaws MENTAL CONDITIONS: Mental retardation Previous occurrence of one or more Mental defect (mental deficiency) attacks of insanity Narcotic drug addiction Insanity Psychopathic personality Chronic alcoholism Sexual deviation (See proviso, sec. 34.7, USPHS Regs.) CLASS B: Physical Defect, Disease, or Disability Serious in Degree or Permanent in Nature Amounting to a Substantial Departure from Normal Physical Well-Being. CLASS C: Minor Conditions. (CHECK NUMBER (1) BELOW OR COMPLETE NUMBER (2)) My examination, including the X-ray and other reports below, revealed: (1) No defect, disease, or disability. (2) Defect, disease, or disability, or previous occurrence of one or more attacks of insanity, as follows (give class - A, B, or C - diagnosis, and pertinent details*): Class B - Pulmonary T.B. bilateral upper 1/3 minimal, inactive. History denied. Opinion of chest specialist pulmonary condition unchanged between 1966 and 1973. Sputum and PPD not done. X-ray stability demonstrated by a films dated Dec. 19, 1966 and Mar. 13, 1973. # 2164 Chest film with pA.view. Chest X-ray report Impression: Fibrocalcified lesions minimal in both apices. Heart and diaphragm are normal. from Dr. K. C. Chao, M.D. VDRL: Non-reactive Blood serological report from Dr. K. K. Tien, M.D. Other special report(s) (when needed) from Dr. UHK SIGNATURE OF MEDICAL TECHNICAL ADVISOR TITLE DATE OF FINAL REPORT Sr. Medical Consultant Mar. 19, 1973 For Continue on reverse side if necessary. -S-398 10-t"
}