{
  "anumber": "A34190657",
  "id": "A34190657_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Title: NARA Screening Form, Date: 9/25/2023, Form Number: N-4-000-00000-N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1970,
        1989,
        1981,
        1945,
        1986,
        2023,
        1951,
        1967,
        1933
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 29. The law provides that you may not be regarded as qualified for a) knowingly committed any crime for which you have not been arrested? naturalization, if you knowingly committed certain offenses or crimes, Yes No even though you may not have been arrested. Have you ever, in or outside the United States: b) been arrested, cited, charged, indicted, convicted, fined or imprisoned for breaking or violating any law or ordinance, including traffic (If you answer \"Yes\" to a) or b), give the following information as to regulations? each incident.) Yes No Where (City, State and Country) Date of Offense Nature of Offense Outcome of case, if any None None None None ARRESTS 10 EXP UNDEMENTS TRAFFIC VIOLATIONS DEPORTATION 30. List your present and past membership in or affliliation with every association, fund, foundation, party, club, society or similar group in the United States or in any other place, and your foreign military service (If none, write \"None\".) Name of organization Location of organization Membership from Membership to ISLAM Temple, A.A.O.N.M.S. San Francisco Oct., 1975 Present AARP - American Association of Retired Persons Washington, D.C. Jan., 1986 Present Amity Lodge - Life member Taipei, Taiwan Aug., 1970 Present National Federation of CPA Associations of the Republic of China Taipei, Taiwan Dec., 1951 4/1/89 Taiwan Provincial Association of CPAs Taipei, Taiwan Dec., 1951 4/1/89 Taipei City Association of CPAs Taipei, Taiwan Aug., 1967 4/1/89 American Chamber of Commerce Taipei, Taiwan Jan., 1981 12/31/87 31. Are you now, or have you ever, in the United States or in any other 35. During the period of March 23, 1933 to May 8, 1945, did you ever place, been a member of, or in any other way connected or associated order, incite, assist, or otherwise participate in the persecution of any with the Communist Party? (If \"Yes\", attach full explanation) person because of race, religion, national origin, or political opinion? Yes No Yes No 32. Have you ever knowingly aided or supported the Communist Party 36. Were you born with, or have you acquired in some way, any title or directly, or indirectly through another organization, group or person? order of nobility in any foreign state? (If \"Yes\", attach full explanation) Yes No Yes No 37. Have you ever been declared legally incompetent or have you ever 33. Do you now or have you ever advocated, taught, believed in or been confined as a patient in a mental institution? knowingly supported or furthered the interests of Communism? (If Yes No \"Yes\", attach full explanation) 38. Are deportation proceedings pending against you, or have you ever Yes No been deported or ordered deported, or have you ever applied for 34. During the period March 23, 1933 to May 8, 1945, did you serve in, or suspension of deportation? were you in any way affiliated with, either directly or indirectly, any Yes No military unit, paramilitary unit, police unit, self-defense unit, vigilante unit, 39. When was your last federal income tax return filed? citizen unit, unit of the Nazi Party or SS, government agency or office, (year) 1989 extermination camp, concentration camp, prisoner of war camp, prison, labor camp, detention camp or transit camp, under the control or 40. Since becoming a permanent resident of the United States, have you affiliated with: filed an income tax return as a nonresident? (If \"Yes\", explain fully). a) the Nazi Government of Germany? Yes No Yes No 41. Since becoming a permanent resident of the United States, have you b) any government in any area occupied by, allied with, or established with failed to file an income tax return because you regarded yourself as a the assistance or cooperation of, the Nazi Government of Germany? nonresident? (If \"Yes\", explain fully). Yes No Yes No Form N-400 (10/26/89) N Page 3"
}