{
  "anumber": "A34190657",
  "id": "A34190657_0073",
  "page_index": 73,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0073/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Screeneded by NARA, 9/25/2023, Form I-1331"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "immigrant or after having adjusted status to that of an immigrant, and who is considering the filing of a nonresident alien tax return or the non-filing of a tax return on the ground that he is a nonresident alien, should consider carefully the consequences under the immigration and naturalization laws if he does so. granding If an alien takes such action, he may be regarded as having abandoned his residence in the United States and as having lost his immigrant status under the immigration and naturalization laws. As a of consequence he may be ineligible for a visa or other document for which lawful permanent resi- the dent aliens are eligible; he may be inadmissible to who authorized to perform the the United States if he seeks admission as a return- ministerial or of a religious 66 ing resident; and he may become ineligible for nomination within naturalization on the basis of his original entry or the United and those adjustment as an immigrant. EXTENSIONS: The validity of a permit may, on having good cause shown, be extended for a period or organization United States as periods not exceeding one year from the original or sister expiration date. should be applied for on Form N-470 Application for extension must be made prior Preserve Residence for to the expiration date shown on this permit. The under section 316 (b) of 317 application should be submitted not more than 90 Nationality at of the days prior to the expiration date. It must, however, Immigration Naturalization be submitted so as to be received by the officer Alians absent in collection for authorized to act thereon prior to the expiration of the purpose performing the empriestly the permit's validity. function of Araligious denomication bona The application must be made on Form I-131, fide ganization in the United States who DFD Application for Extension of Permit to Reenter the such a dencmination or United States, and must be accompanied by the national mission organization field permit and by the fee specified in the instructions the United on Form I-131. nun, or sister. make The application may be obtained from the issu- such application Such silens may the ing office shown on Page 2 or from the office of one of uninterrupted physical the Immigration and Naturalization Service having after the jurisdiction over the place in which the applicant is EFFECT Or CLAIM TO STA temporarily sojourning abroad. It may also be ob- rus FOR FEDERAL INCOME TAX PURPOSES An lained at some United States consular offices. who her actually established in the If validity of the permit or extension thereof United States after having been admitted as an has expired, the alien must obtain an immigrant visa from an American Consul before embarking for the United States. BUREAU or ENGRAVING AND PRINTING."
}