{
  "anumber": "A34190657",
  "id": "A34190657_0090",
  "page_index": 90,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0090/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application to Preserve Residence for Naturalization Purposes, Form N-470"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 is a member by treaty or statute and by which the for must made prior alien was not employed until after being lawfully date shown on this permit The admitted for permanent residence. In order to should be submitted 30 qualify for such approval the applicant must have date been physically present and residing in the United States, after being lawfully admitted for permanent must be residence, for an uninterrupted period of at least for Extension of Person to the one year. The granting of such approval does not disease States, and must be by the exempt the applicant from the requirement that and by the fee specified he be physically present in the United States for I 143 at least one-half of the period of residence re- application may be obtained quired for naturalization except in the case of shown on Page 2 or from the other of those persons who are employed by, or under contract with, the Government of the United States; immigration and Naturalization Serviço having those persons who are authorized to perform the constion over the place in which the applicant 19 ministerial or priestly functions of a religious de- sojourning abroad is may also be 00 nomination having a bona fide organization within at some United States consular alfities the United States, and those persons who are en- validity of the permil or extension gaged solely by a religious denomination or by an expired, the alien must obtain in interdenominational mission organization having a from an American Consul before bona fide organization within the United States as United States a missionary, brother, nun, or sister. Such approval should be applied for on Form N-470, \"Application to Preserve Residence for Naturalization Purposes (under section 316 (b) or 317, Immigration and Nationality Act)\" available at any office of the Immigration and Naturalization Service. Aliens who are absent in connection with or for the purpose of performing the ministerial or priestly functions of a religious denomination having a bona fide organization in the United States, or who are engaged by such a denomination or an interdenomi- national mission organization having a bona fide organization within the United States, as a mission- ary, brother, nun, or sister, are also eligible to make such application. Such aliens may acquire the re- quired one year of uninterrupted physical presence after the absence. EXTENSIONS: The validity of a permit may, on good cause shown, be extended for a period or periods not exceeding one year from the original expiration date. 16"
}