{
  "anumber": "A34190657",
  "id": "A34190657_0021",
  "page_index": 21,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0021/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1911,
        1974,
        1973,
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/25/2023 93-0024 155 UNITED STATES DEPARTMENT OF JUSTICE Immigration and Naturalization Service Los Form approved. OMB No 43-R0052. U. S. $10.00 ECFEESTAMP APPLICATION-FOR ISSUANCE OR EXTENSION American Embassy Talper OF PERMIT.TO REENTER THE UNITED STATES as provided in section 223 of the AUG 271975 Immigration and Nationality Act Wesley H. Parabas Use typewriter or print in block letters with ball-point pen. American Consuer issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Registration Receipt CHIANG SHU TUNG Card with this application if you checked Issuance'' above. C/O IN CARE OF David H. T. Chiang If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt. No.) MAILING 2739 Tennyson Street ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) (State) (ZIP Code) Thousand Oaks, California 91360 A- 34-190-657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF SAIMEDNATIONALITY COLOR OF EYES COLOR OF HAIR Aug. 17, 1911 China China Black Black HEIGHT 5 FEET 5 INCHES VISIBLE MARKS AND SCARS 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS CHIANG Shu-Tung GRANTED ADJUSTMENT WAS GRANTED Honolulu March 30, 1973 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) Trans world airlines, Inc. (TWA) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME L. J. Chiang (deceased) C. Y. Ku (deceased) 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months anada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHIANG Shu-Tung Los Angeles April 4, 1975 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. Taiwan May 13, 1974 - Los Angeles 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) June 10, 1974 Honolulu IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE Oct. 21, 1975 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: NAME and ADDRESS OF EMPLOYER Certified public accountant (C.P.A.) S. T. CHIANG & CO., C.P.A.S SOCIAL SECURITY ACCOUNT NUMBER P. 0. BOX 1179 563-31-4696 Taipei Taiwan, R.O.C. 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) E8 Jen Ai Mansion, 37-85 Jen Ai Road, Section 4, Taipei 106, R.O.C. 11. COUNTRIES TO BE VISITED (List each country) Taiwan, Republic of China 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): I am a practising C.P.A. in Taiwan and the Taiwan correspondent of Touche Ross & Co. New York, U.S.A. I hope I may go back to the U.S to in the Pacific 21 Exhibition and Festival which has been officially endorsed by the U.S. govt's american Revolution Bicentennial Adm. in Century City, Los Angeles fro June 19 through September 19, 1976. RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM 1-131 (REV. 6-1-73) N OVER"
}