{
  "anumber": "A34190657",
  "id": "A34190657_0096",
  "page_index": 96,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0096/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (English) ( (2–68), Personal financial resources"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1942,
        1970,
        1972,
        1945,
        2023,
        1976,
        1930,
        1927
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 Form FS-510 (English) (2-68) Page 2 25. Personal financial resources (a) Cash (c) The (1(i)) Real estate (value) (b) Bank deposits (d) () Other (describe) 26. (** Ed Father's name and address (If deceased, so state giving year of death) Deceased; Chiang, L. N. 27. Mother's maiden name and address (If deceased, so state giving year of death) Deceased; Chiang nee Ku 28. Name and address of next of kin in home country(If neither parent is living) Mr. Lee, Wan 12-1, Lane 219, Chien Kuo South Road, Taipei, Taiwan 29. List all places of residence for 6 months or more since your sixteenth birthday Country Province City or town () Dates (From-To) Calling or occupation China Shangtung Tsingtao May 1927-April 1930 Student China Shanghai April 1930--April 1942 Student China Anhwei Tunki May 1942-August 1945 Central tNews Agency China Shanghai August 1945--Dec. 1949 Central News Agency. Free. China Taiwan Taipei Dec. 1949 to the Present Certified Public Accountant. 30. List all organizations you are or have been a member of or affiliated with since your sixteenth birthday (Include professional, vocational, social and political organizations) Name and address Dates (From-To) Type of membership and 1) Member of Taiwan Provincial office held, if any Association of C. Dec. 1949 to Now 2) Director of Sino-Australian Cultural & Economic Association. July 1970 to Now. 3) Member of Amity Lodge No. 1, Taipei July 1970 to Now. 4) Member of Islam Temple, San Francisco, Calif. USA Oct. 1970 to Now. 31. List all languages, including your own, that you can speak, read and write Language in Speak Read % Write Chinese (Mandarin) Excellent Excellent Excellent English good good good 32. Inclusive dates of previous residence in or visits to the United States (Give type of visa or status) (If never, so state) Yes, visit to the States in Sept. 1972. 33. Yes No Have you ever been treated in a hospital, institution or elsewhere for mental disorder, drug addiction or alcoholism? (If answer is Yes, explain) 34. Yes No Have you ever been arrested, convicted or confined in a prison, or have you ever been placed in a poorhouse or other charitable institution? (If answer is Yes, explain) 35. Yes No Have you ever been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency or similar action? (If answer is Yes, explain) 36. ₹ Yes No Have you ever applied for a visa to enter the United States? (If answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa and whether the visa was issued or refused) Nonimmigrant Sept. 1972 valid 6 Sept. 1976; at xber Taipei, Taiwan 37. & Yes To No Have you been refused admission to the United States during the last 12 months? (If answer is Yes, explain) 38. Yes No Have ever registered with a draft board under United States Selective laws? (If answer is Yes, explain) 39. Yes No Have ever applied for relief from and United States armed forces or departed from or remained outside the United States to avoid or evade military service? (If answer is Yes, explain) % Yes No Do you intend to enter the United States from Canada, Mexico or an island adjacent to the United States within two years after arrival in Canada, Mexico or such adjacent island? (If answer is Yes, give the name of the transportation company by which you entered or intend to enter Canada, Mexico or such island)"
}