{
  "anumber": "A34190657",
  "id": "A34190657_0028",
  "page_index": 28,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0028/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, OMB No 43-R0052"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNIT Spreened by NARAI 9/25/2023 OF JUSTICE Form approved Immigration and Naturalization Service OMB No 43-R0052 APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP OF PERMIT TO REENTER THE UNITED STATES (F03) as provided in section 223 of the Immigration and Nationality Act Tel 3363 Use typewriter or print in block letters with ball-point pen. issuance I hereby apply for (check one) of Permit to Reenter the United States (multiple) extension FAMILY NAME 1. YOUR NAME CHIANG SHU TUNG IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked \"Issuance\" above. If C/O IN CARE OF you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. MAILING (No. and Street) Apt No. ADDRESS 2739 TENNYSON STREET ALIEN REGISTRATION NUMBER IN U.S. THOUSAND OAKS (State) CA. 91360 A. 34 190 657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR 8/17/11 CHINA R. O. C. BLACK BLACK HEIGHT 5 FEET 3 INCHES VISIBLE MARKS AND SCARS None 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS CHIANG SHU TUNG GRANTED ADJUSTMENT WAS GRANTED ) HONOLULU 3/30/73 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) TWA FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME L S. CHIANG 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any entry after an ebsence of less than six months Canada or C.Y.Kug Chiang Mexico. NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHIANG SHU TUNG CLEA NAME OFVESSEL. AIRLINE OR OTHER MEANS OF CONVEYANCE CAE RED ANGELES D 10/30/76 Ohina Airlines 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD LOS ANGELES 12/12/76 ME ONE YEAR NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL GIVENAME OF VESSEL CAB - China Airlines INITIALS FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States. in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. 8 LAWFUL ADMISSION VERIFIED I-151 IR5 11-8-24 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER INITIALS ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED HONOLULU IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE SURRENDERED ON ARRIVAL ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20. INCLUSIVE 9. PRESENT OCCUPATION: Certified Public Accountant NAME and ADDRESS OF EMPLOYER S. T CHIANG & CO., SOCIAL SECURITY ACCOUNT NUMBER Correspondent of Touche Ross & Co. 563 31 4696 37-84 Jen Ai Rd., Sec. 4, Taipei 106, Taiwan, R.O.C. 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District (Country) 37-85 JEN AI ROAD, SEC 4, TAIPEI 106 TAIWAN R.O.C. 11. COUNTRIES TO BE VISITED (List each country) R. 0. C -WEST CGERMANY-HOLLAND-FRANCE-ENGLAND-SWITZERLAND 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): WORKING IN TAIPEI, TAIWAN AND ATTEND. ING INTERNATIONAL CONGRESS OF ACCOUNTANTS IN MUNICH, WEST GERMANY. RECEIVED TRANS IN T'D-TRANS OUT COMPLETED FORM 1-131 (REV. 3-1-74) Y OVER NOV 9 1976"
}