{
  "anumber": "A34190657",
  "id": "A34190657_0078",
  "page_index": 78,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0078/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, CMB No. 43-R0052"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States",
        "Australia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1911,
        1974
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/25/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service CMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION $10.00 FEE STAMP OF PERMIT TO REENTER THE UNITED STATES Immigration as provided in section 223 of the APR Immigration and Nationality Act Date 899 Use typewriter or print in block letters with ball -point pen. issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Registration Receipt CHIANG SHU TUNG Card with this application if you checked \"Issuance\" above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- mit you wish to have extended. (No. and Street) (Apt. No.) MAILING 45-570 KENEKE STREET ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) KANEOHE HAWAII (State) 96744 (ZIP Code) A- 3 4 190 657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR AUG. 17, 1911 CHINA CHINA BLACK BLACK HEIGHT 5 FEET 5 INCHES VISIBLE MARKS AND SCARS NONE 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS CHIANG SHU-TUNG GRANTED ADJUSTMENT WAS GRANTED HONOLULU MAR. 30, 1973 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) TRANS-WORLD AIRLINES, INC. (TWA) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME DECEASED CHIANG, J. (L1-Jo) DECEASED. CHIANG nee KU, 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) CHING YUN NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHIANG SHU-TUNG HONOLULU APR. 2, 1974 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD LOS ANGELES APR 22, 1974 TWO YEARS NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL CHINA AIRLINES FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. AUSTRALIA TAIWAN HONOLULU LUMH 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED STATE EXPIRATION DATE ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: PUBLIC ACCOUNTANT NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER S.T. CHIANG of Co. TAIPEI, TAIWAN APPLIED FOR 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) P.O. Box 1179 TAIPEL TAIWAN ROC. 11. COUNTRIES TO BE VISITED (List each country) book Kenthos TAIWAN 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): To Do BUSINESS AS CORRESPONDENT OF TOUCHE ROSS of CERTIFIED PUBLIC ACCOUNTANTS: NEW YORK IN TAIPEI RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM I-131 (REV. 6-1-73) N OVER"
}