{
  "anumber": "A34190657",
  "id": "A34190657_0037",
  "page_index": 37,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0037/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Denmark",
        "Canada",
        "China",
        "United States",
        "Switzerland",
        "France",
        "Philippines",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1973,
        2023,
        1911,
        1979
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES DEP ARTMENT OF JUSTICE Screened by NARA. 9/25/2023 Form approved. Immigration and Naturalization Service OMB No 43-R0052. FEE STAMP APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES 02 MAR 1979 of as provided in section 223 of the Immigration and Nationality Act 123,187 Use typewriter or print in block letters with ball -point pen. issuance I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capitel Letters) FIRST MIDDLE 1. YOUR NAME CHIANG SHU TUNG IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- (No and Street),(Spt. No.) mit you wish to have extended. MAILING 2739 Tennyson Street ALIEN REGISTRATION NUMBER ADDRESS IN U.S. Thousand Oaks (State) California ZZP Code 91360 A- 34 190 657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR August 17, 1911 China China Dark brown Black HEIGHT 5 FEET 3 INCHES VISIBLE MARKS AND SCARS None 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS CHIANG SHU TUNG GRANTED ADJUSTMENT WAS GRANTED HONOLULU March 30, 1973 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH LISTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) TWA ADMISSION FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME L S CHIANG C.Y. Kuo 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada, or NAME UNDER WHICH ADMITTED PORT OF ARRIVE DATE OF CHIANG SHU TUNG POST AUDIT 49 Feb. 16, 1979 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE Nor thwest No. 022 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF propos DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD Los Angeles CLEARED ch 1979 Two years NAME OF TRANSPORTATION COMPANY DEPARTURE IS TO BE BY VESSEL GIVE NAME OF VESSEL Northwest Airlines North Azilines FILL IN ITEM 7, ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT INITIALS 7. List all countries visited since your last departure from the United States, in the order Visited DATE & PORT OF LAST DEPARTURE FROM U.S. Taipei - Hongkong - West Germany - Italy - 11/5/77 thru 2/16/79 France - Switzerland - England - Holland - Taipei 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED 7/21/77 Los Angeles IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE April 30, 1979 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: NAME and ADDRESS OF EMPLOYER Certified Public Accountant SOCIAL SECURITY ACCOUNT NUMBER CHIANG & LIN, CPAs, Taipei 563 31 4696 Correspondent of Touche Roass & Co., New York 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) 37-85 Jen Ai Road, Section 4, Taipei, Taiwan, R.O.C. 11. COUNTRIES TO BE VISITED (List each country) Taipei, ROC; Copenhagen, Denmark; Manila, Philippines. 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): Working in Taipei, Taiwan, ROC, and attending accounting conference S in Copenhagen and Manila in August and Cotobber this VS RECEIVED TRANS IN RET TRANS. OUT COMPLETED FORM I-131 (Rev. 4-1-76)N OVER"
}