{
  "anumber": "A34190657",
  "id": "A34190657_0033",
  "page_index": 33,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0033/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, 4m 4 0052"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "United States",
        "Switzerland",
        "France",
        "Italy"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1977,
        2023,
        1978,
        1976
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA 9/25/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP HOMO free OF PERMIT TO REENTER THE UNITED STATES Tulpal as provided in section 223 of the APR 21 1978 Immigration and Nationality Act W Use typewriter or print in block letters with ball -point pen. Edward Wilkinson handclean Consul issuance I hereby apply for (check one) of Permit to Beenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME CHIANG Shu Tung IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- (No. and Street) (Apt. No.) mit you wish to have extended. MAILING 2739 Tennyson Street ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) Thousand Oaks, Unlifornia 91300 A- 34 190 657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR HEIGHT FEET INCHES VISIBLE MARKS AND SCARS 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH AD JUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel. Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH. OF CONTENDED ABSENCE ABROAD 22 NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. Taiwan, Hongkong, Munich, Italy, France, Switzerland, Longon, Amsterdam, Hamburg. March 27, 1978 - L.A. 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT (City and State) IS ATTACHED July 21, 1977 Los Angeles, California IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE July 20, 1978 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: Certified Public Accountant NAME ADDRESS OF EMPLOYER & L'IN, Certified Public Accountants, SOCIAL SECURITY ACCOUNT NUMBER Correspondent of Touche Ross International, 563 31 4696 New York, N.Y. 10. MAILING ADDRESS ABROAD (Number and Street) (City/Town) (State/Province/District) (Country) 37-85, Jen Ai Road, Section 4, Taipei (106) Taiwan R. 0. C. 11. COUNTRIES TO BE VISITED (List each country) Taiwan, Hongkong, England. 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): Being appointed as a member of Ethics Committee of International Federation of Accounta mts, I shall travel to London to attend meetings in August 1978. G-360 SENT JUL 267978 RECEIVED TRANS IN RET'D TRANS. OUT FORM 1-131 (Rev. 4-1-76 N CD T/C JUL 27 1976 COMPLETED GOTOVERS"
}