{
  "anumber": "A34190657",
  "id": "A34190657_0089",
  "page_index": 89,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0089/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Visas, 042217440 15"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 Visas IMPORTANT INFORMATION GENERAL A permit to reenter has no effect under the immigration laws except to show that the per- son to whom issued is returning from a temporary visit abroad and relieve him of the necessity of securing a visa from an American Consul before returning to the United States. It does not relieve him from meeting the other requirements of the immigration laws. Persons who have been convicted of or admit having committed a felony or other crime or misdemeanor involving moral turpitude either before or after entering the United States, other criminal, immoral, insane, mentally or phys- ically defective aliens, those afflicted with loath- some or contagious diseases, and others found to be inadmissible under the immigration laws are subject to exclusion if attempting to reenier, not- withstanding they may be in possession of permits to reenter. EFFECT OF ABSENCE FROM UNITED STATES UPON NATURALIZATION ELIGIBILITY: A permit to reenter does not relieve the person to whom issued from meeting the requirements of the naturalization laws. Notwithstanding the possession of a reentry permit, absence from the United States by an applicant for naturalization for a continuous period of one year or more during the period for which continuous residence in the United States is required for ad- mission to citizenship will break the continuity of such residence, except where, prior thereto, the Attorney General has approved an absence in the employment of, or under contract with, the United States Government or an American institution of research recognized as such by the Attorney General, or in the employment of an American firm or corporation engaged in whole or part in the development of foreign trade and commerce of the United States or a subsidiary thereof, more than 50 percent of whose stock is owned by an American firm or corporation, or in the employment of a public international organization of which the United States 14 0421740 0421740 15"
}