{
  "anumber": "A34190657",
  "id": "A34190657_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 42. Have you ever claimed in writing, or in any other way, to be a United 50. Did you ever apply for exemption from military service because of States citizen? alienage, conscientious objections, or other reasons? (If \"Yes\", attach Yes No a full explanation) 43. Have you ever deserted from the military, air or naval forces of the Yes X No United States? 51. Did you ever register under United States Selective Service laws or Yes No draft laws? (If \"Yes\", complete the following) 44. Have you ever left the United States to avoid being drafted into the Yes X No Armed Forces of the United States? Date registered Yes No None 45. Do you believe in the Constitution and form of government of the United Selective Service Number States? None Yes No Local Board Number 46. Are you willing to take the full oath of allegiance to the United States? None (See instruction #5) Present classification Yes No None 47, If the law requires it, are you willing to bear arms on behalf of the 52. The law provides that you may not be regarded as qualified for United States? (If \"No\", attach a full explanation) naturalization, if, at any time during the period for which you are Yes No required to prove good moral character, you have been a habitual 48. If the law requires it, are you willing to perform noncombatant services drunkard; advocated or practiced polygamy; have been a prostitute or procured anyone for prostitution; have knowingly and for gain helped in the Armed Services of the United States? (If \"No\", attach a full any alien to enter the United States illegally; have been an illicit explanation) trafficker in narcotic drugs or marijuana; have received your income Yes No mostly from illegal gambling, or have given false testimony for the purpose of obtaining any benefits under this Act. Have you ever, 49. If the law requires it, are you willing to perform work of national anywhere, been such a person or committed any of these acts? (If importance under civilian direction? (If \"No\", attach a full explanation) you answer yes to any of these, attach full explanation.) Yes No Yes No This block is to be completed by the person preparing form if other than the applicant. I declare that this document was prepared by me at the request of the applicant and is based on all information of which I have any knowledge. Signature Signature X Address Mailing Address of Applicant 3910 Via Verde Thousand Oaks, CA. 91360 Telephone Number Date Telephone Number Date (805) 529-7816 1/25/91 Do not fill in blanks below these lines; This application must be sworn to before an officer of the Immigration and Naturalization Service. AFFIDAVIT I do swear that I know the contents of this application, comprising pages 1 Subscribed and sworn to before me by applicant at the preliminary to 4, inclusive, and the supplemental forms thereto. investigation DE (Form Numbers ) subscribed to by me, that the same are true to the best of my knowledge and belief, that corrections numbered: to u At Los were made by me or at my request, and that this application was signed by me with my full, true and correct name, so help me God. This ARR day of 05 1991 19 I certify that before verification of the above applicant stated in my presence he or she had (heard) read the foregoing application, corrections Shu-Tung CHIANG therein and supplemental form(s) and understood the contents thereof. (Complete and true signature of applicant) (Demonstrate applicant's ability to write English) The Congress makes (Naturalization Examiner) Non Filed the laws in the u. S. (Date, reasons) Form N-400 (10/26/89) N Page 4"
}