{
  "anumber": "A34190657",
  "id": "A34190657_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0003/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Naturalization Application Form, N-4 (form number not fully visible)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1911
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 You must ALSO BRING with you what is noted below: The proceeding will take about two hours. If for any reason you cannot keep this appointment, return this If applying for NATURALIZATION AS THE SPOUSE of a United States Citizen; letter immediately with your explanation and a request Your marriage certificate. for a new appointment; otherwise, no further action will - Proof of death or divorce for each prior marriage of yourself or spouse. be taken on your application. Your spouse's birth or naturalization certificate or certificate of citizenship. If you are applying for citizenship for yourself, you will If applying for NATURALIZATION ON BEHALF OF YOUR CHILD (children); be tested on your knowledge of the government and The child (children) for whom you filed application for naturalization. history of the United States. You will also be tested Birth certificate(s) for the child (children). on reading, writing, and speaking English, unless you Adoption decree(s), and English translation(s) if in a foreign language. have been living in the United States for a total of at Your United States birth certificate or certificate of naturalization or citizenship. least 20 years as a lawful permanent resident and are - Your marriage certificate. over 50 years old, or unless your are physically unable to read, write, or speak English. If applying for NATURALIZATION as member of the United States ARMED FORCES; - Your discharge certificate, or form DD 214. Authority for collection of the personal data information requested on the Description form is contained in Sections If you are also applying for a CERTIFICATE of citizenship FOR your CHILD (children); 332 and 338 of the Immigration and Nationality Act (8 U.S.C. The child (children) between 14 and 18 years for whom you have applied, and for which 1442 and 1449). Submission of this information is voluntary. The principal purpose for requesting this information is to the fee has been paid. comply with the statutory requirements as to the contents of a certificate of naturalization. The information requested, as a matter of routine use, will be furnished to the clerk of PERSONAL DESCRIPTION FORM the naturalization court where your petition for naturalization (Type or Print) will be filed in order to place the information on a certificate M Married of naturalization in the event you are admitted to United Date of Birth August 17, 1911 Sex Marital Status States citizenship. As a routine use all or any part of the information may be disclosed to a court, and to other federal, state, local or foreign law enforcement or regulatory agencies, Black Grey Yellow Eye Color Complexion Color Department of Defense, including any component thereof, the Hair Color Selective Service System, the Department of State, the De- partment of the Treasury, the Department of Transportation, 5 5\" 110 lbs Central Intelligence Agency, Interpol and individuals and Height (Feet & Inches) Weight (Pounds) organizations in the processing of your application or peti- tion for naturalization or during the course of investigation to elicit further information required by the Immigration and None Visible Distinctive Marks Naturalization Service to carry out its function. Information requested which indicates a violation or potential violation of law, whether civil, criminal or regulatory in nature, may be Country of Nationality Republic of China referred, as a routine use, to the appropriate agency, whether federal, state, local or foreign, charged with the responsi- bility of investigating, enforcing or prosecuting such None violations. Failure to provide any or all of the requested (If change of name requested) Change to: information will prevent the issuance of a certificate of naturalization."
}