{
  "anumber": "A34190657",
  "id": "A34190657_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Notice of Preliminary Naturalization Hearing, N-430A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 OMB #1115-0064 U.S. Department of Justice Immigration and Naturalization Service Notice of Preliminary Naturalization Hearing Naturalization and Citizenship Branch 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 File or A # A34 190 657 Date 3/07/1991 EXAMINER ID: LOSMARTI You are hereby notified to appear for a hearing on your (your child's) application for naturalization at the DATE, TIME, AND PLACE, shown below. Date 4/05/1991 SHU CHIANG Time 9:45 AM 3910 VIA VERDE THOUSAND CAKS CA 91360 Place 300 NORTH LOS ANGELES STREET LOS ANGELES, CA 90012 FEDERAL BUILDING - DOWNTOWN BASEMENT. ROOM 8-119 You MUST BRING the following with you: - This letter, with the Personal Description Form on the REVERSE SIDE COMPLETELY FILLED INDBERT M. MOSCHORAK - Alien Registration Receipt Card. - Any evidence of Selective Service Registration. DISTRIST DIRECTOR - Any documents you have which you used in connection with any entries into the United States. - Those items noted on the reverse side of this letter which are applicable to you. - Filing Fee. NO CASH ACCEPTED. BRING 50100 MONEY ORDER OR CASHIERS CHECK. MAKE PAYABLE TO U. S DISTRICT COURT. BE PREPARED TO SPEND 4 TO 5 HOURS FOR COMPLETION Please KEEP this APPOINTMENT even if you do not have all the items noted above or those on the back. However, you MUST bring the Filing Fee. Form N-430A IMPORTANT - PLEASE SEE REVERSE"
}