{
  "anumber": "A34190657",
  "id": "A34190657_0097",
  "page_index": 97,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0097/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Form FS-510 ( (English) ( (268)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 Form FS-510 (English) (2-68) Page 3 41. United States governing the issuance of visas require each applicant to state whether or not he is a member of any class 01 viduals excluded from admission into the United States. The excludable classes are described below. You should read carefully the following paragraphs; your understanding of their content and the answers you give to the questions that follow will assist the consular officer to reach a decision on your eligibility to receive a visa. EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE INELIGIBLE TO RECEIVE AN IMMIGRANT VISA: (a) Aliens who are mentally retarded, insane, or who have suffered one or more attacks of insanity aliens afflicted with psycopathic personality, sexual deviation, a mental defect, narcotic drug addiction, chronic alcoholism, or any dangerous contagious disease; aliens who have a physical defect, disease or disability affecting their ability to earn a living aliens who are paupers, professional beggars, or vagrants; aliens convicted of a crime involving moral turpitude or who admit committing the essential elements of such a crime, or who have been sentenced to confinement for at least five years in the aggregate for conviction of two or more crimes; aliens who are polygamists, or who practice or advocate polygamy; aliens who are prostitutes, or who have engaged in, benefitted financially from, procured or imported persons for the purpose of prostitution, or who seek entry to the United States to engage in prostitution or other commercialized vice, or any immoral sexual act; aliens who seek entry to perform skilled or unskilled labor and who have not been certified by the Secretary of Labor; and aliens likely to become a public charge in the United States. Do any of the foregoing classes apply to you? Yes No (If answer is Yes. explain) (b) Aliens who seek re-entry within one year of their exclusion from the United States, or who have been arrested and deported from the United States, or removed at Government expense in lieu of deportation, or removed as an alien in distress or as an alien enemy; aliens who procure or attempt to procure a visa or other documentation by fraud or willful misrepresentation: aliens who are not eligible to acquire United States citizenship, or who have departed from or remained outside the United States to avoid United States military service in time of war or national emergency; aliens who have been convicted for violating or for conspiring to violate certain laws or regulations relating to narcotic drugs or mari- huana, or who are known or believed to be, or to have been, an illicit trafficker in narcotic drugs or marihuana; aliens seeking entry from foreign contiguous territory or adjacent islands within two years of their arrival therein on a non- signatory carrier; aliens who are unable to read and understand some language or dialect; aliens who, knowingly and for gain, have encouraged or assisted any other alien to enter, or attempt to enter, the United Stetes in violation of law; and aliens who are former exchange visitors who have not fulfilled the two-year foreign residence requirement. Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain) Aliens who are, or at any time have been, anarchists, or members of or affiliated with any Communist or other totalita- rian party, including any subdivision or affiliate thereof; aliens who advocate or teach, or who have advocated or taught, either by personal utterance, or by means of any written or printed matter, or through affiliation with an or- ganization, (1) opposition to organized government, (2) the overthrow of government by force and violence, (3) the assaulting or killing of government officials because of their official character, (4) the unlawful destruction of property, (5) sabotage, or (6) the doctrines of world communism; or the establishment of a totalitarian dictatorship in the United States; and aliens who seek to enter the United States to engage in prejudicial activities or unlawful activities of a subversive nature. Do any of the foregoing classes apply to you? Yes No (If answer is Yes. explain)"
}