{
  "anumber": "A34190657",
  "id": "A34190657_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Naturalization"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1946,
        1955,
        2023,
        1978,
        1961,
        1950,
        1939
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "U.S. Department of Justice Screened by NARA, 9/25/2023 Immigration and Naturalization Service PETITION FOR NATURALIZATION ORIGINAL (To be retained by Clerk of Court) Petition No. 00883844 A.R. No. A34 190 657 To the Honorable JUDGES, DISTRICT Court for the CENTRAL DIST. OF at LOS ANGELES, CA This petition for naturalization, hereby made and filed under section 316 Immigration and Nationality Act, respectfully shows: (1) My full, true, and correct name is SHU-TUNG CHIANG (Full. true name, without abbreviations) (2) My present place of residence is 3910 VIA VERDE THOUSAND OAKS (Apt. No.) (Number and Street) (City or Town) VENTURA CALIFORNIA 91360 (Country) (State) (ZIP Code) (3) I was born on 8/17/11 in CHINA MAINLAND (4) I request that my name be changed to NONE (5) I was lawfully admitted to the United States for permanent residence and have not abandoned such residence. (6) [If petition filed under Section 316(a).) have resided continuously in the United States for at least five years and continuously in the States in which this petition is made for at least six months. immediately preceding the date of this petition and after my lawlul admission for permanent reisdence. and I have been physically present in the United States for at least one-half of such five year period (7) [11 petition filed under Section 319(a).) I have resided continuously in the United States in marital union with my present spouse for at least three years immediately preceding the date of this petition. and after my lawful admission for permanent residence. during all of which period my said spouse has been a United States citizen. and have been physically present in the United States at least one-half of such three-year period. I have resided continuously in the States in which this petition is made at least six months immediately preceding the date of this petition (8) [II petition filed under Section 319(b).) My present spouse is a citizen of the United States. in the employment of the Government of the United States. or of an American institution of research recognized as such by the Attorney General or an American firm or corporation engaged in whole or in part in the development of foreign trade and commerce of the United States. or subsidiary thereof. or of a public international organization in which the United States participates by treaty or statute. or is authorized to perform the ministerial or priestly functions of a religious denomination having a bona fide organization within the United States. or is engaged solely as a missionary by a religious denomination or by an interdenominational mission organization have a bona fide organization within the United States. and such spouse is regularly stationed abroad in such employment I intend in good faith upon naturalization to live abroad with my spouse and to resume my residence within the United States immediately upon-termination of such employment abroad (9) [11 petition filed under Section 328 I have served honorably in the Armed Forces of the United States for a period or periods aggregating three years. I have never been separated from the Armed Forces of the United States under other than honorable conditions If not still in service. my service terminated within six months of the filing of my petition. (10) |If petition filed under Section 329.) While an alien or noncitizen national of the United States. I served honorably in an active-duty status in the military. air. or naval forces of the United States during either World War I or during a period beginning September 1. 1939. and ending December 31, 1946. or during a period beginning June 25. 1950. and ending July 1. 1955. or during a period beginning February 28. 1961 and ending October 15. 1978. or I was discharged after five years of service under the Act of June 30. 1950 (P.I. 597. Kist Congress). If separated from such service I was separated under honorable conditions. At the time of enlistment, reenlistment or induction I was in the United States. the Canal Zone. American Samoa. or Swains Island If not in any of these places. I was lawfully admitted to the United States for permanent residence subsequent to enlistment or induction I was never séparated from such service on account of alienage. 1 was not a conscientious objector who performed namilitary. air. or naval duty whatever or refused to wear the uniform. I have not previously been naturalized on the basis of the same period of service. (11) Lam not and have not been. within the meaning of the Immigration and Nationality Act. for a period of at least 10 years immediately preceding the date of this petition. a member of or affiliated with any organization proscribed by such Act. or any section. subsidiary, branch. affiliate or subdivision thereof. nor have I during such period believed in. advocated. engaged in. or performed any of the acts or activities prohibited by such Act. (12) Fam, and have been during all the periods required by law. a person of good moral character, attached to the principles of the Constitution of the United States and well disposed to the good order and happiness of the United States (13) It is my intention in good faith to become a citizen of the United States and take without qualification the oath of renunciation and allegiance prescribed by the Immigration and Nationality Act. and to reside permanently in the United States. I am willing. when required by law. to bear arms on behalf of the United States. to perform noncombatant service in the Armed Forces of the United States. and to perform work of national importance under civilian director [unless exempted therefrom). (14) I am able to read. write. and speak the English language [unless exempted therefrom]. and I have a knowledge and understanding of the fundamentals of the history. and of the principles and form of government of the United States. (15) Wherefore request I may be admitted a citizen of the United States of America. I swear [affirm] that I know the contents of this petition for naturalization subscribed by me. and that the same are true to the best of my knowledge and belief. and that this petition is signed by me with my full. true name. So help me God. (16) DOB: shu-Tung Chiang : (Full Name, Without Abbre iations) When Oath Administered by Clerk or Deputy Clerk of Court When Oath Administered by Designated Examiner Subscribed and sworn to (affirmed) before me by above-named Subscribed and sworn to (affirmed) before me by above-name petitioner in the respective forms of oath shown in said petition and petitioner in the respective forms of Gat shown in said petition and affidavit, and filed by said petitioner. in the office of the clerk of said affadivi at this court at LOS ANGELES, CA day of 19 APR 5 99 this 5TH day of APRIL 19 91 Designated Examiner. I HEREBY CERTIFY that the foregoing petition for naturalization LEONARD A BROSNAN was by petioner named herein filed in the office of the clerk of said Clerk. CLERK, U.S. DISTRICT COURT court at CENTRAL DISTRICT OF CALIF day of Deputy Clerk. 19 DEPUTY Clerk. [SEAL] Deputy Clerk. Form N-405 (Rev. 06/03/87) Y"
}