{
  "anumber": "A34190657",
  "id": "A34190657_0025",
  "page_index": 25,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0025/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES, Form No. 43-R0052"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        1999,
        2023,
        1911
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 UNITED STATES DEPARTMENT OF JUSTICE Form approved. Immigration and Naturalization Service OMB No 43-R0052. U. S. $5.00 tee received APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP American Institute in OF PERMIT TO REENTER THE UNITED STATES Taiwan, Taipei Office as provided in section 223 of the 539153 FEB 6 1980 Immigration and Nationality Act Use typewriter or print in block letters with ball -point pen. Robert B. Houston issuance I hereby apply for (check one) of Perine Reente the States Special Notary (Police 96-8) extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME CHIANG SHU TUNG IMPORTANT: You must submit your Alien Registration Receipt Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked Extension'' you must submit the reentry per- mit you wish to have extended. MAILING ADDRESS (City) (No. and Street) (Apt. No.) 2739 Tennyson (State) street (ZIP ALIEN REGISTRATION NUMBER IN U.S. THOUSAND OAKS California 91360 A- 34-190-657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day, Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR AUG 17, 1911 CHINA CHINA BLACK BLACK HEIGHT 5 FEET 30 INCHES VISIBLE MARKS AND SCARS NONE 3. DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOCATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE WHICH WHICH ADJUSTMENT OF STATUS GRANTED ADJUSTMENT WAS GRANTED FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME 69 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ARRIVAL IN U.S. (Exclude any re-entry after an absence of less than six mont in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD CLEARED NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO STVE NAME DAYSEEL an FILL IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States in the orde cardited DATE & PORT OF LAST DEPARTURE FROM U.S. 11/79-2/16/99 Taipei; 2/16/79-3/10/79 LAX, SFO Colorado spring, work. 3/10/79-7/30/79 Taipei 2/30/79-8/21/79 SFO, LAX, 8/23/19-9/1/79 Taipi Copenhagen HKG; 1/1/79 Los Angelest 3/40/99 Los angeles 8/21/79 has MANILA. 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT July 18, 1999, LOS (City and State) Los Angeles, California IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED. STATE REASON: IF PERMIT IS ATTACHED STATE EXPIRATION DATE March 14, 1980 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20. INCLUSIVE 9. PRESENT OCCUPATION: Certified Public Accountant NAME and ADDRESS OF EMPLOYER CHIANG & LIN, CERTIFIED SOCIAL SECURITY ACCOUNT NUMBER PUBLIC ACCOUNTANTS Taipei 563-31-4696 CORRESPONDENT OF TOUCHE Ross Co. NEW YORK 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) State/Province/District) (Country) 37-84 Jew Ai ROAD SECTION 4 TAIPEL TAIWAN R.O.C. 11. COUNTRIES TO BE VISITED (List each country) TAIPEI, ROC, HONE KONG; ITALY need and request for extension my Re-enter Permit for One year. 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete) BEING a member of Ethics Committee of International Federation of Accountants, I have to attend Ethics Committee meeting an Taipei on March 1980 & in August 1980. RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM 1.131 (Rev. 4-1-76)N OVER 2-6-80 FEB 111989"
}