{
  "anumber": "A34190657",
  "id": "A34190657_0043",
  "page_index": 43,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0043/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR ISSUANCE OR EXTENSION OF PERMIT TO REENTER THE UNITED STATES"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Taiwan",
        "Canada",
        "Mexico",
        "China",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1975,
        1911,
        1974,
        1973,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "UNITED STATES PARTMENT OF JUSTICE Screened by NARA 9/25/2023 Form approved. Immigration and Naturalization Service OMB No 43-R0052. APPLICATION FOR ISSUANCE OR EXTENSION FEE STAMP OF PERMIT TO REENTER THE UNITED STATES 11312 as provided in section 223 of the JAN CARRIER WAY Immigration and Nationality Act Use typewriter or print in block letters with ball -point pen. TAIPEK raiwan issuance Receipt# F 05 98461 I hereby apply for (check one) of Permit to Reenter the United States extension FAMILY NAME (Capital Letters) FIRST MIDDLE 1. YOUR NAME IMPORTANT: You must submit your Alien Registration Receipt CHIANG SHU TUNG Card with this application if you checked 'Issuance'' above. C/O IN CARE OF If you checked \"Extension\" you must submit the reentry per- (No. and Street) (Apt. No.) mit you wish to have extended. MAILING 45-570 KENEKE STREET ALIEN REGISTRATION NUMBER ADDRESS IN U.S. (City) (State) (ZIP Code) KANEOHE HAWAII 96744 A-34 190 657 FILL IN ITEMS 2 THROUGH 6 ONLY IF APPLICATION IS FOR ISSUANCE OF REENTRY PERMIT 2. DATE OF BIRTH(Month, Day. Year) COUNTRY OF BIRTH COUNTRY OF CLAIMED NATIONALITY COLOR OF EYES COLOR OF HAIR AUG. 17, 1911 CHINA CHINA BLACK BLACK HEIGHT 5 FEET 5 INCHES VISIBLE MARKS AND SCARS NONE 3. I DID DID NOT REGISTER FOR SELECTIVE SERVICE 4. FILL IN THE ITEMS IN THIS BLOCK AS TO first ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE OR ADJUSTMENT TO PERMANENT RESIDENT STATUS NAME UNDER WHICH ADMITTED OR ADJUSTED PORT OF ARRIVAL OR LOC ATION OF DATE OF ARRIVAL OR DATE AS OF IMMIGRATION OFFICE-WHICH WHICH ADJUSTMENT OF STATUS CHIANG SHU-TUNG GRANTED ADJUSTMENT WAS GRANTED HONOKULU MARCH 30, 1973 FILL IN REMAINING ITEMS IN THIS BLOCK ONLY IF YOU DID NOT ACQUIRE PERMANENT RESIDENCE THROUGH ADJUSTMENT. MANNER OF FIRST ARRIVAL IN UNITED STATES FOR PERMANENT RESIDENCE (Name of Vessel, Airline, etc.) TWA FATHER'S NAME AT TIME OF YOUR ARRIVAL MOTHER'S MAIDEN NAME DECEASED - CHIANG, L1-Jo DECEASED - CHIANG nee Ku CHING- 5. FILL IN THE ITEMS IN THIS BLOCK AS TO last ABRIVAL IN U.S. (Exclude any re-entry after a absence of less than six months in Canada or Mexico.) NAME UNDER WHICH ADMITTED PORT OF ARRIVAL DATE OF ARRIVAL CHIANG SHU - TUNG HONOLULU LOS ANGELES APR.2,1974 NAME OF VESSEL, AIRLINE OR OTHER MEANS OF CONVEYANCE: NWA 6. PORT OF proposed DEPARTURE FROM UNITED STATES DATE OF proposed DEPARTURE LENGTH OF INTENDED ABSENCE ABROAD NAME OF TRANSPORTATION COMPANY IF DEPARTURE IS TO BE BY VESSEL, GIVE NAME OF VESSEL FILE IN ITEM 7. ONLY IF APPLICATION IS FOR EXTENSION OF REENTRY PERMIT 7. List all countries visited since your last departure from the United States, in the order visited DATE & PORT OF LAST DEPARTURE FROM U.S. JAIWAN MAY 1974 Los ANGELES 8. FILL IN ITEM 8 ONLY IF YOU HAVE PREVIOUSLY OBTAINED A PERMIT TO REENTER ISSUANCE DATE OF LAST PERMIT LOCATION OF IMMIGRATION AND NATURALIZATION OFFICE ISSUING LAST PERMIT MY LAST PERMIT JUNE 10,1974- - HHW (City and State) HONOLULU IS ATTACHED IS NOT ATTACHED IF THE PERMIT IS NOT ATTACHED, STATE REASON: IF PERMIT IS ATTACHED. STATE EXPIRATION DATE APRIL 21, 1975 ALL APPLICANTS MUST FILL IN ITEMS 9 THROUGH 20, INCLUSIVE 9. PRESENT OCCUPATION: PUBLIC ACCOUNTANT NAME and ADDRESS OF EMPLOYER SOCIAL SECURITY ACCOUNT NUMBER S.T. CHIANG tco. 563-31-4696 37JEN AiRd., Sec 4, Taiper 10. MAILING ADDRESS ABROA D (Number and Street) (City/Town) State/Province/District) (Country) D-8 JEN Ai MANSION, 37 JEN Ai ROAD, SECTION 4, TAIPEL 106, Roc 11. COUNTRIES TO BE VISITED (List each country) TAIWAN, HONG KONG, u. S.A. 12. REASONS FOR GOING ABROAD OR SEEKING EXTENSION (Be concise and complete): BEING A CORRESPONDENT FOR TOUCHE Ross x co. C.P.A. NEW YORK, IN TAIWAN RECEIVED TRANS IN RET'D TRANS. OUT COMPLETED FORM I-131 (REV. 6-1-73) N OVER"
}