{
  "anumber": "A34190657",
  "id": "A34190657_0091",
  "page_index": 91,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A34190657_0091/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Application for Extension of Permit to Reenter the United States, and must be accompanied by the permit and by the fee specified in the instructions on Form I-143."
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 9/25/2023 is memosi by treatly or Statute and by which the Application for extension must be made prior alien was not employed until after being lawfully to the expiration date shown on this permit. The admitted for permanent residence In order to quality for such approval the applicant must have application should be submitted 30 to 90 days prior to the expiration date. been physically pretent and residing in the United States other have lawfully admited for purmanant The application must be made on Form I-143, residence for an uninterrupted period of at least Application for Extension of Permit to Reenter the one year. The granting of such approval don: not United States, and must be accompanied by the exempt the applicant from the requirement that permit and by the fee specified in the instructions be be physically oreson in the United States for on Form 1-143. at least one-half of the period of residence re- The application may be obtained from the issu- quired for naturalizarian except in the case of those persons who are employed by or under ing office shown on Page 2 or from the office of contract with the Government of the United States the Immigration and Naturalization Service having those persons who are authorized to perform the jurisdiction over the place in which the applicant is ministerial or priestly indicate of A religrous de. temporarily sojourning abroad. It may also be ob- nomination having a baria Highe organization within tained at some United States consular offices. the United States, and those persons who are on- If validity of the permit or extension thereof gaged solely by A religious denomination or by an has expired, the alien must obtain an immigrant interdenominational mission organization having a visa from an American Consul before embarking bona lide organization within the United States as for the United States. a missionary brother. nun. or sister Such approval should be applied for on Form N-470, Application to Preserve Residence for Naturalization Purposes (under section 316 (b) or 317, Immigration and Nationality Aci)\" available at any office of the Immigration and Naturalization Service Aliens who are absent in connection with or for the purpose of performing the ministerial or priefly functions of a religious denomination having 0 bonk fide organization in the United States, or who are engaged by such 8 denomination or an interdenomia national mission organization having a bona fide organization within the United States as a mission. ary brother num, or sister, are also eligible to make such application Such aliens may acquire the re- quired one year of uninterrupled physical presence after the absence EXTENSIONS The validity of a permit may, on good cause shown be extended for a period or periods not exceeding one year from the original expiration date. 16 BUREAU or ENGRAVING AND PRINTING"
}