{
  "anumber": "A44045795",
  "id": "A44045795_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44045795_0006/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "NOT APPLICABLE, FOIA (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1925,
        1993
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "16. PERSON(S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNITED STATES NOT APPLICABLE 17. NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) MISTRY LALBHAI DOB: UNKNOWN BIRTH PLACE = AMALSAD INDIA ADDRESS : EXPIRED 18. MAIDEN NAME OF MOTHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) MISTRY, RATNABEN DOB: UNKNOWN BIRTH PLACE AMALSAD INDIA. ADDRESS : EXPIRED. 19. IF NEITHER PARENT IS LIVING PROVIDE NAME AND ADDRESS OF NEXT OF KIN (nearest relative) IN YOUR HOME COUNTRY. FOIA (b)(6) 20. LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE LANGUAGE SPEAK READ WRITE GUJARATI YES NO No 21. LIST BELOW ALL PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEING WITH YOUR PRESENT RESIDENCE. CITY OR TOWN PROVINCE COUNTRY OCCUPATION DATES (FROM-TO) KHARA ABRAMA GUJARAT INDIA HOUSEHOLD 1925 TILL NOW 22. LIST ANY POLITICAL PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTAL ITARIAN OR NAZI ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY NAME AND ADDRESS FROM/TO TYPE OF MEMBERSHIP NOT APPLICABLE. 23. LIST DATES OF ALL PREVIOUS RESIDENCE IN OR VISITS TO THE UNITED STATES (If never, so state) GIVE TYPE OF VISA STATUS IF ANY. GIVE I.N.S. \"A\" NUMBER IF ANY. LOCATION FROM/TO VISA I.N.S. FILE NO. NOT APPLICABLE SIGNATURE OF APPLICANT DATE 10th MARCH 1993 NOT Return this completed form immediately to the consular office address on the covering letter. This form will become pa your immigrant visa and your visa application cannot be processed until this form is complete. *Public reporting burden for this collection of information is estimated to average 24 hours per response. Including time required for searching existing data sources, gathering the necessary data, providing the information required and reviewing the final collection. Se minents on the accuracy of this estimate of the burden and recommend for reducing it to: Department of State (OIS/RA/DR) Washington 0520-0264 and to the Office of information and Regulatory Affairs. Offic anagement and Budget. Paperwork Reduction Project (1405-0015). washington D.C. 20503."
}