{
  "anumber": "A44045795",
  "id": "A44045795_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44045795_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigration and Naturalization Service Alien Relative Form G-28, G-28 ID Number"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1992,
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 C. (continued) Information about your alien relative 16. List husband/wife and all children of your relative (if your relative is your husband/wife, list only his or her children). (Name) (Relationship) (Date of Birth) (Country of Birth) SHANTILAL MISTRY SON 12/14/28 INDIA CHHABILDAS MISTRY HUSBAND(EXPIRED) 06/16/03 INDIA 17. Address in the United States where your relative intends to live (Number and Street) (Town or City) (State) 105, GREGORY AVE, APT#3C PASSAIC NJ 07055 18. Your relative's address abroad (Number and Street) (Town or City) (Province) (Country) (Phone Number) SONIFALIA AT (POST: KHARA ABRAMA, GUJARAT INDIA - 19. If your relative's native alphabet is other than Roman letters, write his or her name and address abroad in the native alphabet: (Name) (Number and Street) (Town or City) (Province) (Country) 20. If filing for your husband/wite, give last address at which you both lived together: From To (Name) (Number and Street) (Town or City) (Province) (Country) (Month) (Year) (Month) (Year) 21. Check the appropriate box below and give the information required for the box you checked: Your relative will apply for a visa abroad at the American Consulate in BOMBAY INDIA. (City) (Country) Your relative is in the United States and will apply for adjustment of status to that of a lawful permanent resident in the office of the Immigration and Naturalization Service at If your relative is not eligible for adjustment of status, he or she will (City) (State) apply for a visa abroad at the American Consulate in , (City) (Country) (Designation of a consulate outside the country of your relative's last residence does not guarantee acceptance for processing by that consulate. Acceptance is at the discretion of the designated consulate.) D. Other Information 1. If separate petitions are also being submitted for other relatives, give names of each and relationship. FOIA (b)(6) 2. Have you ever filed a petition for this or any other alien before? Yes No If \"Yes,\" give name, place and date of filing, and result. Warning: The INS investigates-claimed relationships and verifies the validity of documents. The INS seeks criminal prosecutions when family relationships are falsified to obtain visas. Penalties: You may, by law be imprisoned for not more than five years, or fined $250,000, or both, for entering into a marriage contract for the purpose of evading any provision of the immigration laws and you may be fined up to $10,000 or imprisoned up to five years or both, for knowingly and willfully falsifying or concealing a material fact or using any false document in submitting this petition. Your Certification: I certify, under penalty of perjury under the laws of the United States of America, that the foregoing is true and correct. Furthermore, I authorize the release of any information from my records which the Immigration and Naturalization Service needs to determine eligibility for the benefit that I am seeking. Signature semistry Date 7/10/1992 Phone Number (201)777-3279. Signature of Person Preparing Form if Other than Above I declare that I prepared this document at the request of the person above and that it is based on all information of which I have any knowledge. Print Name (Address) (Signature) (Date) G-28 ID Number Volag Number"
}