{
  "anumber": "A44045795",
  "id": "A44045795_0024",
  "page_index": 24,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44045795_0024/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Affidavit of Support, I-134 ( (Rev. 12-1-84) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1980,
        2023,
        1981
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 (Please tear off this sheet before submitting Affidavit) U. S. Department of Justice Immigration and Naturalization Service Affidavit of Support INSTRUCTIONS I. EXECUTION OF AFFIDAVIT. A separate affidavit must An alien applying for SSI must make available to the Social be submitted for each person. You must sign the affidavit in Security Administration documentation concerning his or her your full, true and correct name and affirm or make it under income and resources and those of the sponsor including oath. If you are in the United States the affidavit may be sworn information which was provided in support of the application or affirmed before an immigration officer without the payment for an immigrant visa or adjustment of status. An alien of fee, or before a notary public or other officer authorized to applying for AFDC or Food Stamps must make similar administer oaths for general purposes, in which case the official information available to the State public assistance agency. The seal or certificate of authority to administer oaths must be Secretary of Health and Human Services and the Secretary of affixed. If you are outside the United States the affidavit must Agriculture are authorized to obtain copies of any such be sworn to or affirmed before a United States consular or documentation submitted to INS or the Department of State immigration officer. and to release such documentation to a State public assistance agency. II. SUPPORTING EVIDENCE. The deponent must submit in duplicate evidence of income and resources, as appropriate: Sections 1621(e) and 415(d) of the Social Security Act and subsection 5(i) of the Food Stamp Act also provide that an alien A. Statement from an officer of the bank or other financial and his or her sponsor shall be jointly and severably liable to institution in which you have deposits giving the following repay any SSI, AFDC, or Food Stamp benefits which are details regarding your account: incorrectly paid because of misinformation provided by a 1. Date account opened. sponsor or because of a sponsor's failure to provide infor- 2. Total amount deposited for the past year. mation. Incorrect payments which are not repaid will be 3. Present balance. withheld from any subsequent payments for which the alien or sponsor are otherwise eligible under the Social Security Act or B. Statement of your employer on business stationery, Food Stamp Act, except that the sponsor was without fault or showing: where good cause existed. 1. Date and nature of employment. 2. Salary paid. These provisions do not apply to the SSI, AFDC or Food 3. Whether position is temporary or permanent. Stamp eligibility of aliens admitted as refugees, granted political asylum by the Attorney General, or Cuban/Hait C. If self-employed: entrants as defined in section 501(e) of P.L. 96-422 and of 1. Copy of last income tax return filed or, dependent children of the sponsor or sponsor's spouse. They 2. Report of commercial rating concern. also do not apply to the SSI or Food Stamp eligibility of an alien who becomes blind or disabled after admission into the D. List containing serial numbers and denominations of United States for permanent residency. bonds and name of record owner(s). IV. AUTHORITY/USE/PENALTIES. Authority for the III. SPONSOR AND ALIEN LIABILITY. Effective October collection of the information requested on this form is contain- 1, 1980, amendments to section 1614(f) of the Social Security ed in 8 U.S.C. 1182(a)(15), 1184(a), and 1258. The information Act and Part A of Title XVI of the Social Security Act establish will be used principally by the Service, or by any consular certain requirements for determining the eligibility of aliens officer to whom it may be furnished, to support an alien's who apply for the first time for Supplemental Security Income application for benefits under the Immigration and Nationality (SSI) benefits. Effective October 1981, amendments to section Act and specifically the assertion that he or she has adequate 415 of the Social Security Act establish similar requirements for means of financial support and will not become a public charge. determining the eligibility of aliens who apply for the first time Submission of the information is voluntary. It may also, as a for Aid to Families with Dependent Children (AFDC) benefits. matter of routine use, be disclosed to other federal, state, local Effective December 22, 1981, amendments to the Food Stamp and foreign law enforcement and regulatory agencies, including Act of 1977 affect the eligibility of alien participation in the the Department of Health and Human Services, the Depart- Food Stamp Program. These amendments require that the ment of Agriculture, the Department of State, the Department income and resources of any person who, as the sponsor of an of Defense and any component thereof (if the deponent has alien's entry into the United States, executes an affidavit of served or is serving in the armed forces of the United States), the support or similar agreement on behalf of the alien, and the Central Intelligence Agency, and individuals and organizations income and resources of the sponsor's spouse (if living with the during the course of any investigation to elicit further infor- sponsor) shall he deemed to be the income and resources of the mation required to carry out Service functions. Failure to alian under formulas for determining eligibility for SSI, provide the information may result in the denial of the alien's C, and Food Stamp benefits during the three years application for a visa, or his or her exclusion from the United following the alien's entry into the Unit States. States. F I-134 (Rev. 12-1-84) Y"
}