{
  "anumber": "A44045795",
  "id": "A44045795_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44045795_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-44045795"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1993,
        9003
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPT FORM 155A, (REV. /6-91) DE STATE NSN 7540-01-126-7761 50155-204 IV-44,045,795 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN MISTRY MANCHHABEN CHHABILDAS ACTION BY IMMIGRATIONIINSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA STATES VIA (Name of vessel or flight no. of arrival) WAIVED UNDER SECTION MAR 16 1993 ADMITTED IR-S 3/15/93 KU101 212(e) 212(h) 212(g) 212( (i) CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH UNTIL UNDACH INDIA 28JUL1905 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY BULSAR, IND INDIAN 44045795 MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP X RATNABEN LALBHAI FINAL ADDRESS STREET ADDRESS, INCLUDE-IN CARE OF & APT# IF APPLICABLE CITY, STATE, AND ZIP CODE IN THE UNITED STATES S C MISTRY 105 GREGORY AVE #3C PASSAIC NJ 07055 SEC. 212 (a) (5) (A) OCCUPATION SEX M LABOR CERTIFICATION x NOT APPLICABLE NOT REQUIRED ATTACHED HOU HOUSEWIFE This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL IR5 FOREIGN STATE/OTHER AREA LIMITATION AT BOMBAY INDIA Give Ketras BMB199280006601 44045795 ISSUED ON (Day) (Month) (Year) itsas Consular Officer of the United States of America 12MAR1993 Vice Consul THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) and 09JUL1993 PASSPORT NO. M 096107 OR OTHER TRAVEL DOCUMENTS (Describe) RESERVED TACHED FOREIGN SERVICE UNITED STATES OF AMERICA Tariff No. 21 Fee Paid $ or Local Currency Equivalent IV-44045,795 ACTION OF I.J. PRODFACTION ON APPEAL U.S.P.H.S FOR TEMPORARY EVIDENCE OF Info to date of 1-551 LAWFU ADMISSION FOR Classict ance: given 9003. Nagle Occupy Addr Iss VALIDULINTH ISEP PERMANENT SEPENCIO 1993 F EMPLOYMENT AUTHORIZED"
}