{
  "anumber": "A44045795",
  "id": "A44045795_0010",
  "page_index": 10,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A44045795_0010/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130 ( (Rev. 4/91) Y"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1928,
        1905,
        2023,
        1922,
        1947
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 U.S. Department of Justice OMB #1115-0054 Immi on and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# LAS DISTRICT DIRECTOR PPROVED 07/27/92 EAC-92-218-51120 MAB004 G-28 or Volag, ESC 20 3(a)(3) AUG 271992-1km Section of Law: byt DA Anarkal Petition was filed on: 7-16-92 (priority 201 (b) spouse 203 (a)(1) Personal Interview Previ 201 (b) child 203 (a)(2) POM 0797 Pet 201 (b) parent 203 (a)(4) Ben. \"A\" File Reviewed States 203 (a)(5) Field Investigations I-485 Sin. usly AM CON: Bontay 204 (a)(2)(A) Resolved 204 (h) Resolved Remarks: F31 m/c of parents 10/ pet for Naynahen PANCHAL A. Relationship 1. The alien relative is my 2. Are you related by adoption? 3 Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) MISTRY SHANTILAL CHHABILDAS MISTRY, MANCHHABEN CHHABILDAS 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 105, GREGORY AVE; 3C SONI FALIA ATE POST : KHARA ABRAMA (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) PASSAIC NJ 07055 Ta:NAVSARI, INDIA 396406 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) KHARA ABRAMA INDIA UNDACH, INDIA IND 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single 12/14/1928 Female Widowed Divorced 07/28/1905 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) NONE NONE 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) 05/11/1947 KHARSAD , INDIA 4/15/1922 , UNDACH , INDIA 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) N/A. N/A 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended N/A N/A N/A N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) 20181363 N/A Patents Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No Date authorized stay expired, or will expire, as shown on Form 1-94 or I-95 If \"Yes\", give number of certificate date and place it was issued 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED Rec'd Sent Approved Denied Returned Form 1-130 (Rev. 4.11.91) Y"
}