{
  "anumber": "A45105780",
  "id": "A45105780_0005",
  "page_index": 5,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0005/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "U.S. Visa Application Form, TANIFM ITEM NO.20"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1996,
        2023,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 g. An alien who is permanently ineligible to U.S. citizenship: a person who has departed the United States to evade military service in time of war. (212(a)(8)) Yes No h. An alien who is coming to the United States to practice polygamy: an alien who Is a guardian required to accompany an excluded allen: an alien who withholds custody of a child outside the United States from a United States citizen granted legal custody. (212(a)(9)) Yes No 1. An alien who is a former exchange visitor who has not fulfilled the 2-year foreign residence requirement. (212(e)) Yes No If the answer to any of the foregoing questions is YES or if unsure, explain in the following space or on a separate sheet of paper. 34. Have you ever been arrested, convicted or ever been in a prison or almshouse; have you ever been the beneficiary of a pardon or an amnesty: have you ever been treated in an institution or hospital or other place for insanity or other mental disease. (222(a)) Yes No 35. I am unlikely to become a public charge because of the following Personal financial resources (describe) Employment (attach) Affidavit of Support (attach) 36. Have you ever applied for a visa to enter the United States? Yes No BOMBAY. INDIA, 02.01.8 82 25.10.83. IMMIGRANT, REFUSED (if answer is Yes, state where and when, whether you applied for a nonimmigrant or an immigrant visa, and whether the visa was issued or refused.) BOMBAY 21.03.1978. NON IMMIGRANT, ISSUED. BOMBAY, INDIA,9.1.84. 37. Have you been refused admission to the United States? Yes No IMMIGRANT VISA, ISSUED. (If answer is Yes, explain) 38. Where you assisted in completing this application? Yes No (If answer is Yes, given name and address of person assisting you, indicating whether relative, friend, travel agent, attorney, or other) NAME ADDRESS AMRAILAL G. PATEL, SMITA TRAVEL AGENCY, RELATIONSHIP NAV SARI. \"TRAVEL AGENT 39. The following documents are submitted in support of this application Passport Military record Evidence of own assets Birth certificate Policy certificate Affidavit of support Marriage certificate Medical records Offer of employment Death certificate Photographs Other (describe) Divorce decree Birth certificates of all children who will not be immigrating at this time. (List those for whom birth certificates are not available.) DO NOT WRITE BELOW THE FOLLOWING LINE The consular officer will assist you in answering items 40 and 41. 40. I claim be exempt from ineligibility to receive a visa and exclusion under item in Part 33 for the following reasons 212(a)(5) Beneficiary of a Waiver under Not Applicable 212(a)(3)(D)(ii) 212(e) 1211(h) Not Required 212(a)(3)(D)(iii) 212(g)(1) 1212(i) Attached 212(a)(3)(D)(iv) 212(g)(2) 41. I claim to be A, Family-Sponsored Immigrant I am subject to the following I derive foreign state chargeability Preference An Employment Based-Immigrant A TR-S under Sec. 202(b) through my Numerical limitation Diversity Immigrant (foreign state) A Special Category (Specify) (Returning resident, Hong Keng, Tibetan, Private Lesiglation, etc.) of I understand that I am required to surrender my visa to the United States Immigration Officer at the place where I apply to enter the United States, and that the possession a visa does not entitle me to enter the United States If at that time I am found to be Inadmissible under the immigration laws. I understand that any willfully false or misleading statement or willfull concealment of a material fact made by me herein may subject me to permanent exclusion from the United States and, If I am admitted to the United States, may subject me to criminal prosecution and/or deportation. I. the undersigned applicant for a United States Immigrant visa, do solemnly swear (or affirm) that all statements which appear to this application, consisting of optional of my knowledge and belief. I do further swear (or affirm) that, If admitted into the United States. I will not engage in activities which would be prejudicial to the public interest, best Forms 230 PART I and 230 PART II combined, have been made by me, Including the answers to items 1 through 41 inclusive, and that they are true and complete to the disorder, or In other activities subversive to the national security: In any activity a purpose of which is the opposition to or the control, of overthrow of the Government of the or endanger the welfare, safety, or security of the United States; In activities which would be prohibited by the laws of the United States relating to espionage, Sabotage, public United States, by force, Violence, or other unconstitutional means. I understand all the foregoing statements, having asked for and obtained an explanation on every point which was not clear to me. The relationship claimed in items 14 and 15 verified by documentation submitted to consular officer except as noted 1996 Signature of Applicant Subscribed and sworn to before me this day of 19 at GENERAB use TARIFF ITEM NO.20 (Consular Officer)"
}