{
  "anumber": "A45105780",
  "id": "A45105780_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0000/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Immigrant Visa and Alien Registration, IV-45105780"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "OPTIONAL FORM 155A, (REV. 7-93) DEPT. OF STATE NSN 7540-01-126-7761 50155-205 IV- 451 105,780 IMMIGRANT VISA AND ALIEN REGISTRATION THE IMMIGRANT HAS AKA: PATEL, GANGABEN NATHUBHAI BEEN PREVIOUSLY IN THE UNITED STATES OF: (Family Name) (First Name) (Middle Name) INS FILE #, IF KNOWN PATEL, GANGABEN JERAM ACTION BY IMMIGRATION INSPECTOR THE IMMIGRANT NAMED ABOVE ARRIVED IN THE UNITED INELIGIBILITY FOR VISA WAIVED UNDER SECTION STATES VIA (Name of vessel or flight no. of arrival) 212(a)(3)(D) (iv) U. S. IMMIGRATION 26 ATL #65 DL 15 212(e) 212(h) 212 (g) 212(I) MAR 1.5.1996 CITY AND COUNTRY OF BIRTH MO-DAY-YR OF BIRTH ADMITTED This CLASS BAJIPURA, INDIA 04SEP1907 CITY AND COUNTRY OF LAST RESIDENCE NATIONALITY SURAT, IND INDIAN UNTIL STREET ADDRESS INCLUDE-IN CARE OF & APT# IF APPLICABLE Indy MARITAL STATUS MOTHER'S FIRST NAME FATHER'S FIRST NAME M S W D SEP X BHULIBEN NATHUBHAI FINAL ADDRESS CITY, STATE, AND ZIP CODE IN THE UNITED K J PATEL STATES 2330 WESTBELT DRIVE COLUMBUS, OH 43228 SEC. 212(a) (5) (A) OCCUPATION SEX M LABOR CERTIFICATION NOT APPLICABLE NOT REQUIRED ATTACHED HOU HOUSEHOLD This visa is issued under Section 221 of the Immigration and Nationality Act, and upon the basis of the facts stated in the application. Possession of a visa does not entitle the bearer to enter the United States if at the time he seeks to enter he is found to be inadmissible. Upon arrival in the United States, it must be surrendered to a United States Immigration Officer. IMMIGRANT CLASSIFICATION CLASSIFICATION SYMBOL AMERICAN CONSULATE GENERAL IR5 FOREIGN STATE/OTHER AREA LIMITATION BOMBAY INDIA AT BMB 199578601201 45105780 lane J. Tannenbaura ISSUED ON (Day) (Month) (Year) 13FEB1996 Consul Consular Officer of the United States of America THE VALIDITY OF THIS VISA EXPIRES MIDNIGHT AT THE END OF (Day) (Month) (Year) 11JUN1996 PASSPORT NO. E 508473 OR OTHER TRAVEL DOCUMENTS (Describe) PHOTOGIA RESERVED FORE UNITED STATES OF AMERICA Tariff No. 21 Fee Paid $ IV- 45105780 or Local Currency Equivalent ACTION OF I.J. ACTION ON APPEAL U.S.P.H.S. Info given to IRS on date of 1-551 Issuance Name Addr. DOB, A#, Class of Adm, Oseep & answers to Form 9003,"
}