{
  "anumber": "A45105780",
  "id": "A45105780_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "BlankenBecler and Stenger Certified Public Accountants"
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 BlankenBecler and Stenger Certified Public Accountants 465 Waterbury Court Gahanna, Ohio 43230 Phone (614) 475-7560 Royal Inn Motel Fax (614) 475-7561 2330 Westbelt Drive Columbus, OH 43228 To the Board of Directors: We have compiled the accompanying Statement of Assets, Liabilities, and Equity of Royal Inn Motel as of August 31, 1995, and the related Statement of Revenue, Expenses & Retained Earnings and Statement of Cash Flows for the eight months then ended in accordance with Statements on Standards for Accounting and Review Services established by the American Institute of Certified Public Accountants. All information included in these financial statements is a representation of the management of Royal Inn Motel. The financial statements have been prepared on the accounting basis used by the company for federal income tax purposes, which is a comprehensive basis of accounting other than generally accepted accounting principles. A compilation is limited to presenting, in the form of financial statements, information that is the representation of management. We have not audited or reviewed the accompanying financial statements and, accordingly, do not express an opinion or any other form of assurance on them. Management has elected to omit substantially all of the disclosures ordinarily included in financial statements. If the omitted disclosures were included in the financial statements, they might influence the user's conclusions about the company's assets, liabilities, equity, revenue, and expenses. Accordingly, these financial statements are not designed for those who are not informed about these matters. Sincerely, Bt BlankenBecler & Stenger October 10, 1995 Offices: Waterbury Gabanna and Mill Run Hilliard Member: American Institute of Certified Public Accountants and Ohio Society of Certified Public Accountants"
}