{
  "anumber": "A45105780",
  "id": "A45105780_0004",
  "page_index": 4,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0004/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION, 230A"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Germany",
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 OMB APPROVAL NO.1406-0015 EXPRESS 08-31-92 ESTIMATED BURDEN 23 HOUR APPLICATION FOR IMMIGRANT VISA AND ALIEN REGISTRATION PART II 6 SWORN STATEMENT INSTRUCTIONS Complete one copy of this form for yourself and each member of your family, regardless of age, who will immigrate with you. Please print or type your answer to all questions. Questions that are Not Applicable should be so marked. If there is insufficient room on the form, answer on a separate sheet using the same numbers as appear on the form. Attach the sheet to this form. DO NOT SIGN this form until instructed to do so by the consular officer. The fee for filing this application is listed under tariff item No.20 The fee should be paid in United States dollars or local currency equivalent, or by bank draft, when you appear before the consular officer. WARNING Any false statement or concealment of a material fact may result in your permanent exclusion from the United States. Even though you should be admitted to the United States, a fraudulent entry could be grounds for your procecution and/or deportation. This form is continuation of Form OF-230 PART which together, constitute the complete Application for Immigrant Visa and Alien Registration. 24. FAMILY NAME FIRST NAME MIDDLE NAME PATEL GANGABEN JERAM. 25. ADDRESS (Local) 26. FINAL ADDRESS TO WHICH YOU WILL TRAVEL IN THE UNITEDSTATES AT: & POST: PARDI-PATA, (Street address including ZIP code) VIA: PUNI. TAL: PALSANA, KISHORBHAI J. PATEL, DIST: :SURAT, GUJARAT, INDIA. 2330 WESTBELT DRIVE, COLUMBUS, OHIO, 43228, U.S.A. Telephone No. N.A. Telephone No. 614-529-8927. 27. PERSON YOU INTEND TO JOIN (Name, address and relationship) 28. NAME AND ADDRESS OF SPONSORING PERSON OR EMPLOYER KISHORBHAI J. PATEL. KISHORBHAI J. PATEL, 2320, WESTBELT DRIVE, COLUMBUS, OHIO, 43228, U.S.A. 2330, WESTBELT DRIVE, COLUMBUS, OHIO, 43228,U.S.A. \"SON 29. PURPOSE IN GOING TO THE UNITED STATES 30. LENGTH OF INTENDED STAY (If permanently, so state) IMMIGRANT, (JOINING SON) PERMANENTLY. 31. INTENDED PORT OF ENTRY 32. DO YOU HAVE A TICKET TO FINAL DESTINATION? COLUMBUS, U.S.A. Yes No 33. United States laws governing the issuance of visas require each applicant to state whether or not he or she is a member of any class of individuals excluded from admission into the United States. The excludeable classes are described below in general terms. You should read carefully the following list and answer YES or NO to each category. The answers you give will assist the consular officer to reach a decision on your eligibility to receive a visa. EXCEPT AS OTHERWISE PROVIDED BY LAW ALIENS WITHIN THE FOLLOWING CLASSIFICATIONS ARE INELIGIBLE TO RECEIVE A VISA. DO ANY OF THE FOLLOWING CLASSES APPLY. TO YOU? a. An alien who has a communicable disease of public health significance, or has or has had a physical or mental disorder that poses, or is likely to pose a threat to the safety or welfare of the alien or others: an alien who is a drug abuser or addict. (212(a)(1)) Yes No b. An alien convicted of, or who admils committing a crime involving moral turpitude, or violation of any law relating to a controlled substance; an alien convicted of 2 or more offenses for which the aggregate sentences were 5 years or more; an alien coming to the United States to engage in prostitution or commercialized vice, or who has engaged in prostitution or procuring within the past 10 years; an alien who is or has been an illicit trafficker in any controlled substance; an alien who has committed a serious criminal offense in the United States and who has asserted immunity from prosecution. (212(a)(2)) Yes No C. Alien who seeks to enter the United States to engage in espionage, sabotage, export control violations, overthrow of the Government of the United States, or other unlawful activity, an alien who seeks to enter the United States to engage in terrorist activities; an alien who has been a member of or affiliated with the Communist or any other totalitarian party; an alien who under the direction of the Nazi government of Germany, or any area occupied by, or allied with the Nazi Government of Germany, ordered, incited, assisted, or otherwise participated in the persecution of any person because of race, religion, national origin, or political opinion; an alien who has engaged in genocide (212(a)(3)) Yes No d. An alien who is likely to become a public charge (212(a)(4)) Yes No e. An alien who seeks to enter for the purpose of performing skilled or unskilled labor who has not been certified by the Secretary of Labour an alien graduate of a foreign medical school seeking to perform medical services who has not passed the NBME exam or its Yes No equivalent. (212(a)(5)) Not Applicable f. An alien previously deported within one year, or arrested and deported within 5 years; an alien who seeks or has sought a visa; entry into the United States, or any U.S. immigration benefit by fraud or misrepresentation; an alien who knowingly assisted any other alien to enter or try to enter the United States in violation of the law; an alien who is in violation of Section 274C of the immigration Act. (212(a)(6)) Yes No THIS FORM MAY BE OBTAINED GRATIS AT CONSULAR OFFICES OF THE UNITED STATES OF AMERICA OPTIONAL FORM 230 II (English) REVISED 4-91 Previous editions obsolete DEPT OF STATE."
}