{
  "anumber": "A45105780",
  "id": "A45105780_0003",
  "page_index": 3,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0003/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Freedom of Information Act ( Request for Records,, FOIA(b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States",
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1985,
        2023,
        1984,
        1978
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 PAGE 2 16. PERSON(S) NAMED IN 14 AND 15 WHO WILL ACCOMPANY OR FOLLOW ME TO THE UNI STATES. NONE. 17. NAME OF FATHER, DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) LATE PATEL NATHUBHAI RANCHHODBHAI. EXPIRED DATE NOT RNOKIN. 18. MAIDEN NAME OF MOTHER DATE AND PLACE OF BIRTH, AND ADDRESS (If deceased, so state, giving year of death) LATE PATEL BHULIBEN PARSHOTAMBHAI. EXPIRED DATE NOT KNOWIN. 19 IF NEITHER PARENT IS LIVING DROVIDE FOIA (b)(6) 20. LIST ALL LANGUAGES YOU CAN SPEAK, READ, AND WRITE LANGUAGE SPEAK READ 88 WRITE GWARATI YES. YES. No. 21. LIST BELOW ALL PLACES YOU HAVE LIVED FOR SIX MONTHS OR LONGER SINCE REACHING THE AGE OF 16. BEGIN WITH YOU PRESENT RESIDENCE CITY OR TOWN PROVINCE COUNTRY is OCCUPATION PARDI- PATA, GUJARAT, INDIA. HOUSE WIFE. 3T1H922-1978 DATES (FROM/TO MAY. CHICAGO, U.S.A. MAY. DEC: NIL 1978- 1978. PARDI. PATA, GUJARAT. INDIA. HOUSE WIFE. DEC: MAY. 1978 - 1984. SPRINGFIELD, U.S.A. NIL. MAY - OCT; 1984. 1985. PARDIA PATA, GUJARAT NDIA. OCT; TILL NIL: 1985- To.DAY. 22. LIST ANY POLITICAL: PROFESSIONAL, OR SOCIAL ORGANIZATIONS AFFILIATED WITH COMMUNIST, TOTALITARIAN, TERRORIST OR NAZI ORGANIZATIONS WHICH YOU ARE NOW OR HAVE BEEN A MEMBER OF OR AFFILIATED WITH SINCE YOUR 16TH BIRTHDAY. NAME AND ADDRESS FROM/TO TYPE OF MEMBERSHIP NOT APPLICABLE. 23. LIST OF DATES OF ALL PREVIOUS RESIDENCE IN OR VISIT TO THE UNITED STATES. (If never, so state) GIVE TYPE OF VISA STATUS IF ANY. GIVE I.N.S. \"A\" NUMBER IF ANY. LOCATION FROM/TO VISA I.N.S. FILE NO. (If known) CHICAGO. U.S.A. NON MAY-1978-DE1978. IMMIGRANT. SPRING FIELD, U.S.A. MAY-1984-OCT:1985 IMMIGRANT. A36196477. GREEN CARD No:- SIGNATURE OF APPLICANT DATE 2/12/96 NOTE : Return this ted form immediate to the nsular office address on the vering letter, This Torm will become part of our immig your visa application as be processed until this complete. *Public reporting burden for this collection of information is estimated to average 24 hours per response, including time required for searching existing data sources, gathering the necessary data, providing the information required, and reviewing the final collection Send comments on the accuracy of this estimate of the burden and recommendations for reducing it to: Department of State (OIS/RA/DR) Washington, D.C. 20520-0264, and to the Office of information and Regulatory Affairs, Office of management and Budget, Paperwork Reduction Project (1405-0015), Washington, D.C.20503. *U.S. government Printing Office: 1992-312-071/50088"
}