{
  "anumber": "A45105780",
  "id": "A45105780_0006",
  "page_index": 6,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A45105780_0006/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "female"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Petition for Alien Relative, I-130"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "India"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1995,
        1982,
        1945,
        1987,
        2023,
        1957,
        1967
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 8/15/2023 U.S. Department of Justice OMB #1115-0054 Immigration and Naturalization Service (INS) Petition for Alien Relative DO NOT WRITE IN THIS BLOCK - FOR EXAMINING OFFICE ONLY Case ID# Action Stamp A# APPROVED I.N.S RAC DIRECTOR 01/05/95 LIN-95-064-51837 LINBYB01 G-28 or Volag SEP 20 1995 Section of Law 201 (b) spouse 203 (a)(1) Jollaw Petition was filed on: 1-3-95 (priority date) Recommended by Personal Interview sly Forwarded 201 (b) child 203 (a)(2) 201 (b) parent 203 (a)(4) 6700 Pet Ben. \"A\" File Reviewed Criteria 203 (a)(5) Field Investigations jultaneously AM CON: BOMBAY 204 (a)(2)(A) Resolved Resolved Remarks: IRO A. Relationship 1. The alien relative is my MOTHER 2. Are you related by adoption? 3. Did you gain permanent residence through adoption? Husband/Wite Parent Brother/Sister Child Yes No Yes No B. Information about you C. Information about your alien relative 1. Name (Family name in CAPS) (First) (Middle) 1. Name (Family name in CAPS) (First) (Middle) PATEL KiSHORBHAI J. PATEL, GANGABEN JERAMBHAI 2. Address (Number and Street) (Apartment Number) 2. Address (Number and Street) (Apartment Number) 2330 WESTBELT DRIVE - AT. PARDIPATA. B. LAKHANPOR (Town or City) (State/Country) (ZIP/Postal Code) (Town or City) (State/Country) (ZIP/Postal Code) COLUMBUS OH 43228 V.I- PUNI. DiST SURAT BOMBAY. (INDIA 3. Place of Birth (Town or City) (State/Country) 3. Place of Birth (Town or City) (State/Country) PARDIPATA INDIA AT. BAJIPURA ENDjA 4. Date of Birth 5. Sex 6. Marital Status 4. Date of Birth 5. Sex 6. Marital Status (Mo/Day/Yr) Male Married Single (Mo/Day/Yr) Male Married Single JUNe 11th 1945 Female Widowed Divorced APRIL-9-1957 Female Widowed Divorced 7. Other Names Used (including maiden name) 7. Other Names Used (including maiden name) N/A N/A 8. Date and Place of Present Marriage (if married) 8. Date and Place of Present Marriage (if married) MAY-12-1967 INDIA N/A 9. Social Security Number 10. Alien Registration Number (if any) 9. Social Security Number 10. Alien Registration Number (if any) FOIA (b)(6) - 324-74-2788 A - 38196477 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended 11. Names of Prior Husbands/Wives 12. Date(s) Marriages(s) Ended DURGABEN N/A JERAMBHAI N/A 13. If you are a U.S. citizen, complete the following: 13. Has your relative ever been in the U.S.? My citizenship was acquired through (check one) Yes No Birth in the U.S. N/C ste 929/CAO 8/15/95 14. If your relative is currently in the U.S., complete the following: He or Naturalization (Give number of certificate, date and place it was issued) she last arrived as a (visitor, student, stowaway, without inspection, etc.) 11436273 - CINCINNATESOH LEFT U.SA 74-1987 NAVER COME BACK Parents Feb-19-1982 Arrival/Departure Record (1-94) Number Date arrived (Month/Day/Year) Have you obtained a certificate of citizenship in your own name? Yes No N/A Date authorized stay expired, or will expire, as shown on Form I-94 or I-95 If \"Yes\", give number of certificate, date and place it was issued N/A 15. Name and address of present employer (if any) 14a. If you are a lawful permanent resident alien, complete the following: N/A Date and place of admission for, or adjustment to, lawful permanent residence, Date this employment began (Month/Day/Year) and class of admission NIA N/A 16. Has you relative ever been under immigration proceedings? 14b. Did you gain permanent resident status through marriage to a United Yes No Where When States citizen or lawful permanent resident? Yes No Exclusion Deportation Recission Judicial Proceedings INITIAL RECEIPT RESUBMITTED RELOCATED COMPLETED JAN 03 3 1995 -730 AM Rec'd Sent Approved Denied Returned Form I-130 (Rev. 4:11/9T) J A"
}