{
  "anumber": "A71666262",
  "id": "A71666262_0013",
  "page_index": 13,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666262_0013/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "REGISTRATION FOR CLASSIFICATION AS REFUGEE, I-590 ( (Rev. 5-1-80) N"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1067,
        1988,
        1948,
        2023,
        1991
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/19/2023 REGISTRATION Form Approved FOR CLASSIFICATION AS Budget Bureau No. 43-R0408 REFUGEE UNITED STATES DEPARTMENT OF JUSTICE Section 207 IMMIGRATION AND NATURALIZATION SERVICE Immigration and File No. Nationality Act A FOIA (b)(6) REGISTRANT TO FURNISH THE FOLLOWING INFORMATION (READ INSTRUCTIONS ON REVERSE) TYPE OR PRINT 1. My name 101 First Middle Last LUL 2. My present address 1st MEHAMED SHIDE LITANGE REFUGE CAMP Sence 3. I was born on: (month)(day)(year) Place of birth (city or town) JHIN 1, 1948 (Province) (Country) GODEY /sonialie SoMalia My present nationality 1.: 4. Height SONALIN Weight SOMALI Eyes Hair 1,60 Complexion 58 Marks or Scars Black BLACK NORMAL NiLL 5. I fled or was displaced from (Name of country) SOMALIA On or about (month) (day) (year) 6. Reasons: (State In detail) SEPT 1991 BECHUSE of the CIVIL WAR 7. My present Immigration status In KENYA 1st Re Fn GET (Country In which residing) The evidence of my Immigration status In the country In which I am residing 1e: Asylum - SEEKER E/0401 CR.NO 0.110470 (Describe) IX MISCELED 1067/02 1988 PING FOIA (b)(6) 8. My spouse's name is: only divorced 9. (Hie)(Her) present address is: 10. Spouse's nationality le: 11. My spouse will will not accompany me to the United States 12. Name of child(ren) FOIA (b)(6) Place a mark (X) In front of name of each child who will accompany you to the United States 13. Schooling or Education Name and location of school Type Dates attended Title of Degree or Diploma NONE NONE NONE NONE NONE revenue 14. Military Service NONE Country Branch and Organisation Dates Serial No. Rank Attained Form I-590 (Rev. 5-1-80) N FOIA (b)(6)"
}