{
  "anumber": "A71666262",
  "id": "A71666262_0000",
  "page_index": 0,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666262_0000/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Sworn Statement of Refugee Applying for Entry into the United States"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/19/2023 U.S. Department of Justice Sworn Statement of Refugee Applying for Immigration and Naturalization Service Entry into the United States Name Mohamed Shide Barre A71 666 262 APPLICANTS MUST ESTABLISH THAT THEY ARE ADMISSIBLE TO THE UNITED STATES, EXCEPT AS OTHERWISE PROVIDED BY LAW, ALIENS WITHIN ANY OF THE FOLLOWING CLASSES ARE NOT ADMISSIBLE TO THE UNITED STATES: 1. Aliens who have committed or who have been con- 8. Aliens who have applied for exemption or discharge victed of a crime involving moral turpitude (does not from training or service in the Armed Forces of the include minor traffic violations); United States on the ground of alienage and who have 2. Aliens who have been engaged in or who intend to been relieved or discharged from such training or engage in any commercialized sexual activity; service. 3. Aliens who are or at any time have been, anarchists, 9. Aliens who are mentally retarded, insane, or have or members of or affiliated with any communist or suffered one or more attacks of insanity; other totalitarian party, including any subdivision or 10. Aliens afflicted with psychopathic personality, sexual affiliate thereof; deviation, mental defect, narcotic drug addiction, 4. Aliens who have advocated or taught, either by per- chronic alcoholism or any dangerous contagious sonal utterance, or by means of any written or printed disease; matter, or through affiliation with an organization, 11. Aliens who have a physical defect, disease or disability (i) opposition to organized government, (ii) the over- affecting their ability to earn a living; throw of government by force or violence, (iii) the 12. Aliens who are paupers, professional beggars or vagrants; assaulting or killing of government officials because of 13. Aliens who are polygamists or advocate polygamy; their official character, (iv) the unlawful destruction 14. Aliens who have been excluded from the United States of property, (v) sabotage, or (vi) the doctrines of within the past year, or who at any time have been world communism, or the establishment of a total- deported from the United States, or who at any time itarian dictatorship in the United States; have been removed from the United States at Govern- 5. Aliens who intend to engage in prejudicial activities or ment expense; unlawful activities of a subversive nature; 15. Aliens who have procured or attempted to procure a 6. Aliens who have been convicted of violation of any visa by fraud or misrepresentation; law or regulation relating to narcotic drugs or mari- 16. Aliens who have departed from or remained outside juana, or who have been illicit traffickers in narcotic the United States to avoid military service in time of drugs or marijuana; war or national emergency. 7. Aliens who have been involved in assisting any other aliens to enter the United States in violation of law; Do any of the foregoing classes apply to you? Yes No (If answer is Yes, explain on reverse) Further, I have never ordered, assisted or otherwise participated in the persecution of any person because of race, religion or political opinion. I understand all the foregoing statements, having asked for and obtained a translation or explanation of every point which was not understood or clear to me. Suliman (COMPLETE & TRUE SIGNATURE OF APPLICANT) Subscribed and sworn to (Affirmed) by the above named applicant before me this day Signature of Interpreter 19 at of 23 MAR 1995 \"IFO, Kenya Name of Interpretor (Print) Signature of Officer Signature of Interpreter Title Name of Interpretor (Print) Form G-646 (Rev. 4-30-83)N GPO:1990-267-697 GPO 898-396"
}