{
  "anumber": "A71666262",
  "id": "A71666262_0030",
  "page_index": 30,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666262_0030/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Registration for Classification as Refugee, OMB 1115-0057"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1949,
        1943,
        1905,
        1981,
        1945,
        1948,
        1953,
        2023,
        1991,
        1997,
        1950
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/19/2023 U.S. Department of Justice OMB No. 1115-0057 Immigration and Naturalization Service Registration for Classification as Refugee Type or print the following information. (Read instructions on reverse) A File No.: A71 666 262 1. Name: (First) (Middle) (Last) MAHAMED SHIDE BARRE. 2. Present address: 1Fo REFUGEE CAMP 3. Date of birth: (month/day/year) Place of birth (city or town) (Province) (Country) Present nationality: Jane Country 1905 KISMAYO 4JUBB3 Sometin SOMAL: 4. from which I fled or was displaced : SOMALiA On or about (month/day/year): 5. Reasons (State in detail): / fted From my country is because of the Revange War and March 1991 DOA Kenya (via Liboi) clan Seeker and we are among the clan that was seeking thu((USC) because of our Clan (DAROOD) So the (USC) killed two of my SON'S and they were injured my SON in the fleeing lime. cooting All our property toture, So When we faced that problem we have decided to tled our country 6. My present immigration status in KENYA is: ASYLUM SEEKER (country in which residing) Evidence of my immigration status is: RATION CARD (Describe) 2 Hawo Forch Warsome div Mer 1981 1953 unknown bch. 7. Name of spouse: mar 1943 Islan 8. Present address of spouse ( if different): 9. Nationality of spouse: FADUMO DABAR 9ch. U.S.A ref '93 SOMALI 10. My spouse will will not accompany me to the United States. 11. Name of child (ren) Date of birth Place of birth Present FOIA (b)(6) Place a mark (x) in front of name of each child who will accompany you to the United States. 12. Schooling or education Name and location of school Type Dates attended Title of degree or diploma J (hall 13. Military service Country New Branch and organization Dates Serial No. Rank attained Form 1-590 (Rev. 11-13-92)Y 12. Name of child(ren) Date of birth Place of birth Present address Husein Marand 1945 MUGDISH DECEMSED Murayad u 1997 IFo LUL 4 1948 USA HAYM u 1949 DECEASED MUHUMEDII 1950 DECEASED Place a mark (X) in front of name of each child who will accompany you to the United States 12. Name of child(ren) Date of birth Place of birth Present address FOIA (b)(6) Place a mark (X) in front of name of each child who will accompany you to the United States"
}