{
  "anumber": "A71666262",
  "id": "A71666262_0011",
  "page_index": 11,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71666262_0011/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "letter"
    },
    "form_title": {
      "ms_form_title_llm_v1": "AFFIDAVIT OF RELATIONSHIP, FOIA ( (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States",
        "Somalia"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1948,
        1992,
        1993,
        2023,
        1994
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/19/2023 DATE RECEIVED APR 6 94 272 NAT So 3 DUP. MK cloi DEPT. RECORD 07 APR 1994 UA INTERNATIONAL RESCUE COMMITTEE 162 BOYLSTON STREET, SUITE 50 BOSTON, MA 02116 FAX NEEDED (711)7-482-1154 AFFIDAVIT OF RELATIONSHIP Date Filed: March 25, 1994 SECTION I: I am filing this Affidavit for the following person(s) located in : Utange refugee camp Date of arrival in that country: Dec 1992 Name (and AKA) Sex Place/Date of Birth Relation to you Present Location/Camp (Month/Date/Year) Name/Address Mohamed Shide M Somalia/Unknown Father Utange HUSBAND Murayat Mohamed Shide F Mogadishu/1947 Sister 2ch missing Utange - FOIA (b)(6) Your name (and AKA) Lul Mohamed Shide Alien Number (if applicable) FOIA (b)(6) Date of Birth (M-D-Y) Jan. 1, 1948 Sex F Your PRESENT Immigration Status is: (check one) Place of Birth Somalia U.S. Citizen. Cert. No. Address 21 Wyeth St. #7 Date Naturalized X 3 OF 227 Malden, Mass. 02148 Permanent Resident Phone Number (home) (617) 321-9976 Date of Adm/Adj Rest creditle defentaly NOT (work) Conditional Resident. Valid until Refugee. Date of admission Dec. 15, 1993 Your country of first asylum, Kenya Asylee. Date granted Agency through which you came Other (please explain) to the United States I.R.C. Original Case Number FOIA (b)(6) YOU MUST INCLUDE A COPY OF BOTH SIDES OF YOUR I-94 OR YOUR PERMANENT RESIDENT ALIEN CARD (PRA, GREEN CARD, OR I-551) WITHOUT THESE DOCUMENTS YOUR AFFIDAVIT MAY NOT BE VALID. The purpose of this Affidavit is to verify your relationship to refugees overseas. Failure to provide complete and accurate information may impede the admission of requested refugees to the U.S. If information is unkown to you, indicate \"unknown\". If anyone uses an alias, provide it. If anyone is deceased or their present location is unknown, please indicate. Be sure to include all relatives as sepcified , anywhere in the world, living deceased or missing.. Use the space marked \"Additions/Explanations\" to explain any unusual relationships including adopted, half or step relatives. VISION roos s donsM 20170x3 nolaeimmo3"
}