{
  "anumber": "A71718847",
  "id": "A71718847_0015",
  "page_index": 15,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71718847_0015/full/max/0/default.jpg"
  },
  "fields": {
    "sex": {
      "ms_sex_llm_v1": "male"
    },
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Medical Examination of Applicants for United States Visas, A 71 718 847"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1895,
        1993,
        2023,
        1996
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/12/2023 4 ZAH A 71 718 847 PLACE MEDICAL EXAMINATION OF APPLICANTS BRUCE HOUSE FOR UNITED STATES VISAS DATE OF EXAMINATION (Mo., Day, Yr.) April 13 1996 CITY COUNTRY At the request of the American Consul at NAIROBI KENYA NAME (Last in CAPS) (First) (Middle) DATE OF BIRTH SEX (Mo., Day, Yr.) I certify that on the above date I examined F M RASHID ZAHRA BASHU 1895 WHO BEARS PASSPORT NO. ISSUED BY ON GENERAL PHYSICAL EXAMINATION I examined specifically for evidence of the conditions listed below. My examination revealed: No apparent defect, disease, or disability The conditions listed below were found (Check boxes that apply) CLASS A CONDITIONS (Give pertinent details under Remarks) CLASS B CONDITIONS Chancroid Gonorrhea Hansen's Disease, Infectious Tuberculosis, Active Tuberculosis, Not Active Lymphogranuloma Venereum Granuloma Inguinale Human Immunodeficiency Hansen's Disease, Not Infectious Syphilis, Infectious Virus (HIV) Infection Other Physical Defect, Disease Mental Retardation or Disability: Insanity Previous Occurrence of One or Mental Defect (ACHEXI A 2 PNEUMONIA More Attacks of Insanity Sexual Deviation Narcotic Drug Addiction Psychopathic Personality Chronic Alcoholism 3 EMPHYSEMA 4 PEDICULOSIS- SCALP EXAMINATION FOR TUBERCULOSIS TUBERCULIN SKIN TEST (See USPHS Instructions) CHEST X-RAY REPORT 5 RIGHT CORNEAL OPACITY Normal No reaction 6 ANAEMIA Abnormal Not Done 7 DIMINISHED HEARING Describe findings: Reaction mm Emphysematous lung fields with lot flat Not Done diaphragm are seen with patchy consolidation left midzone laterally and prominent P.T.O. DOCTOR'S NAME (Please print) DOCTOR'S NAME (Please print) DATE READ DATE READ DR. P. P. SHAH 11 APR 96 SEROLOGIC TEST FOR SYPHILIS SEROLOGIC TEST FOR HIV ANTIBODY Reactive Titer (Confirmatory test performed - Indicate treatment under Remarks) Positive (Confirmed by Western Blot or equally reliable test) Nonreactive Negative Not Done Not Done TEST TYPE: VDRL TEST TYPE: HIV ANTIBODY SCREENING DOCTOR'S NAME (Please print) DATE READ DOCTOR'S NAME (Please print) DATE READY THE NAIROBI HOSPITAL 16 APR 96 THE NAIROBI HOSPITAL 16 APR 96 OTHER SPECIAL REPORT(S) (When needed) Urine routine- Protein - nil, Glucose - nil DR. C. S. SHETH Stool routine- Ascaris lumbricoides, Trichuris trichiura DOCTOR'S NAME (Please print) REMARKS Stool - i) Ova of Ascaris lumbricoides ii) Ova of Trichuris trichiura Prescribed Zentel P.T.O. APPLICANT CERTIFICATION on this form refers to me. I certify that I understand the purpose of the medical examination and I authorize the required tests to be completed. The information (Left thumb) 13 APR 19yt Signature Date DOCTOR'S NAME (Please type or print clearly) DOCTOR'S SIGNATURE DATE DR. C. S. SHETH 50157-103 G 6 JUNE 96 NSN 7540-00-139-0058 OPTIONAL FORM 157 REVISED 2-88 GPO : 1993 o - 151-311 DEPT. OF STATE"
}