{
  "anumber": "A71718847",
  "id": "A71718847_0007",
  "page_index": 7,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71718847_0007/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Registration Form, NARA-1045236"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        1990,
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/12/2023 Page 2 14. Political, professional or social organizations of which I am now or have been a member or with which I am now or have been affiliated since my 16th birthday (If you have never been a member of any organization, state \"Nope. 15. I have have not been charged with a violation of law. (If you have ever been charged with a violation of law, give date, place and nature of each charge and the final result.) 16. I have have not been in the United States. (If you have ever been in the United States, show the dates of entry and departure and the purpose of your entry (visitor permanent resident, student, seaman, etc.). File or Alien Registration Number: 17. I have the following close relatives in the United States: Name Relationship Present address 18. I am being sponsored by Name and address of United States sponsor): Date: 08 DEC 1995 Signature of registrant: DO NOT WRITE BELOW THIS LINE I, do swear (affirm) that I know the contents of this registration subscribed by me including the attached documents, that the same are true to the best of my knowledge, and that corrections numbered ) tot by me or at my request, and that this registration was signed by me with my full, true name: (Complete and true signature of registrant) Subscribed and sworn to before me by the above-named registrant at MOMBASA KENYA. on 3 DEC 1995 New (month/day/year) VAROCH (Signature and title of officer) HAPPROV ED INTERVIEW MPPROMEDCT DI. ECTOR DATE J DEC 1995 DATE DEC 13 1990 AT MOMBASA Immigration KENYA Officer Receiving Nin Officer in Charge INSTRUCTIONS R.Y This form should be executed. signed and submitted to the Officer in Charge of the nearest overseas office of the United States Immigration and Naturalization Service. When your name has been reached as a registrant you will be furnished additional instructions. Registration - A separate Registration Form must be executed by each registrant and submitted in one copy. A Registration Form in behalf of a child under 14 years of age shall be executed by the parent of guardian. Public reporting burden for this collection of information is estimated to average 35 minutes per response. If you have comments regarding the accuracy of this estimate or suggestions for simplifying this form, you can write to both the U.S. Department of Justice, Immigration and Naturalization Service Policy Directives and Instructions Branch (HQPDIB), Washington, D.C. 20536 and to the Office of Management and Budget, Paperwork Reduction Project: OMB No. 1115-0057, Washington, D.C. 20503. U.S.GPO 0:1994-580-274/80183"
}