{
  "anumber": "A71718847",
  "id": "A71718847_0027",
  "page_index": 27,
  "resources": {
    "full_jpg": "https://dctn4zjpwgdwdiiy5odjv7o2se0bqgjb.lambda-url.us-east-1.on.aws/iiif/3/og-2023-kc-nara_A71718847_0027/full/max/0/default.jpg"
  },
  "fields": {
    "doctype": {
      "ms_doctype_v1": "form"
    },
    "form_title": {
      "ms_form_title_llm_v1": "Joint Voluntary Agency Representative/Kenya, FOIA (b)(6)"
    },
    "countries": {
      "ms_countries_nlp_v1": [
        "Kenya",
        "United States"
      ]
    },
    "years": {
      "ms_years_nlp_v1": [
        2023,
        1995
      ]
    }
  },
  "is_g325a": false,
  "is_cert_naturalization": false,
  "full_text": "Screened by NARA, 5/12/2023 Ne Joint Volui ary Agency Representacive/KENYA UNITED STATES REFUGEE RESETTLEMENT PROGRAMME P.Q Pox 14176 Office: MAUA CLOSE NAIROBI, Kenya Tel. 745311; 743032 WESTLANDS Fax: 411922 Administered through Church World Service Fax 254-2-742035 DATE: December 13,1995 LOCATION: Mambasa Kenya NAME OF PA FOIA (b)(6) A# ACCOMPANYIN FOIA (b)(6) A# DEPENDENTS: FOIA (b)(6) A# A# A# A# A# A# ZAHRA BASHIR DASHID A# 71 718 847 A# - 1 DEAR APPLICANT: THE U.S. IMMIGRANT AND NATURALIZATION SERVICE HAS DETERMINED THAT YOU ARE ELIGIBLE FOR RESETTLEMENT IN THE UNITED STATES AS AREFUGEE UNDER SECTION 207 OF THE U.S. IMMIGRATION AND NATIONALITY ACT. UNITED YOU WILL NEED TO MAKE YOUR OWN ARRANGEMENTS TO TRAVEL TO NAIROBI76 FOR YOUR MEDICAL EXAM AND DEPARTURE ARRANGEMENTS. YOU SHOULD REPORT TO THE INTERNATIONAL ORGANIZATION FOR MIGRATION (I.O.M.) ON THEY ARE LOCATED ON AMBOSELI ROAD, OFF (GITANGA ROAD) AND HAVE OFFICE HOURS FROM 8:30 AM TO 12:30 PM. I. O. M. WILL MAKE ARRANGEMENTS FOR YOUR PHOTOGRAPHS, MEDICAL EXAM, AND ECULTURAL ORIENTATION CLASSES. LOTHIS IS ALL FREE OF CHARGE. THESE ARE ALL REQUIREMENTS FOR YOUR CLEARANCE TO ENTER THE UNITED STATES OF AMERICA. YOU WILL HAVE FOUR PHOTOGRAPHS TAKEN OF EACH PERSON, WHICH SHOULD BE GIVEN TO THE MEDICAL DOCTOR. THE DOCTOR WILLOINOT EXAMINE YOU WITHOUT THE PHOTOGRAPHS. DEPENDENTS: WHEN ALL ADMISSION REQUIREMENTS ARE COMPLETED, AND THIS OFFICE HAS RECEIVED AUTHORITY TO DO so, TRAVEL TOA THE UNITED STATES WILL BE ARRANGED FOR YOU. YOUR NAME WITH THEN APPEAR ON A TRAVEL LIST POSTED AT THE J.V.A OFFICE. A SINCERELY, A June alus, WAR006 A for OFFICER IN (CHARGE THE U.S. IMMIGRANT AND DETERMINED THAT 1/95 ARE EDIGIN PLEASE TURN OVER FOR PHOTO IDENTIFICATION REFUGEE UND SECTION 207 NATIONALITY ACT. WILL TRAVEL TO NATRORI FOR YOUR YOU SHOULD TO THE ON AMBOSELI ROAD, YGTTANGA ROAD) MAKE ARRANGEMENTS MEDICAL EXAM, ECULTURAL ORIENTATION CHARGE. THE UNITED PHOTOGRAPI EACH THE DOCTOR"
}